<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>SELFHTML: Divers compl&eacute;ments techniques / Codes d'&eacute;tat HTTP</title>
<link rel="stylesheet" type="text/css" href="../src/selfhtml.css">
<meta name="description"    content="Welche HTTP-Statuscodes es gibt, welche Bedeutung sie haben, und in welchen Zusammenh&auml;ngen sie Verwendung finden.">
<meta name="keywords"       content="SELFHTML, HTTP, Statuscodes, Statuscodes, HTTP-Meldungen, Server-Codes">
<meta name="author"         content="Stefan M&uuml;nz, selfhtml@teamone.de">
<meta http-equiv="content-type" content="text/html; charset=ISO-8859-1">
<meta name="DC.Publisher"   content="Serge Fran&ccedil;ois, selfhtml@selfhtml.com.fr">
<meta name="DC.Date"        content="2003-01-27T08:00+00:00">
<meta name="DC.Identifier"  content="http://selfhtml.selfhtml.com.fr/divers/httpstatuscodes.htm">
<meta name="DC.Language"    content="fr">
<meta name="DC.Rights"      content="../editorial/copyright.htm">
<meta name="DC.Date.Create" content="2003-01-27T08:00+00:00">
<meta name="SELF.Version"   content="1">
<meta name="SELF.Pagetype"  content="Information">
<meta name="SELF.Path"      content="SELFHTML == ../index.htm // Diverse technische Erg&auml;nzungen == index.htm">
<!-- Matomo -->
<script type="text/javascript">
  var _paq = window._paq = window._paq || [];
  /* tracker methods like "setCustomDimension" should be called before "trackPageView" */
  _paq.push(['trackPageView']);
  _paq.push(['enableLinkTracking']);
  (function() {
    var u="//matomo.boitasite.com/";
    _paq.push(['setTrackerUrl', u+'matomo.php']);
    _paq.push(['setSiteId', '1']);
    var d=document, g=d.createElement('script'), s=d.getElementsByTagName('script')[0];
    g.type='text/javascript'; g.async=true; g.src=u+'matomo.js'; s.parentNode.insertBefore(g,s);
  })();
</script>
<!-- End Matomo Code -->
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#AA5522" vlink="#772200" alink="#000000">

<table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr>
<td bgcolor="#FFEEDD" class="nav"><a class="an" name="top"><img src="../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"></a> <a href="../index.htm"><b>SELFHTML</b></a>/<a href="../navigation/index.htm" target="_parent">Aides &agrave; la navigation</a> <img src="../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="index.htm"><b>Divers compl&eacute;ments techniques</b></a> </td>
</tr>
</table><table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr>
<td bgcolor="#EEEEEE" class="doc" width="110"><img src="../src/logo.gif" width="106" height="109" border="0" alt="SELFHTML"></td>
<td bgcolor="#EEEEEE" class="doc" valign="bottom" width="100%"><h2>Codes d'&eacute;tat HTTP</h2></td>
</tr>
<tr>
<td bgcolor="#EEEEEE" class="doc" valign="top" align="center">
<img src="../src/docx.gif" width="30" height="20" vspace="6" border="0" alt="Page d'information: vue d'ensemble">
</td>
<td bgcolor="#FFFFFF" valign="top" nowrap>
<p>
<img src="../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#generalites"><b>G&eacute;n&eacute;ralit&eacute;s sur les codes d'&eacute;tat HTTP</b></a><br>
<img src="../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#recapitulatif"><b>R&eacute;capitulatif des codes d'&eacute;tat HTTP</b></a><br>
</p>
</td>
</tr><tr><td colspan="2" bgcolor="#EEEEEE" class="doc">&#160;<a href="#bottom"><img src="../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;</td></tr>
</table>





<h2 class="Sh2"><a class="an" name="generalites">G&eacute;n&eacute;ralit&eacute;s sur les codes d'&eacute;tat HTTP</a></h2>

<p>Quand un navigateur Web appelle une URI par le protocole HTTP, le serveur Web qui est comp&eacute;tent pour le domaine ou l'adresse IP appel&eacute;s, re&ccedil;oit une requ&ecirc;te. Il recherche les donn&eacute;es d&eacute;sir&eacute;es sur l'ordinateur serveur et envoie celles-ci. &agrave; nouveau par le protocole HTTP, au navigateur Web qui les attend. Selon la formulation de la demande du navigateur Web et le r&eacute;sultat des recherches de donn&eacute;es sur l'ordinateur serveur, le serveur transmet un nombre dans les donn&eacute;es d'ent&ecirc;te HTTP de la r&eacute;ponse. Ce nombre repr&eacute;sente le code d'&eacute;tat HTTP et renseigne sur le rapport entre les donn&eacute;es livr&eacute;es par le serveur et les donn&eacute;es souhait&eacute;es par le navigateur. De cette mani&egrave;re par exemple des messages d'erreur sont transmis, mais &eacute;galement des observations comme &quot;les donn&eacute;es demand&eacute;es sont prot&eacute;g&eacute;es en acc&egrave;s&quot;. Le navigateur peut &eacute;valuer le code d'&eacute;tat et r&eacute;agir en cons&eacute;quence. Par ailleurs, le serveur Web &eacute;crit le code '&eacute;tat HTTP de la demande dans ses fichiers Log.</p>

<p>Les codes d'&eacute;tats HTTP sont int&eacute;ressants pour vous en tant que fournisseur Web aux endroits suivants:</p>

<ul>
<li>Dans les <img src="../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="../projet/controler.htm#logdateien"><b>fichiers Log</b></a> du serveur Web, vous pouvez vous faire une id&eacute;e des erreurs et des probl&egrave;mes qui les derniers temps revenaient visiblement souvent. M&ecirc;me la plupart des <img src="../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="../projet/controler.htm#statistiques"><b>statistiques</b></a> de projets Web r&eacute;partissent les totaux en codes d'&eacute;tat HTTP. Il est utile ici de conna&icirc;tre les diff&eacute;rents codes d'&eacute;tat, leur signification et les raisons possibles de leur apparition.</li>
<li>Les scripts CGI peuvent eux-m&ecirc;mes cr&eacute;er des ent&ecirc;tes HTTP. Vous pouvez ici aussi noter des codes d'&eacute;tat HTTP qui doivent &ecirc;tre envoy&eacute;s comme r&eacute;ponse au navigateur appelant. Le serveur Web transmet alors ces mentions au navigateur. Comment cela fonctionne dans un script CGI avec Perl est d&eacute;crit dans la partie <img src="../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="../cgiperl/modules/cgi.htm#header_htmlstart"><b>Mentions avanc&eacute;es pour l'ent&ecirc;te HTTP et pour l'ent&ecirc;te de fichier HTML</b></a> (en relation avec le module CGI de Perl).</li>
</ul>


<p>Les codes d'&eacute;tat HTTP font partie de la sp&eacute;cification du protocole HTTP. Le consortium W3 est comp&eacute;tent pour cette sp&eacute;cification. La sp&eacute;cification para&icirc;t sous la forme de <img src="../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="../introduction/aide/docs.htm#rfcs"><b>Requests for Comments (RFCs)</b></a>. Vous pouvez appeler toutes les informations importantes actuelles concernant les normes du protocole HTTP &agrave; la page suivante:</p>

<p><img src="../src/en.gif" width="16" height="10" border="0" alt="Page en langue anglaise">&nbsp;<a target="_top" href="http://www.w3.org/Protocols/"><b>HTTP - Hypertext Transfer Protocol (protocole de transfert hypertexte)</b></a></p>


<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="recapitulatif">R&eacute;capitulatif des codes d'&eacute;tat HTTP</a></h2>


<table cellpadding="0" cellspacing="0" border="0"
bgcolor="#C0C0C0"><tr><td>
<table cellpadding="3" cellspacing="1" border="0"
>
<tr>
<th bgcolor="#EEEEEE" class="doc" align="left">code d'&eacute;tat</th>
<th bgcolor="#EEEEEE" class="doc" align="left">message correspondant</th>
<th bgcolor="#EEEEEE" class="doc" align="left">signification</th>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>100</code></td>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>Continue</code></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">Continuer. N'est pas encore employ&eacute; &agrave; ce jour.</td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>101</code></td>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>Switching Protocols</code></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">Changer de protocole. N'est pas encore employ&eacute; &agrave; ce jour.</td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>200</code></td>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>OK</code></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">Le serveur peut envoyer les donn&eacute;es r&eacute;clam&eacute;es comme d&eacute;sir&eacute;. C'est le cas normal quand aucun probl&egrave;me n'est survenu. La plus grande de toutes les demandes sur le serveur Web doit se terminer par ce code d'&eacute;tat - autrement quelque chose ne va pas.</td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>201</code></td>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>Created</code></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">Un objet (par exemple un fichier ou un r&eacute;pertoire) a &eacute;t&eacute; cr&eacute;&eacute; avec succ&egrave;s sur le serveur. Cela peut &ecirc;tre le cas quand la demande du navigateur au serveur a eu lieu avec l'une des m&eacute;thodes de transmission HTTP <code>post</code> ou <code>put</code> et qu'elle contenait une instruction pour la cr&eacute;ation de l'objet correspondant.</td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>202</code></td>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>Accepted</code></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">Le serveur a accept&eacute; la demande du navigateur mais ne livre pas de donn&eacute;es en retour. Le serveur &eacute;crit les donn&eacute;es dans un fichier au lieu de les envoyer et fait savoir dans le message o&ugrave; les donn&eacute;es pourront &ecirc;tre trouv&eacute;es plus tard. Ce message ne dit pas si le serveur peut traiter correctement la demande. Il l'a simplement accept&eacute;e et repouss&eacute; son traitement &agrave; une date ult&eacute;rieure.</td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>203</code></td>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>Non-Authoritative Information</code></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">Ce code d'&eacute;tat devrait &ecirc;tre renvoy&eacute; par le serveur &agrave; la place de  <code>200</code> quand il ne s'agit pas du serveur original mais d'un serveur proxy par exemple. Le navigateur Web apprend de cette fa&ccedil;on que les donn&eacute;es ont pu &ecirc;tre envoy&eacute;es correctement mais sans provenir du serveur original et que de ce fait, elles ne tiennent peut &ecirc;tre pas compte de mises &agrave; jour &eacute;ventuelles.</td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>204</code></td>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>No Content</code></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">Le serveur a re&ccedil;u la demande, ne renvoie cependant pas de donn&eacute;es. Ce code d'&eacute;tat trouve son application dans l'utilisation de scripts CGI qui certes ex&eacute;cutent quelque chose sur le serveur mais na veulent pas envoyer de nouveau code HTML au navigateur appelant. Vu de chez l'utilisateur, l'ancien contenu d'&eacute;cran reste affich&eacute;.</td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>205</code></td>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>Reset Content</code></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">Le serveur mentionn&eacute; n'existe pas ou le serveur qui donne cette r&eacute;ponse n'est pas le serveur demand&eacute; et ne peut pas trouv&eacute; le serveur demand&eacute;. C'est la raison pour laquelle les donn&eacute;es demand&eacute;es ne peuvent pas &ecirc;tre envoy&eacute;es.</td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>206</code></td>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>Partial Content</code></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">Les donn&eacute;es r&eacute;clam&eacute;es sont envoy&eacute;es en plusieurs portions (cela n'a pourtant rien &agrave; voir avec les paquets  TCP/IP, mais se passe au niveau du protocole HTTP). Avec des mentions sur <code>content-length</code> (par exemple: <code>1024</code>) et sur <code>content-range</code> (par exemple: <code>bytes 0-1023/1024</code>) il est mentionn&eacute; combien d'octets ont &eacute;t&eacute; envoy&eacute;s sur le contenu r&eacute;clam&eacute; et quelle partie de la totalit&eacute; des donn&eacute;es.</td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>300</code></td>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>Multiple Choices</code></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">Les donn&eacute;es r&eacute;clam&eacute;es sont disponibles sous plusieurs URI diff&eacute;rentes (Mirror). &Agrave; la place des donn&eacute;es c'est la liste de ces URI disponibles qui est transmise. Le navigateur Web peut ensuite faire choisir l'utilisateur par un dialogue.</td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>301</code></td>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>Moved Permanently</code></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">Les donn&eacute;es r&eacute;clam&eacute;es ne se trouvent plus &agrave; cette URI, elles ont &eacute;t&eacute; d&eacute;plac&eacute;es d&eacute;finitivement &agrave; une autre adresse. Dans le message d'&eacute;tat, il est mentionn&eacute; sous quelle adresse les donn&eacute;es se trouvent maintenant. Un navigateur Web qui re&ccedil;oit cette r&eacute;ponse du serveur, peut par exemple demander aussit&ocirc;t la nouvelle adresse.</td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>302</code></td>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>Moved Temporarialy</code></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">Les donn&eacute;es r&eacute;clam&eacute;es ont &eacute;t&eacute; d&eacute;plac&eacute;es provisoirement &agrave; une autre URI. Dans le message d'&eacute;tat, il est mentionn&eacute; sous quelle adresse les donn&eacute;es se trouvent actuellement. Un navigateur Web qui re&ccedil;oit cette r&eacute;ponse du serveur, peut par exemple demander aussit&ocirc;t l'adresse provisoirement valide.</td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>303</code></td>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>See Other</code></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">Les donn&eacute;es r&eacute;clam&eacute;es sont disponibles &agrave; une URI mentionn&eacute;e et doivent &ecirc;tre r&eacute;clam&eacute;es de cette adresse &agrave; l'aide de la m&eacute;thode  <code>get</code>. Ce code d'&eacute;tat est con&ccedil;u pour les scripts CGI qui ont &eacute;t&eacute; appel&eacute;s avec la m&eacute;thode <code>post</code> et qui veulent orienter le navigateur sur une autre ressource qui doit &ecirc;tre r&eacute;clam&eacute;e avec la m&eacute;thode <code>get</code>.</td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>304</code></td>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>Not Modified</code></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">Les donn&eacute;es r&eacute;clam&eacute;es n'ont pas &eacute;t&eacute; modifi&eacute;es depuis la date et l'heure mentionn&eacute;es et c'est la raison pour laquelle elles ne sont pas envoy&eacute;es. Ce code d'&eacute;tat est avec le code <code>200</code> l'un des plus courants dans la pratique. Il est occasionn&eacute; par les navigateurs Web qui en raison des r&eacute;glages de leur cache ne chargent les donn&eacute;es du serveur original qu'apr&egrave;s un certain temps. Avant cette &eacute;ch&eacute;ance, ils ne demandent qu'avec la date et l'heure auxquelles les donn&eacute;es ont &eacute;t&eacute; charg&eacute;es en dernier si les donn&eacute;es sur le serveur ont &eacute;t&eacute; modifi&eacute;es depuis.</td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>305</code></td>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>Use Proxy</code></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">Les donn&eacute;es r&eacute;clam&eacute;es doivent &ecirc;tre r&eacute;clam&eacute;es au serveur proxy mentionn&eacute; dans le message d'&eacute;tat et non pas &agrave; ce serveur-ci.</td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>306</code></td>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>[Unused]</code></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">R&eacute;serv&eacute;. N'est pas employ&eacute; &agrave; ce jour.</td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>307</code></td>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>Temporary Redirect</code></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">Comme le code d'&eacute;tat <code>302</code>. Con&ccedil;u pour des r&eacute;actions erron&eacute;es de certains navigateurs au code <code>302</code>.</td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>400</code></td>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>Bad Request</code></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">La requ&ecirc;te contient des erreurs de syntaxe. C'est pourquoi le serveur ne peut pas la traiter. Cela peut arriver par exemple quand la requ&ecirc;te a &eacute;t&eacute; cr&eacute;&eacute;e par la tentative d'un utilisateur de l'entrer &agrave; la main dans la ligne d'adresse du navigateur en utilisant pour le faire des caract&egrave;res non valables.</td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>401</code></td>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>Unauthorized</code></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">Les donn&eacute;es r&eacute;clam&eacute;es sont prot&eacute;g&eacute;es en acc&egrave;s. Le serveur ne peut prot&eacute;ger les donn&eacute;es que si une identification d'acc&egrave;s valable, compos&eacute;e d'un nom d'utilisateur et d'un mot de passe, est envoy&eacute;e avec la requ&ecirc;te. Cela arrive toujours dans la pratique quand une adresse est appel&eacute;e qui est par exemple prot&eacute;g&eacute;e en acc&egrave;s par <img src="../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="htaccess.htm"><b>htacess</b></a>. Le navigateur Web affiche alors, apr&egrave;s avoir re&ccedil;u ce code d'&eacute;tat, un dialogue pour entrer le nom d'utilisateur et le mot de passe. Avec les donn&eacute;es saisies, il lance une nouvelle requ&ecirc;te au serveur.</td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>402</code></td>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>Payment Required</code></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">Les donn&eacute;es r&eacute;clam&eacute;es sont payantes. Le serveur ne peut envoyer les donn&eacute;es que si une confirmation du paiement pour les donn&eacute;es est envoy&eacute; avec la requ&ecirc;te.  N'est pas employ&eacute; &agrave; ce jour en raison du manque d'homog&eacute;n&eacute;it&eacute; des bases techniques pour le micro-paiement.</td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>403</code></td>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>Forbidden</code></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">Les donn&eacute;es r&eacute;clam&eacute;es sont prot&eacute;g&eacute;es en acc&egrave;s. Les donn&eacute;es mentionn&eacute;es avec lesquelles l'acc&egrave;s devrait &ecirc;tre autoris&eacute; ne sont pas valables. Cela peut arriver par exemple quand auparavant le code d'&eacute;tat <code>401</code> avec &eacute;t&eacute; envoy&eacute; et que le navigateur lance maintenant la requ&ecirc;te suivante avec les donn&eacute;es d'acc&egrave;s qu'il a r&eacute;clam&eacute;es de l'utilisateur dans un dialogue et que ces donn&eacute;es ne sont pas valables. Certains navigateurs r&eacute;p&egrave;tent alors le dialogue pour l'entr&eacute;e des donn&eacute;es d'acc&egrave;s encore deux fois et apr&egrave;s la troisi&egrave;me entr&eacute;e erron&eacute;e le message d'erreur &quot;Forbidden&quot; est sorti pour l'utilisateur.</td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>404</code></td>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>Not Found</code></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">L'URI r&eacute;clam&eacute;e n'existe pas. C'est avec les  codes d'&eacute;tat <code>200</code> et <code>304</code> un des cas les plus courants dans la pratique. Il survient toujours quand un lien m&egrave;ne &agrave; une adresse qui n'existe pas ou plus sur le serveur ou quand l'utilisateur entre &agrave; la main une adresse inexistante dans la ligne d'adresse de son navigateur.</td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>405</code></td>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>Method Not Allowed</code></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">La m&eacute;thode de transmission mentionn&eacute;e n'est pas permise sur le serveur. C'est la raison pour laquelle les donn&eacute;es ne sont pas transmises. Cela peut arriver par exemple quand dans la configuration du serveur Web aucune autre m&eacute;thode que la m&eacute;thode <code>get</code> n'est permise, et qu'un formulaire HTML contient un appel CGI avec la m&eacute;thode <code>post</code>.</td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>406</code></td>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>Not Acceptable</code></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">La requ&ecirc;te ne peut &ecirc;tre accept&eacute;e sous cette forme. C'est la raison pour laquelle les donn&eacute;es ne sont pas transmises.</td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>407</code></td>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>Proxy Authentication Required</code></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">Le client demandeur est un serveur. Les donn&eacute;es ne sont transmises &agrave; ce serveur que s'il prouve qu'il est un serveur proxy valide. Ce code d'&eacute;tat n'est pas encore employ&eacute; &agrave; ce jour. Il doit permettre plus tard d'&eacute;tablir un traitement analogue que celui du  code d'&eacute;tat <code>401</code>, non pas cependant pour les navigateurs demandeurs mais pour les serveurs proxy demandeurs. De cette fa&ccedil;on il pourrait &ecirc;tre possible aux fournisseurs Web d'emp&ecirc;cher, dans la configuration du serveur, la sauvegarde de ses propres donn&eacute;es sur des serveurs proxy ind&eacute;sirables.</td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>408</code></td>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>Request Timeout</code></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">Le n'a pas re&ccedil;u une requ&ecirc;te attendue dans le d&eacute;lai maximal fix&eacute; pour la r&eacute;ception. La connexion avec le navigateur demandeur est coup&eacute;e pour cette raison. Les donn&eacute;es demand&eacute;es ne sont pas transmises.</td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>409</code></td>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>Conflict</code></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">Le serveur ne peut pas envoyer les  donn&eacute;es r&eacute;clam&eacute;es parce qu'un conflit avec un autre processus est survenu. Cela peut arriver par exemple quand un autre processus vient d'affecter un verrouillage de fichier exclusif au fichier demand&eacute; (pas le moindre acc&egrave;s au fichier pour les autres processus n'est permis).</td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>410</code></td>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>Gone</code></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">Les donn&eacute;es r&eacute;clam&eacute;es ont &eacute;t&eacute; d&eacute;plac&eacute;es provisoirement &agrave; une autre URI. Le serveur ne sait pas o&ugrave;. C'est la raison pour laquelle il ne peut pas transmettre - autrement c'est un code d'&eacute;tat <code>301</code> ou bien <code>302</code> qui aurait &eacute;t&eacute; transmis.</td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>411</code></td>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>Length Required</code></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">Les donn&eacute;es ne sont pas transmises. Elles ne peuvent l'&ecirc;tre que si la requ&ecirc;te contient une mention sur <code>content-length</code>. Le navigateur peut essayer de reformuler la requ&ecirc;te en transmettant la longueur des donn&eacute;es de la requ&ecirc;te envoy&eacute;e au serveur.</td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>412</code></td>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>Precondition Failed</code></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">Une ou plusieurs conditions qui &eacute;taient requises pour la requ&ecirc;te ne sont pas remplies. Les donn&eacute;es r&eacute;clam&eacute;es ne sont pas transmises pour cette raison.</td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>413</code></td>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>Request Entity Too Large</code></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">Le serveur ne peut pas traiter la requ&ecirc;te parce qu'elle contient trop de caract&egrave;res. Les donn&eacute;es r&eacute;clam&eacute;es ne sont pas transmises pour cette raison.</td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>414</code></td>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>Request-URL Too Long</code></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">Le serveur ne peut pas traiter la requ&ecirc;te parce que l'adresse r&eacute;clam&eacute;e contient trop de caract&egrave;res. Les donn&eacute;es r&eacute;clam&eacute;es ne sont pas transmises pour cette raison.</td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>415</code></td>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>Unsupported Media Type</code></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">Le serveur ne peut pas traiter la requ&ecirc;te parce qu'il ne conna&icirc;t pas de <img src="../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="typesmime.htm"><b>type Mime</b></a> pour le type de donn&eacute;es demand&eacute;es. Les donn&eacute;es r&eacute;clam&eacute;es ne sont pas transmises pour cette raison.</td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>416</code></td>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>Requested Range Not Satisfiable</code></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">La requ&ecirc;te contient des mentions sur la plage en octets qui doit &ecirc;tre transmise de l'URI appel&eacute;e. Aussi bien la valeur de d&eacute;part que la valeur finale de la plage mentionn&eacute;e sont situ&eacute;es hors de la plage en octets disponible, par exemple quand une plage en octets de  1000 &agrave; 2000 est mentionn&eacute;es et que la ressource n'a que 500 octets. Les donn&eacute;es r&eacute;clam&eacute;es ne sont pas transmises pour cette raison.</td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>417</code></td>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>Expectation Failed</code></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">La requ&ecirc;te contient dans le champ <code>expect</code> certains d&eacute;sirs que le serveur ne peut pas satisfaire. Les donn&eacute;es r&eacute;clam&eacute;es ne sont pas transmises pour cette raison.</td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>500</code></td>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>Internal Server Error</code></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">Le serveur ne peut pas transmettre les donn&eacute;es r&eacute;clam&eacute;es parce qu'une erreur est survenue sur le serveur. Par exemple le script CGI appel&eacute; n'a pas pu &ecirc;tre lanc&eacute;.</td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>501</code></td>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>Not Implemented</code></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">La requ&ecirc;te contient des exigences ne pouvant &ecirc;tre trait&eacute;es par le serveur, parce que les &eacute;l&eacute;ments pour le faire ne sont pas impl&eacute;ment&eacute;s. Les donn&eacute;es r&eacute;clam&eacute;es ne peuvent pas &ecirc;tre transmises pour cette raison.</td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>502</code></td>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>Bad Gateway</code></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">Pour traiter la requ&ecirc;te, le serveur a du appeler un autre serveur et a re&ccedil;u &agrave; cette occasion un message d'erreur. Les donn&eacute;es r&eacute;clam&eacute;es ne peuvent pas &ecirc;tre transmises pour cette raison.</td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>503</code></td>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>Service Unavailable</code></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">Le serveur ne peut pas traiter la requ&ecirc;te faute de ressources. Les donn&eacute;es r&eacute;clam&eacute;es ne peuvent pas &ecirc;tre transmises pour cette raison. Dans le message d'&eacute;tat peut figurer quand, au plus t&ocirc;t, la requ&ecirc;te peut &ecirc;tre &agrave; nouveau trait&eacute;e. &Agrave; la diff&eacute;rence du code d'&eacute;tat <code>202</code> le serveur ne traite pas les donn&eacute;es d&egrave;s que des ressources sont &agrave; nouveau disponibles.</td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>504</code></td>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>Gateway Timeout</code></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">Pour traiter la requ&ecirc;te, le serveur a du appeler un autre serveur et n'a cependant pas re&ccedil;u &agrave; cette occasion de r&eacute;ponse dans le d&eacute;lai maximal fix&eacute;. Les donn&eacute;es r&eacute;clam&eacute;es ne peuvent pas &ecirc;tre transmises pour cette raison.</td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>505</code></td>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>HTTP Version Not Supported</code></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">Le serveur ne soutient pas la version HTTP mentionn&eacute;e dans l'ent&ecirc;te HTTP de la requ&ecirc;te. Les donn&eacute;es r&eacute;clam&eacute;es ne sont pas transmises pour cette raison.</td>
</tr>
</table>
</td></tr></table><br>&nbsp;







<table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr><td colspan="2" bgcolor="#EEEEEE" class="doc">
&#160;<a href="#top"><img src="../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a>
</td></tr>
<tr><td bgcolor="#EEEEEE" class="doc" align="right"><a href="typesmime.htm"><img src="../src/suivant.gif" width="10" height="10" border="0" hspace="10" alt="page suivante"></a></td>
<td bgcolor="#FFFFFF"><img src="../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information"> <a href="typesmime.htm"><b>Types Mime</b></a>
</td></tr>
<tr>
<td bgcolor="#EEEEEE" class="doc" align="right"><a href="../projet/juridique.htm"><img src="../src/precedent.gif" width="10" height="10" border="0" hspace="10" alt="page pr&eacute;c&eacute;dente"></a></td>
<td bgcolor="#FFFFFF" width="100%"><img src="../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information"> <a href="../projet/juridique.htm"><b>Aspects juridiques de projets Web</b></a>
</td>
</tr>
<tr><td colspan="2" bgcolor="#EEEEEE" class="doc">&#160;</td></tr>
</table><table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr>
<td bgcolor="#FFEEDD" class="nav"><a class="an" name="bottom"><img src="../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"></a> <a href="../index.htm"><b>SELFHTML</b></a>/<a href="../navigation/index.htm" target="_parent">Aides &agrave; la navigation</a> <img src="../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="index.htm"><b>Divers compl&eacute;ments techniques</b></a> </td>
</tr>
</table>

<p>&copy; 2001 Stefan M&uuml;nz / &copy; 2003 Traduction <img src="../src/courriel.gif" width="15" height="10" border="0" alt="Adresse &eacute;lectronique">&nbsp;<a href="mailto:13405@free.fr">Serge Fran&ccedil;ois, 13405@free.fr</a><br><img src="../src/courriel.gif" width="15" height="10" border="0" alt="Adresse &eacute;lectronique">&nbsp;<a href="mailto:selfhtml@selfhtml.com.fr">selfhtml@selfhtml.com.fr</a></p>



</body>
</html>
