<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>SELFHTML: Introduction / Technologies du Web / CGI et Perl</title>
<link rel="stylesheet" type="text/css" href="../../src/selfhtml.css">
<meta name="description"    content="Qu'est qu'il y a de bien dans CGI, quel r&ocirc;le joue Perl, et comment utiliser l'un et l'autre dans vos propres pages Web.">
<meta name="keywords"       content="SELFHTML, Technologies du Web, Technologies, CGI, Perl, NCSA">
<meta name="author"         content="Stefan M&uuml;nz, selfhtml@teamone.de">
<meta http-equiv="content-type" content="text/html; charset=ISO-8859-1">
<meta name="DC.Publisher"   content="Serge Fran&ccedil;ois, selfhtml@selfhtml.com.fr">
<meta name="DC.Date"        content="2003-01-27T08:00+00:00">
<meta name="DC.Identifier"  content="http://selfhtml.selfhtml.com.fr/introduction/technologies/cgiperl.htm">
<meta name="DC.Language"    content="fr">
<meta name="DC.Rights"      content="../../editorial/copyright.htm">
<meta name="DC.Date.Create" content="2003-01-27T08:00+00:00">
<meta name="SELF.Version"   content="1">
<meta name="SELF.Pagetype"  content="Information">
<meta name="SELF.Path"      content="SELFHTML == ../../index.htm // Introduction == ../index.htm // Technologies du Web == index.htm">
<!-- Matomo -->
<script type="text/javascript">
  var _paq = window._paq = window._paq || [];
  /* tracker methods like "setCustomDimension" should be called before "trackPageView" */
  _paq.push(['trackPageView']);
  _paq.push(['enableLinkTracking']);
  (function() {
    var u="//matomo.boitasite.com/";
    _paq.push(['setTrackerUrl', u+'matomo.php']);
    _paq.push(['setSiteId', '1']);
    var d=document, g=d.createElement('script'), s=d.getElementsByTagName('script')[0];
    g.type='text/javascript'; g.async=true; g.src=u+'matomo.js'; s.parentNode.insertBefore(g,s);
  })();
</script>
<!-- End Matomo Code -->
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#AA5522" vlink="#772200" alink="#000000">

<table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr>
<td bgcolor="#FFEEDD" class="nav"><a class="an" name="top"><img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"></a> <a href="../../index.htm"><b>SELFHTML</b></a>/<a href="../../navigation/index.htm" target="_parent">Aides &agrave; la navigation</a> <img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="../index.htm"><b>Introduction</b></a> <img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="index.htm"><b>Technologies du Web</b></a></td>
</tr>
</table><table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr>
<td bgcolor="#EEEEEE" class="doc" width="110"><img src="../../src/logo.gif" width="106" height="109" border="0" alt="SELFHTML"></td>
<td bgcolor="#EEEEEE" class="doc" valign="bottom" width="100%"><h2>CGI et Perl</h2>
<tr>
<td bgcolor="#EEEEEE" class="doc" valign="top" align="center">
<img src="../../src/docx.gif" width="30" height="20" vspace="6" border="0" alt="Page d'information: vue d'ensemble">
</td>
<td bgcolor="#FFFFFF" valign="top" nowrap>
<p>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#interface_interpreteur"><b>Interface CGI et interpr&eacute;teur Perl </b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#infos"><b>Informations CGI/Perl</b></a><br>
</p>
</td>
</tr><tr><td colspan="2" bgcolor="#EEEEEE" class="doc">&#160;<a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;</td></tr>
</table>



<h2 class="Sh2"><a class="an" name="interface_interpreteur">Interface CGI et interpr&eacute;teur Perl </a></h2>

<p>L'interface CGI (<i>Common Gateway Interface - Interface g&eacute;n&eacute;rale de passerelle</i>) est une possibilit&eacute; de tenir &agrave; disposition des programmes ou des scripts pouvant &ecirc;tre appel&eacute;s &agrave; partir de fichiers HTML et qui peuvent cr&eacute;er eux m&ecirc;me du code HTML pour l'envoyer &agrave; un navigateur Web. &Agrave; la diff&eacute;rence de <img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="javascript.htm"><b>JavaScript</b></a> de tels scripts ou programmes ne sont pas ex&eacute;cut&eacute;s apr&egrave;s la transmission d'une page Web sur la navigateur de l'utilisateur mais avant avant que le navigateur ne re&ccedil;oive des donn&eacute;es transmises par le serveur. C'est pour cette raison que les scripts CGI ou les programmes CGI ne sont ex&eacute;cutables que lorsqu'une liaison HTTP est &eacute;tablie entre le navigateur Web et le serveur Web. CGI est domicili&eacute; du c&ocirc;t&eacute; du serveur.</p>

<p>Le traitement des donn&eacute;es a lieu de la m&ecirc;me fa&ccedil;on sur l'ordinateur serveur. Les programmes CGI peuvent sauvegarder sur le serveur, par exemple le nombre d'acc&egrave;s &agrave; une pages Web ou bien ce qu'un utilisateur a &eacute;crit dans le livre des visiteurs. Un script CGI peut &eacute;galement questionner des bases de donn&eacute;es install&eacute;es sur l'ordinateur serveur. Par l'appel ad&eacute;quat, un script CGI peut lire des donn&eacute;es enregistr&eacute;es et g&eacute;n&eacute;rer &agrave; partir de celles-ci du code HTML. Ce code HTML cr&eacute;&eacute; de fa&ccedil;on &quot;dynamique&quot; est transmis au navigateur Web de l'utilisateur appelant o&ugrave; il peut afficher des donn&eacute;es individuelles en HTML, par exemple l'&eacute;tat actuel du compteur d'acc&egrave;s d'une page Web, ou les entr&eacute;es faites jusqu'alors dans le livre des visites ou encore les r&eacute;sultats d'une recherche dans une base de donn&eacute;es.</p>

<p>l'interface CGI doit &ecirc;tre support&eacute; par le logiciel du fournisseur d'acc&egrave;s WWW. Du point de vue du client du fournisseur d'acc&egrave;s qui loue son emplacement sur le serveur l'interface CGI rev&ecirc;t la forme d'un r&eacute;pertoire mis &agrave; disposition. La plupart du temps ce r&eacute;pertoire est nomm&eacute; <var>cgi-bin</var> . Dans ce r&eacute;pertoire peuvent &ecirc;tre sauvegard&eacute;s des programmes qui prennent en charge les t&acirc;ches CGI. Si vous avez un doute, demandez &agrave; votre fournisseur d'acc&egrave;s s'il met &agrave; votre disposition une interface CGI. Chez les fournisseurs d'acc&egrave;s qui acceptent votre page d'accueil bon march&eacute; ou m&ecirc;me gratuitement. aucune interface CGI n'est en principe mise &agrave; votre disposition.</p>

<p>Il n'y a pas de r&egrave;gles stipulant dans quel langage de programmation un programme CGI est &eacute;crit. Pour que le programme soit ex&eacute;cutable sur l'ordinateur serveur, il faut soit qu'il ait &eacute;t&eacute; compil&eacute; comme programme ex&eacute;cutable dans l'environnement du syst&egrave;me d'exploitation du serveur ou bien qu'il existe sur le serveur un interpr&eacute;teur de dur&eacute;e qui ex&eacute;cute le programme. Si par exemple le serveur est un ordinateur Linux, il ex&eacute;cute des programmes en C, compil&eacute;s en fichiers ex&eacute;cutables avec un compilateur Linux. Si le serveur est un ordinateur Windows NT les scripts CGI peuvent &ecirc;tre aussi des fichiers EXE compil&eacute;s avec des Compilateurs 32 bits pour C, Pascal, Visual Basic etc. La plupart des programmes CGI d'aujourd'hui ne sont pourtant pas des programmes compil&eacute;s mais ni plus ni moins que des scripts qui sont ex&eacute;cut&eacute;s par l'interpr&eacute;teur lorsqu'ils sont appel&eacute;s. Le plus connu et plus populaire de ces interpr&eacute;teurs est l'<b>interpr&eacute;teur Perl</b>.</p>

<p>Perl est un langage de programmation qui repr&eacute;sente un m&eacute;lange entre les langages de programmation traditionnels comme C et les langages scripts comme les Shell scripts Unix. Perl est extr&ecirc;mement puissant et l'interpr&eacute;teur Perl est parfaitement au point. C'est pourquoi Perl a conquis les programmeurs dans d'innombrables domaines. Entre autres justement, le domaine de la programmation CGI. Pour cette raison, on ne peut entre-temps &eacute;voquer la programmation CGI nommer Perl et on les consid&egrave;re comme faisant partie d'un tout. Il est seulement important de savoir que l'association de CGI et de Perl n'est pas inn&eacute;e ou indispensable. CGI est en fin de compte une norme pour une interface de programmation que le logiciel serveur Web doit soutenir et que Perl est un langage script utilisable partout et qui de toutes fa&ccedil;ons est particuli&egrave;rement bien adapt&eacute; en raison de ses caract&eacute;ristiques &agrave; la programmation CGI.</p>





<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="infos">Informations CGI/Perl</a></h2>

<p>Il n'existe aucun standard pour CGI qui serait comparable &agrave; celui de  HTML, CSS ou XML. Le consortium W3 chez qui il y a bien aussi un groupe de travail qui s'occupe du protocole HTTP, ignore l'interface CGI dans la documentation sur HTTP. L'interface CGI a &eacute;t&eacute; introduite avec l'un des premiers produits pour serveurs Web qui comptait parmi les plus populaires de son temps, &agrave; savoir le serveur Web NCSA (<i>NCSA = National Center for Supercomputing</i>, une institution universitaire). Les sp&eacute;cifications originales pour l'interface CGI de NCSA est encore disponible sur les pages Web de NCSA :</p>

<p><img src="../../src/en.gif" width="16" height="10" border="0" alt="Page en langue anglaise">&nbsp;<a target="_top" href="http://hoohoo.ncsa.uiuc.edu/cgi/interface.html"><b>Les sp&eacute;cifications CGI </b></a></p>

<p>&Agrave; vrai dire il n'y en a pas beaucoup plus - il doit &ecirc;tre soutenu par le serveur Web. Maintenant le serveur NCSA ne joue plus aucun r&ocirc;le, le r&ocirc;le indubitable de meneur pour les produits pour serveur Web ayant &eacute;t&eacute; repris par le serveur Web Apache disponible gratuitement. Celui-ci soutient bien entendu &eacute;galement l'interface CGI.</p>

<p>Perl en tant que langage de programmation et l'interpr&eacute;teur Perl sont sans licence et disponibles gratuitement. La page d'acc&egrave;s pour tout ce qui concerne Perl est <img src="../../src/en.gif" width="16" height="10" border="0" alt="Page en langue anglaise">&nbsp;<a target="_top" href="http://www.perl.com/"><b>perl.com</b></a>.</p>

<h3 class="inf">Attention:</h3>

<p>Dans l'index des liens de l'offre en ligne de SELFHTML actuel vous trouverez d'autres liens importants et actuels par exemple &agrave; des traductions fran&ccedil;aises et &agrave; d'autres sources:</p>

<p><img src="../../src/serverdoc.gif" width="15" height="10" border="0" alt="Page d'information: connexion exig&eacute;e">&nbsp;<a target="_top" href="http://www.selfhtml.com.fr/liens/cgiperl.htm"><b>Index des liens SELFHTML: CGI/Perl</b></a></p>

<p>Dans la pr&eacute;sente documentation, CGI et Perl sont trait&eacute;s dans le chapitre  <img src="../../src/chap.gif" width="15" height="13" border="0" alt="Chapitre: vue d'ensemble">&nbsp;<a href="../../cgiperl/index.htm"><b>CGI/Perl</b></a> .</p>








<table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr><td colspan="2" bgcolor="#EEEEEE" class="doc">
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a>
</td></tr>
<tr><td bgcolor="#EEEEEE" class="doc" align="right"><a href="php.htm"><img src="../../src/suivant.gif" width="10" height="10" border="0" hspace="10" alt="page suivante"></a></td>
<td bgcolor="#FFFFFF"><img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information"> <a href="php.htm"><b>PHP</b></a>
</td></tr>
<tr>
<td bgcolor="#EEEEEE" class="doc" align="right"><a href="javascript.htm"><img src="../../src/precedent.gif" width="10" height="10" border="0" hspace="10" alt="page pr&eacute;c&eacute;dente"></a></td>
<td bgcolor="#FFFFFF" width="100%"><img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information"> <a href="javascript.htm"><b>JavaScript/DOM</b></a>
</td>
</tr>
<tr><td colspan="2" bgcolor="#EEEEEE" class="doc">&#160;</td></tr>
</table><table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr>
<td bgcolor="#FFEEDD" class="nav"><a class="an" name="bottom"><img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"></a> <a href="../../index.htm"><b>SELFHTML</b></a>/<a href="../../navigation/index.htm" target="_parent">Aides &agrave; la navigation</a> <img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="../index.htm"><b>Introduction</b></a> <img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="index.htm"><b>Technologies du Web</b></a></td>
</tr>
</table>

<p>&copy; 2001 Stefan M&uuml;nz / &copy; 2003 Traduction <img src="../../src/courriel.gif" width="15" height="10" border="0" alt="Adresse &eacute;lectronique">&nbsp;<a href="mailto:13405@free.fr">Serge Fran&ccedil;ois, 13405@free.fr</a><br><img src="../../src/courriel.gif" width="15" height="10" border="0" alt="Adresse &eacute;lectronique">&nbsp;<a href="mailto:selfhtml@selfhtml.com.fr">selfhtml@selfhtml.com.fr</a></p>


</body>
</html>
