<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>SELFHTML: Introduction / Technologies du Web / Flash</title>
<link rel="stylesheet" type="text/css" href="../../src/selfhtml.css">
<meta name="description"    content="Quelle est l'importance de Flash sur le Web d'aujourd'hui et de quoi avez vous besoin pour pouvoir r&eacute;aliser vous m&ecirc;mes des animations Flah ou bien des applications Flash.">
<meta name="keywords"       content="SELFHTML,  Technologies, Flash, Shockwave">
<meta name="author"         content="Stefan M&uuml;nz, selfhtml@teamone.de">
<meta http-equiv="content-type" content="text/html; charset=ISO-8859-1">
<meta name="DC.Publisher"   content="Serge Fran&ccedil;ois, selfhtml@selfhtml.com.fr">
<meta name="DC.Date"        content="2003-01-27T08:00+00:00">
<meta name="DC.Identifier"  content="http://selfhtml.selfhtml.com.fr/introduction/technologies/flash.htm">
<meta name="DC.Language"    content="fr">
<meta name="DC.Rights"      content="../../editorial/copyright.htm">
<meta name="DC.Date.Create" content="2003-01-27T08:00+00:00">
<meta name="SELF.Version"   content="1">
<meta name="SELF.Pagetype"  content="Information">
<meta name="SELF.Path"      content="SELFHTML == ../../index.htm // Introduction == ../index.htm // Technologies du Web == index.htm">
<!-- Matomo -->
<script type="text/javascript">
  var _paq = window._paq = window._paq || [];
  /* tracker methods like "setCustomDimension" should be called before "trackPageView" */
  _paq.push(['trackPageView']);
  _paq.push(['enableLinkTracking']);
  (function() {
    var u="//matomo.boitasite.com/";
    _paq.push(['setTrackerUrl', u+'matomo.php']);
    _paq.push(['setSiteId', '1']);
    var d=document, g=d.createElement('script'), s=d.getElementsByTagName('script')[0];
    g.type='text/javascript'; g.async=true; g.src=u+'matomo.js'; s.parentNode.insertBefore(g,s);
  })();
</script>
<!-- End Matomo Code -->
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#AA5522" vlink="#772200" alink="#000000">

<table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr>
<td bgcolor="#FFEEDD" class="nav"><a class="an" name="top"><img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"></a> <a href="../../index.htm"><b>SELFHTML</b></a>/<a href="../../navigation/index.htm" target="_parent">Aides &agrave; la navigation</a> <img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="../index.htm"><b>Introduction</b></a> <img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="index.htm"><b>Technologies du Web</b></a></td>
</tr>
</table><table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr>
<td bgcolor="#EEEEEE" class="doc" width="110"><img src="../../src/logo.gif" width="106" height="109" border="0" alt="SELFHTML"></td>
<td bgcolor="#EEEEEE" class="doc" valign="bottom" width="100%"><h2>Flash</h2>
<tr>
<td bgcolor="#EEEEEE" class="doc" valign="top" align="center">
<img src="../../src/docx.gif" width="30" height="20" vspace="6" border="0" alt="Page d'information: vue d'ensemble">
</td>
<td bgcolor="#FFFFFF" valign="top" nowrap>
<p>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#html"><b>Flash et HTML</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#infos"><b>Informations Flash</b></a><br>
</p>
</td>
</tr><tr><td colspan="2" bgcolor="#EEEEEE" class="doc">&#160;<a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;</td></tr>
</table>



<h2 class="Sh2"><a class="an" name="html">Flash et HTML</a></h2>

<p>Flash offre la possibilit&eacute; de mettre sur les pages Web des effets multim&eacute;dia, mais aussi des applications telles que des jeux, des simulations ou des Aides &agrave; la navigation pour les pages Web.</p>

<p>Flash est pourtant la plus r&eacute;cente des publicit&eacute;s &agrave; sensation et le plus jeune repr&eacute;sentant de l'esp&egrave;ce &quot;je veux la mort de HTML&quot; - tout au moins c'est le portrait qu'en font ceux qui n'ont jamais pu s'accommoder de HTML et des standards ouverts. &Eacute;tant donn&eacute; que derri&egrave;re Flash se cache un produit logiciel commercial qui n'est aucunement comparable avec les standards ouverts d'Internet, on compare l&agrave; des pommes avec des poires. Exactement de la m&ecirc;me fa&ccedil;on on pourrait dire &quot;je n'ai pas besoin de HTML pour les tableaux, j'ai Excel de MS&quot;. et rien n'emp&ecirc;che d'incorporer un fichier Excel comme objet en HTML, ou simplement de le placer sur le Web  et d'y diriger les visiteurs- Avec Excel install&eacute; ou un visualiseur Excel, le navigateur ouvrira gentiment l'application pour y afficher le fichier. Il n'en va pas autrement avec Flash. Il s'agit d'un format binaire que vous pouvez au choix incorporer comme objet Multim&eacute;dia en HTML, ou bien proposer des fichiers Flash directement - les navigateurs les plus r&eacute;cents disposent d'un plugiciel pour Flash et peuvent afficher Flash directement. Cela n'a pourtant rien &agrave; voir avec les standards Internet, et si Macrom&eacute;dia, le fabricant du logiciel Flash, d&eacute;cide demain de r&eacute;former Flash ou de le modifier de fond en comble, alors c'est comme &ccedil;a et personne n'y pourra rien changer.</p>

<p>Flash a le vent en poupe partout o&ugrave; l'on pense qu'une page Web, ce doit &ecirc;tre comme la t&eacute;l&eacute;vision. Sans arr&ecirc;t quelque chose qui bouge, des fondus encha&icirc;n&eacute;s sophistiqu&eacute;s, des effets de lumi&egrave;re, des bruits, de la musique etc. Certains cr&eacute;ateurs en herbe en sont convaincus mais davantage encore les services de mercatique de soci&eacute;t&eacute;s qui laissent structurer leur venue sur le Web par des agences et qui veulent pour cette raison voir quelque chose sur l'&eacute;cran, dont ils pensent que c'est particuli&egrave;rement difficile et passionnant. L&agrave; nuisent les recherches d'effets  - ils sont d'ailleurs ressentis comme particuli&egrave;rement &eacute;nervant par la majorit&eacute; des visiteurs de pages - Flash est utilis&eacute; la plupart du temps dans ce seul but. Ces effets nuisent &agrave; cette technologie plus qu'ils ne la servent. Car &agrave; vrai dire Flash peut &ecirc;tre utilis&eacute; &agrave; bon escient. Flash se base sur le graphique vectoriel anim&eacute;. Lors de la cr&eacute;ation d'une <b>animation Flash</b>, vous travaillez avec le logiciel Flash original avec lequel vous positionnez des repr&eacute;sentations graphiques, du texte, des &eacute;l&eacute;ments incorpor&eacute;s comme des graphiques en pixels ou du son sur une &eacute;chelle de temps. Vous d&eacute;terminez ainsi le d&eacute;roulement dans le temps. Flash peut calculer les passages entre deux &eacute;tats sur l'&eacute;chelle de temps. Supposons que vous ayez &agrave; la seconde 0 un point bleu et qu'&agrave; la seconde 1, au m&ecirc;me endroit, vous ayez un point rouge, alors il vous est possible de d&eacute;finir un passage progressif de la couleur bleue &agrave; la couleur rouge qui s'&eacute;tale sur une seconde. Toute &quot;animation&quot; n'a pas un d&eacute;but et une fin. De la m&ecirc;me fa&ccedil;on des effets de boucles sont possibles par lesquels on peut avec Flash r&eacute;aliser des applications orient&eacute;es sur le dialogue comme des jeux ou des Aides &agrave; la navigation. Flash offre &eacute;galement des interfaces sp&eacute;cifiques au Web. Ainsi on peut sans probl&egrave;me incorporer dans Flash des liens &agrave; d'autres pages pouvant &ecirc;tre cliqu&eacute;s. Dans le domaine p&eacute;dagogique, Flash peut &ecirc;tre par exemple bien utilis&eacute; parce qu'il se pr&ecirc;te bien &agrave; la visualisation de processus et de tenants et aboutissants. L'utilisation judicieuse pour de tels cas reste isol&eacute;e - pourtant sur le Web dominent malheureusement essentiellement ces bandeaux de textes volant b&ecirc;tement et ces effets d'&eacute;clairs.</p>

<p>Pour des applications plus ambitieuses, l'interface visuelle du logiciel Flash original ne se suffit pas &agrave; elle seule. Flash dispose pour cette raison en plus d'un langage de programmation qui permet aux d&eacute;veloppeurs de r&eacute;soudre des probl&egrave;mes plus complexes.</p>

<p>Pour r&eacute;sumer Flash est donc un outil puissant pour visualiser des contenus. N'oublions cependant pas de mentionner qu'il y a des standards Internet disponibles librement, document&eacute;s en clair et en fin de compte encore plus performants pour faire ce que fait Flash. Ainsi sont standardis&eacute;s au consortium W3 deux langages bas&eacute;s sur <img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="xml.htm"><b>XML</b></a> nomm&eacute;s <img src="../../src/en.gif" width="16" height="10" border="0" alt="Page en langue anglaise">&nbsp;<a target="_top" href="http://www.w3.org/Graphics/SVG/"><b>SVG</b></a> et <img src="../../src/en.gif" width="16" height="10" border="0" alt="Page en langue anglaise">&nbsp;<a target="_top" href="http://www.w3.org/AudioVideo/"><b>SMIL</b></a> et qui ouvre en relation avec <img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="javascript.htm"><b>JavaScript et DOM</b></a> des possibilit&eacute;s similaires. Pourtant malheureusement, les navigateurs modernes sont livr&eacute;s avec le plugiciel Flash et ne sont pas encore en mesure de traiter SVG ou SMIL. Et aussi longtemps qu'il n'y aura pas d'outil d'auteur qui interpelle &eacute;galement ces cr&eacute;ateurs Web qui ne supportent pas de voir du code source &agrave; l'&eacute;cran, ces standards auront du mal &agrave; lutter contre des apparitions comme Flash.</p>





<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="infos">Informations Flash</a></h2>

<p>Dans les <img src="../../src/en.gif" width="16" height="10" border="0" alt="Page en langue anglaise">&nbsp;<a target="_top" href="http://www.macromedia.com/"><b>pages Web de Macrom&eacute;dia</b></a> vous pouvez rechercher des informations sur Flash. Dans tous les moteurs de recherche importants sur le Web, vous trouverez d'innombrables offres Web qui traitent de Flash. Le logiciel original pour la cr&eacute;ation d'animations Flash est payant et exige une licence. Le logiciel de reproduction Flash est &eacute;galement livr&eacute; comme plugiciel sur de nombreux navigateurs et il peut &ecirc;tre utilis&eacute; librement.</p>

<p>Dans la pr&eacute;sente documentation, la technologie Flash n'est pas trait&eacute;e davantage.</p>







<table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr><td colspan="2" bgcolor="#EEEEEE" class="doc">
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a>
</td></tr>
<tr><td bgcolor="#EEEEEE" class="doc" align="right"><a href="../aide/docs.htm"><img src="../../src/suivant.gif" width="10" height="10" border="0" hspace="10" alt="page suivante"></a></td>
<td bgcolor="#FFFFFF"><img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information"> <a href="../aide/docs.htm"><b>Documents et documentations</b></a>
</td></tr>
<tr>
<td bgcolor="#EEEEEE" class="doc" align="right"><a href="activex.htm"><img src="../../src/precedent.gif" width="10" height="10" border="0" hspace="10" alt="page pr&eacute;c&eacute;dente"></a></td>
<td bgcolor="#FFFFFF" width="100%"><img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information"> <a href="activex.htm"><b>ActiveX</b></a>
</td>
</tr>
<tr><td colspan="2" bgcolor="#EEEEEE" class="doc">&#160;</td></tr>
</table><table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr>
<td bgcolor="#FFEEDD" class="nav"><a class="an" name="bottom"><img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"></a> <a href="../../index.htm"><b>SELFHTML</b></a>/<a href="../../navigation/index.htm" target="_parent">Aides &agrave; la navigation</a> <img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="../index.htm"><b>Introduction</b></a> <img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="index.htm"><b>Technologies du Web</b></a></td>
</tr>
</table>

<p>&copy; 2001 Stefan M&uuml;nz / &copy; 2003 Traduction <img src="../../src/courriel.gif" width="15" height="10" border="0" alt="Adresse &eacute;lectronique">&nbsp;<a href="mailto:13405@free.fr">Serge Fran&ccedil;ois, 13405@free.fr</a><br><img src="../../src/courriel.gif" width="15" height="10" border="0" alt="Adresse &eacute;lectronique">&nbsp;<a href="mailto:selfhtml@selfhtml.com.fr">selfhtml@selfhtml.com.fr</a></p>



</body>
</html>
