<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>SELFHTML: HTML/XHTML / Formulaires / Exploitation des formulaires</title>
<link rel="stylesheet" type="text/css" href="../../src/selfhtml.css">
<meta name="description"    content="Comment traiter les formulaires HTML comme du courrier &eacute;lectronique ou avec CGI et ce &agrave; quoi il faut faire attention en particulier avec les formulaires mailto.">
<meta name="keywords"       content="SELFHTML, HTML, XHTML, formulaires, traitement, courriel, scripts CGI, formulaires mailto">
<meta name="author"         content="Stefan M&uuml;nz, selfhtml@teamone.de">
<meta http-equiv="content-type" content="text/html; charset=ISO-8859-1">
<meta name="DC.Publisher"   content="Serge Fran&ccedil;ois, selfhtml@selfhtml.com.fr">
<meta name="DC.Date"        content="2003-01-27T08:00+00:00">
<meta name="DC.Identifier"  content="http://selfhtml.selfhtml.com.fr/html/formulaires/traiter.htm">
<meta name="DC.Language"    content="fr">
<meta name="DC.Rights"      content="../../editorial/copyright.htm">
<meta name="DC.Date.Create" content="2003-01-27T08:00+00:00">
<meta name="SELF.Version"   content="1">
<meta name="SELF.Pagetype"  content="Information">
<meta name="SELF.Path"      content="SELFHTML == ../../index.htm // HTML/XHTML == ../index.htm // Formulaires == index.htm">
<link rel="stylesheet" type="text/css" href="../../src/selfhtml.css">
<!-- Matomo -->
<script type="text/javascript">
  var _paq = window._paq = window._paq || [];
  /* tracker methods like "setCustomDimension" should be called before "trackPageView" */
  _paq.push(['trackPageView']);
  _paq.push(['enableLinkTracking']);
  (function() {
    var u="//matomo.boitasite.com/";
    _paq.push(['setTrackerUrl', u+'matomo.php']);
    _paq.push(['setSiteId', '1']);
    var d=document, g=d.createElement('script'), s=d.getElementsByTagName('script')[0];
    g.type='text/javascript'; g.async=true; g.src=u+'matomo.js'; s.parentNode.insertBefore(g,s);
  })();
</script>
<!-- End Matomo Code -->
</head>

<body bgcolor="#FFFFFF" text="#000000" link="#AA5522" vlink="#772200" alink="#000000">

<table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr><td bgcolor="#FFEEDD" class="nav"><a class="an" name="top"><img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"></a> <a href="../../index.htm"><b>SELFHTML</b></a>/<a href="../../navigation/index.htm" target="_parent">Aides &agrave; la navigation</a> <img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="../index.htm"><b>HTML/XHML</b></a> <img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="index.htm"><b>Formulaires</b></a></td>
</tr></table>

<table cellpadding="4" cellspacing="0" border="0" width="100%">

<tr>
<td bgcolor="#EEEEEE" class="doc" width="110"><img src="../../src/logo.gif" width="106" height="109" border="0" alt="SELFHTML"></td>
<td bgcolor="#EEEEEE" class="doc" valign="bottom" width="100%"><h2>Exploitation des formulaires</h2></td>
</tr>

<tr>
<td bgcolor="#EEEEEE" class="doc" valign="top" align="center">
<img src="../../src/docx.gif" width="30" height="20" vspace="6" border="0" alt="Page d'information: vue d'ensemble">
</td>

<td bgcolor="#FFFFFF" valign="top" nowrap>
<p>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#courriel"><b>Formulaires en tant que courriel</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#cgi"><b>Formulaires et CGI</b></a><br>
</p>
</td>
</tr>

<tr><td colspan="2" bgcolor="#EEEEEE" class="doc">&#160;<a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&nbsp;</td></tr>
</table>




<h2 class="Sh2"><a class="an" name="courriel">Formulaires en tant que courriel</a></h2>

<p>Beaucoup d'utilisateurs qui re&ccedil;oivent de la place pour leurs propres pages
Web sur les serveurs de gros fournisseurs bon march&eacute;, n'ont pas la possibilit&eacute; de mettre en place sur l'ordinateur serveur leurs propres scripts CGI pour le traitement des donn&eacute;es. En outre la plupart de ces fournisseurs modernes de pages ne sont pas des informaticiens qui d&eacute;sirent se former dans les langages de programmation, les syst&egrave;mes d'exploitation diff&eacute;rents du leur, les variables d'environnement et les protocoles de transmission de donn&eacute;es. Pourtant beaucoup de fournisseurs de pages d&eacute;sirent profiter de la possibilit&eacute; de recevoir &agrave; l'aide de formulaires HTML des donn&eacute;es cibl&eacute;es et structur&eacute;es de fa&ccedil;on homog&egrave;ne des visiteurs de leurs pages WWW. Dans ce but existe la possibilit&eacute; de se faire envoyer des formulaires compl&eacute;t&eacute;s comme courrier &eacute;lectronique.</p>

<p>Les navigateurs WWW repr&eacute;sentent un probl&egrave;me avec cette solution &eacute;tant donn&eacute; qu'ils ne sont pas en mesure d'envoyer des formulaires avec <code>action=&quot;mailto:...&quot;</code>. En font partie les navigateurs autonomes sans module de courriel et qui sont con&ccedil;us de telle fa&ccedil;on qu'il appellent un autre programme de courriel sur l'ordinateur de l'utilisateur. Par ce biais, il n'est pourtant pas  forc&eacute; que la communication entre le navigateur et le programme de courriel marche de telle fa&ccedil;on que les donn&eacute;es du formulaire soient transmises puis envoy&eacute;es sans h&eacute;sitation par le programme  de courriel. Chez de nombreux utilisateurs, surgit alors le probl&egrave;me que le programme de courriel ouvre purement et simplement une fen&ecirc;tre vide pour un nouveau message, au lieu d'envoyer directement les donn&eacute;es du formulaire qui lui sont transmises par le navigateur. Pour &eacute;viter ce probl&egrave;me, vous ne pouvez rien faire en tant que fournisseur de pages Web. C'est donc une question de chance si l'envoi de formulaire par courriel fonctionne chez les visiteurs de vos pages ou non. Pour contourner le probl&egrave;me, vous pouvez faire appel &agrave; un service CGI public pour ce qu'on appelle un  <b>routage de formulaires</b> (Form-Mailer). Les donn&eacute;es de formulaires y sont trait&eacute;es par un programme CGI et vous sont envoy&eacute;es sous forme de courriel. Dans l'index des liens de l'offre en ligne de SELFHTML actuel, vous trouverez &agrave; la page  <img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="http://www.selfhtml.com.fr/liens/index.htm"><b>Index de liens SELFHTML</b></a> Liens &agrave; des prestataires de routage de formulaires.</p>

<p>Un autre probl&egrave;me r&eacute;side dans le fait que les donn&eacute;es de formulaire lors de l'envoi sont par d&eacute;faut cod&eacute;es dans un certain type Mime, le type Mime <code>application/x-www-form-urlencoded</code>. Dans cette op&eacute;ration, tous les espaces et caract&egrave;res sp&eacute;ciaux sont remplac&eacute;s par des cha&icirc;nes de caract&egrave;res sp&eacute;ciales. Ainsi par exemple la phrase <code>Danke f&uuml;r die Hilfe!</code> devient apr&egrave;s transformation: <code>Danke+f%FCr+die+Hilfe%21</code>: Pour des humains, c'est une lecture assez indigeste. Pour &eacute;viter le codage, vous pouvez mentionner dans le rep&egrave;re d'ouverture <code>&lt;form&gt;</code> par exemple la mention <code>enctype=&quot;text/plain&quot;</code>. Vous recevrez pourtant des donn&eacute;es de formulaires cod&eacute;es de la part d'utilisateurs dont le navigateur n'interpr&egrave;te pas cette commande.</p>

<p>N'employez donc la possibilit&eacute; de vous faire envoyer des formulaires par courriel directement que lorsque c'est vraiment n&eacute;cessaire et pour des choses vraiment importantes. Dans tous les autres cas, un traitement des donn&eacute;es c&ocirc;t&eacute; serveur par un script CGI ou semblable doit &ecirc;tre privil&eacute;gi&eacute;.</p>





<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&nbsp;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="cgi">Formulaires et CGI</a></h2>

<p>De nombreux cas d'application pour les formulaires en HTML n&eacute;cessitent un
traitement des donn&eacute;es sur l'ordinateur serveur sur le WWW. Si par exemple vous voulez qu'on puisse rechercher dans tout votre projet un terme, vous pouvez
proposer un formulaire &agrave; l'utilisateur, dans lequel il pourra entrer le terme
recherch&eacute;. Apr&egrave;s l'envoi de ce formulaire, il faut qu'un programme sur
l'ordinateur serveur recherche le terme d&eacute;sir&eacute; dans tous les fichiers du projet et cr&eacute;e un fichier HTML dynamique contenant les liens &agrave; toutes les pages qui contiennent le terme recherch&eacute;.</p>

<p>Pour de tels cas, mais aussi pour des cas tels que les livres de visite, les
forums de discussion, les paniers d'achat &eacute;lectroniques etc... vous avez besoin d'un programme sur l'ordinateur serveur qui traite imm&eacute;diatement les donn&eacute;es entr&eacute;es ou choisies dans un formulaire et qui propose une v&eacute;ritable interaction &agrave; l'utilisateur.</p>

<p>Le port de programmation standard remplissant ce r&ocirc;le sur les serveurs WWW
est le CGI (Common Gateway Interface). Quelques serveurs WWW disposent aussi encore
d'autres ports de programmation, selon le logiciel HTTP employ&eacute;. Le fournisseur d'acc&egrave;s chez qui vous sauvegardez vos pages WWW doit vous permettre l'acc&egrave;s &agrave; ces ports de programmation, pour que vous puissiez r&eacute;aliser vous-m&ecirc;me de telles applications. Beaucoup de fournisseurs d'acc&egrave;s bon march&eacute; n'autorisent pas un tel acc&egrave;s &agrave; leurs membres .</p>

<p>Le langage de programmation le plus courant pour les scripts CGI est Perl.
Demandez pourtant &agrave; votre fournisseur d'acc&egrave;s avant de programmer vos propres scripts CGI quels genres de programmes sont ex&eacute;cutables sur le serveur. Si vous voulez programmer en Perl, demandez &agrave; votre fournisseur d'acc&egrave;s si le serveur dispose d'un interpr&eacute;teur Perl et o&ugrave; l'interpr&eacute;teur se trouve exactement sur le serveur. Vous trouverez dans ce document une documentation compl&egrave;te sur <img src="../../src/chap.gif" width="15" height="13" border="0" alt="Chapitre: vue d'ensemble">&nbsp;<a href="../../cgiperl/index.htm"><b>CGI/Perl</b></a>.</p>








<table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr><td colspan="2" bgcolor="#EEEEEE" class="doc">
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a>
</td></tr>

<tr><td bgcolor="#EEEEEE" class="doc" align="right"><a href="../frames/definir.htm"><img src="../../src/suivant.gif" width="10" height="10" border="0" hspace="10" alt="page suivante"></a></td>
<td bgcolor="#FFFFFF"><img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information"> <a href="../frames/definir.htm"><b>D&eacute;finir des cadres et jeux de cadres</b></a>
</td></tr>

<tr>
<td bgcolor="#EEEEEE" class="doc" align="right"><a href="formater.htm"><img src="../../src/precedent.gif" width="10" height="10" border="0" hspace="10" alt="page pr&eacute;c&eacute;dente"></a></td>
<td bgcolor="#FFFFFF" width="100%"><img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information"> <a href="formater.htm"><b>Formatage de formulaires avec les CSS</b></a>
</td>

</tr>
<tr><td colspan="2" bgcolor="#EEEEEE" class="doc">&nbsp;</td></tr>
</table>

<table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr><td bgcolor="#FFEEDD" class="nav"><a class="an" name="bottom"><img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"></a> <a href="../../index.htm"><b>SELFHTML</b></a>/<a href="../../navigation/index.htm" target="_parent">Aides &agrave; la navigation</a> <img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="../index.htm"><b>HTML/XHML</b></a> <img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="index.htm"><b>Formulaires</b></a></td>
</tr></table>

<p>&copy; 2001 Stefan M&uuml;nz / &copy; 2003 Traduction <img src="../../src/courriel.gif" width="15" height="10" border="0" alt="Adresse &eacute;lectronique">&nbsp;<a href="mailto:13405@free.fr">Serge Fran&ccedil;ois, 13405@free.fr</a><br><img src="../../src/courriel.gif" width="15" height="10" border="0" alt="Adresse &eacute;lectronique">&nbsp;<a href="mailto:selfhtml@selfhtml.com.fr">selfhtml@selfhtml.com.fr</a></p>

</body>
</html>
