<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>SELFHTML: CGI/Perl / Modules Perl / Modules CPAN</title>
<link rel="stylesheet" type="text/css" href="../../src/selfhtml.css">
<meta name="description"    content="Comment trouver les modules Perl dans le r&eacute;pertoire CPAN et que faut-il observer pour le faire.">
<meta name="keywords"       content="SELFHTML, Perl, modules, Modules Perl, CPAN">
<meta name="author"         content="Stefan M&uuml;nz, selfhtml@teamone.de">
<meta http-equiv="content-type" content="text/html; charset=ISO-8859-1">
<meta name="DC.Publisher"   content="Serge Fran&ccedil;ois, selfhtml@selfhtml.com.fr">
<meta name="DC.Date"        content="2003-01-27T08:00+00:00">
<meta name="DC.Identifier"  content="http://selfhtml.selfhtml.com.fr/cgiperl/modules/modulescpan.htm">
<meta name="DC.Language"    content="fr">
<meta name="DC.Rights"      content="../../editorial/copyright.htm">
<meta name="DC.Date.Create" content="2003-01-27T08:00+00:00">
<meta name="SELF.Version"   content="1">
<meta name="SELF.Pagetype"  content="Information">
<meta name="SELF.Path"      content="SELFHTML == ../../index.htm // CGI/Perl == ../index.htm // Modules Perl == index.htm">
<!-- Matomo -->
<script type="text/javascript">
  var _paq = window._paq = window._paq || [];
  /* tracker methods like "setCustomDimension" should be called before "trackPageView" */
  _paq.push(['trackPageView']);
  _paq.push(['enableLinkTracking']);
  (function() {
    var u="//matomo.boitasite.com/";
    _paq.push(['setTrackerUrl', u+'matomo.php']);
    _paq.push(['setSiteId', '1']);
    var d=document, g=d.createElement('script'), s=d.getElementsByTagName('script')[0];
    g.type='text/javascript'; g.async=true; g.src=u+'matomo.js'; s.parentNode.insertBefore(g,s);
  })();
</script>
<!-- End Matomo Code -->
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#AA5522" vlink="#772200" alink="#000000">

<table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr>
<td bgcolor="#FFEEDD" class="nav"><a class="an" name="top"><img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"></a> <a href="../../index.htm"><b>SELFHTML</b></a>/<a href="../../navigation/index.htm" target="_parent">Aides &agrave; la navigation</a> <img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="../index.htm"><b>CGI/Perl</b></a> <img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="index.htm"><b>Modules Perl</b></a></td>
</tr>
</table><table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr>
<td bgcolor="#EEEEEE" class="doc" width="110"><img src="../../src/logo.gif" width="106" height="109" border="0" alt="SELFHTML"></td>
<td bgcolor="#EEEEEE" class="doc" valign="bottom" width="100%"><h2>Modules CPAN</h2>
<tr>
<td bgcolor="#EEEEEE" class="doc" valign="top" align="center">
<img src="../../src/docx.gif" width="30" height="20" vspace="6" border="0" alt="Page d'information: vue d'ensemble">
</td>
<td bgcolor="#FFFFFF" valign="top" nowrap>
<p>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#generalites"><b>G&eacute;n&eacute;ralit&eacute;s sur les modules du r&eacute;pertoire CPAN</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#adresses"><b>Adresses du r&eacute;pertoire CPAN</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#categories"><b>Cat&eacute;gories pour les modules du r&eacute;pertoire CPAN</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#telecharger_installer"><b>T&eacute;l&eacute;charger et installer les modules du r&eacute;pertoire  CPAN</b></a><br>
</p>
</td>
</tr><tr><td colspan="2" bgcolor="#EEEEEE" class="doc">&#160;<a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;</td></tr>
</table>



<h2 class="Sh2"><a class="an" name="generalites">G&eacute;n&eacute;ralit&eacute;s sur les modules du r&eacute;pertoire CPAN</a></h2>

<p>CPAN veut dire <i>Comprehensive Perl Archive Network</i> (&agrave; traduire en fran&ccedil;ais approximativement par <i>R&eacute;seau contenant les archives Perl</i>). C'est une esp&egrave;ce de collection officielle de modules Perl. Le r&eacute;pertoire CPAN contient des milliers de modules pour toutes les t&acirc;ches imaginables, que ce soit pour la programmation de calendriers, les calculs math&eacute;matiques, le traitement de texte, le cryptage de donn&eacute;es ou les acc&egrave;s Internet. Fouiller dans le r&eacute;pertoire CPAN et se procurer un module appropri&eacute;, peut donc &eacute;pargner de longues heures et journ&eacute;es de travail de programmation. &Agrave; cela s'ajoute qu'un module qui a fait ses preuves est d&eacute;j&agrave; , la plupart du temps d&eacute;barrass&eacute; des bogues (erreurs) dans le code et poss&egrave;de une stabilit&eacute; dans son ex&eacute;cution que le code que l'on &eacute;crit soi-m&ecirc;me n'acquiert souvent qu'au terme d'une longue p&eacute;riode.</p>

<p>Les modules du r&eacute;pertoires CPAN doivent il est vrai - &agrave; la diff&eacute;rence des <img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="modulesstandard.htm"><b>modules Standard</b></a> - &ecirc;tre d'abord install&eacute;s avant qu'un script ne puisse les utiliser. Quand un script doit tourner sur un autre ordinateur, les modules CPAN qui sont utilis&eacute;s dans ce script doivent &eacute;galement y &ecirc;tre d'abord install&eacute;s. Pour ce faire, il vous faut d'abord t&eacute;l&eacute;charger les modules souhait&eacute;s.</p>

<p>Les modules du r&eacute;pertoires CPAN disposent en g&eacute;n&eacute;ral exactement comme les modules standard d'une documentation int&eacute;gr&eacute;e qui peut &ecirc;tre lue avec <img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="intro.htm#perldoc"><b>perldoc</b></a>.</p>




<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="adresses">Adresses du r&eacute;pertoire CPAN</a></h2>

<p>Le r&eacute;pertoire CPAN est, en raison de la forte demande des nombreux programmeurs Perl, copi&eacute; &agrave; l'identique sur de nombreux serveurs r&eacute;partis dans le monde. C'est pourquoi il est conseill&eacute; de s'informer d'abord sur les serveurs disponibles. Vous trouverez la liste officielle des serveurs CPAN &agrave; l'adresse suivante:</p>

<p><img src="../../src/en.gif" width="15" height="10" border="0" alt="Page en langue anglaise">&nbsp;<a href="http://www.perl.com/CPAN/SITES"><b>http://www.perl.com/CPAN/SITES</b></a></p>

<p>Les serveurs dont la liste y est dress&eacute;e sont principalement des serveurs FTP publics. La plupart des navigateurs sont en mesure d'afficher les contenus de sites FTP. Sinon, vous pouvez aussi &agrave; l'aide d'un programme FTP acc&eacute;der &agrave; un tel serveur. Dans l'index des liens de l'offre en ligne de SELFHTML actuel, vous trouverez un r&eacute;capitulatif avec des liens aux fournisseurs de ces programmes:</p>

<p><img src="../../src/serverdoc.gif" width="15" height="10" border="0" alt="Page d'information: connexion exig&eacute;e">&nbsp;<a target="_top" href="http://www.selfhtml.com.fr/liens/logiciels_ftp.htm"><b>SELFHTML Index des liens: programmes FTP</b></a></p>

<p>Pour les copies &agrave; l'identique du r&eacute;pertoire CPAN, il s'agit de sites FTP publics. Cela signifie que pour la connexion FTP au serveur, vous mentionnez simplement l'adresse du serveur (nom ou adresse IP) comme nom d'utilisateur <i>Anonymous</i> et comme mot de passe votre adresse &eacute;lectronique.<br>
Quelques-uns des serveurs &eacute;num&eacute;r&eacute;s sont cependant aussi des serveurs HTTP, appropri&eacute;s pour les navigateurs sans fonction FTP int&eacute;gr&eacute;e.</p>

<p>Vous pouvez aussi fouiller dans le r&eacute;pertoire CPAN en feuilletant des pages Web normales. Appelez pour cela l'adresse suivante:</p>

<p><img src="../../src/en.gif" width="15" height="10" border="0" alt="Page en langue anglaise">&nbsp;<a href="http://www.perl.com/CPAN/"><b>http://www.perl.com/CPAN/</b></a></p>




<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="categories">Cat&eacute;gories pour les modules du r&eacute;pertoire CPAN</a></h2>

<p>Vous obtenez une bonne vue d'ensemble du contenu sur les modules disponibles quand vous passez avec un programme FTP du r&eacute;pertoire CPAN dans le sous r&eacute;pertoire <i>modules</i> et de l&agrave; dans le sous-r&eacute;pertoire <i>by-category</i>. Chaque cat&eacute;gorie est repr&eacute;sent&eacute;e par un sous-r&eacute;pertoire. Le tableau suivant dresse la liste des noms des sous-r&eacute;pertoires disponibles au moment de la r&eacute;daction de ce texte et donne pour chaque sous-r&eacute;pertoire un bref aper&ccedil;u de son contenu. Cet aper&ccedil;u est, il est vrai, une id&eacute;e grossi&egrave;re de ce qu'on peut trouver dans chacun des r&eacute;pertoires. Quand vous recherchez un module pour un travail bien pr&eacute;cis, vous devez lors de votre visite du r&eacute;pertoire CPAN y passez quelque temps pour feuilleter et pour lire.</p>

<p>Observez que le r&eacute;pertoire CPAN est tri&eacute; physiquement par auteur. Le tri par cat&eacute;gorie ne contient pour cette raison que des liens symboliques aux r&eacute;pertoires et fichiers dans d'autres r&eacute;pertoires subordonn&eacute;s au r&eacute;pertoire  <i>authors</i>. Quand vous choisissez donc un r&eacute;pertoire ou un fichier, vous changez automatiquement dans un r&eacute;pertoire plus &eacute;loign&eacute; ou recevez un fichier d'un r&eacute;pertoire plus &eacute;loign&eacute;.</p>

<table cellpadding="0" cellspacing="0" border="0"
bgcolor="#C0C0C0"><tr><td>
<table cellpadding="3" cellspacing="1" border="0"
>
<tr>
<th bgcolor="#EEEEEE" class="doc" align="left" nowrap>Sous-r&eacute;pertoire</th>
<th bgcolor="#EEEEEE" class="doc" align="left">Contenu</th>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>02_Perl_Core_Modules</code></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top"><p>Contient des modules consid&eacute;r&eacute;s comme faisant partie du noyau de Perl. Beaucoup de ces modules font aussi partie entre-temps des <img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="modulesstandard.htm"><b>modules standard</b></a> de Perl. Le r&eacute;pertoire contient n&eacute;anmoins plus encore que les modules standard, Pour les autres modules, il s'agit de candidats pour devenir module standard.</p>
<p>Quelques modules ou groupes de modules int&eacute;ressants de ce sous-r&eacute;pertoire sont:<br>
<code>Filter</code> filtre le code source d'un script Perl d'apr&egrave;s diff&eacute;rents crit&egrave;res avant qu'il ne soit ex&eacute;cut&eacute;.<br>
<code>enum</code> permet de d&eacute;finir des constantes symboliques et de travailler ainsi avec le type de donn&eacute;es connu en C.</p>
</td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>03_Development_Support</code></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top"><p>Contient des modules qui soutiennent le d&eacute;veloppement de scripts Perl et de modules.</p>
<p>Quelques modules ou groupes de modules int&eacute;ressants de ce sous-r&eacute;pertoire sont:<br>
<code>Devel::</code> met diff&eacute;rents utilitaires &agrave; disposition avec lesquels peuvent &ecirc;tre contr&ocirc;l&eacute;s le profilage, le d&eacute;bogage et le contr&ocirc;le du temps d'ex&eacute;cution de scripts Perl et de modules.<br>
<code>ExtUtils::</code> contient outre le module faisant partie des modules standard, d'autres modules par exemple un pr&eacute;-processeur Perl.<br>
<code>CVS::</code> est une interface pour le syst&egrave;me de gestion de versions CVS (<i>concurrent versioning system</i>).</p>
</td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>04_Operating_System_Interfaces</code></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top"><p>Contient des modules pour les appels li&eacute;s au syst&egrave;me d'exploitation et pour les fonctions sp&eacute;cifiques au syst&egrave;me d'exploitation.</p>
<p>Quelques modules ou groupes de modules int&eacute;ressants de ce sous-r&eacute;pertoire sont:<br>
<code>Async::</code> Contient des fonctions pour le traitement parall&egrave;le de sonn&eacute;es sur des ordinateurs en mode &quot;multit&acirc;che v&eacute;ritable&quot;.<br>
<code>BSD::</code> Contient des fonctions sp&eacute;ciales pour Berkeley-Unix. Il existe les fonctions correspondantes dans <code>MSDOS::</code>, <code>Mac::</code>,  <code>OS2::</code>, <code>Solaris::</code> etc...<br>
<code>Proc::</code> offre des fonctions pour le contr&ocirc;le de processus en cours.<br>
<code>Quota</code> permet l'acc&egrave;s &agrave; des donn&eacute;es syst&egrave;me  comme l'espace disque disponible, la m&eacute;moire de travail etc...</p>
</td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>05_Networking_Devices_IPC</code></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top"><p>Contient des modules pour la programmation de r&eacute;seau.</p>
<p>Quelques modules ou groupes de modules int&eacute;ressants de ce sous-r&eacute;pertoire sont:<br>
<code>CORBA</code> contient des fonctions pour l'utilisation de CORBA (<i>Common Object Request Broker Architecture</i>).<br>
<code>DCE::</code> contient des modules pour des fonctions de s&eacute;curit&eacute; d'apr&egrave;s DCE (<i>Distributed Computing Environment</i>).<br>
<code>IPC::</code> Contient des modules qui d&eacute;passent ceux du module standard IPC et des fonctions pour la communication entre les processus.<br>
<code>Net::</code> Contient des modules qui d&eacute;passent ceux du module standard Net et des fonctions qui permettent la communication entre les processus sur diff&eacute;rents ordinateurs entre autres pour DNS (<i>Domain Name Service</i>) ou pour des protocoles comme IRC (<i>Internet Relay Chat</i>) ou bien LDAP.
</p>
</td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>06_Data_Type_Utilities</code></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top"><p>Contient des modules pour les types de donn&eacute;es, les structures de donn&eacute;es et des algorithmes importants.</p>
<p>Quelques modules ou groupes de modules int&eacute;ressants de ce sous-r&eacute;pertoire sont:<br>
<code>Alghorithms::</code> Contient des modules qui travaillent &agrave; l'aide d'algorithmes reconnus et qui effectuent des t&acirc;ches comme le choix al&eacute;atoire de donn&eacute;es ou le calcul de graphiques dirig&eacute;s.<br>
<code>Array::</code> Contient des modules pour la manipulation de listes.<br>
<code>Bit::</code> Contient des modules pour la manipulation de cha&icirc;nes de bits et d'op&eacute;rations de bits.<br>
<code>Class::</code> Contient des modules qui soutiennent la programmation orient&eacute;e sur l'objet.<br>
<code>Data::</code> Contient des modules pour la repr&eacute;sentation et le formatage de donn&eacute;es.<br>
<code>Date::</code> Contient des modules pour le calcul de la date et de l'heure d'apr&egrave;s diff&eacute;rents calendriers.<br>
<code>Graph::</code> Contient des modules pour le calcul de graphiques.<br>
<code>Math::</code> Contient des modules  qui d&eacute;passent ceux du module standard Math et proposent des fonctions math&eacute;matiques par exemple pour le calcul fractal, pour le calcul d'approximation, pour le calcul int&eacute;gral, pour le calcul de matrices et pour g&eacute;n&eacute;rer des nombres al&eacute;atoires.<br>
<code>Set::</code> Contient des modules pour l'impl&eacute;mentation de quantit&eacute;s logiques.<br>
<code>Statistics::</code> Contient des modules pour diff&eacute;rentes sortes de calculs statistiques, par exemple pour le calcul de valeurs moyennes, de l'&eacute;cart standard, de l'entropie maximale et de la progression lin&eacute;aire.<br>
<code>Tie::</code> Contient des modules pour diff&eacute;rents liaisons de variables &agrave; des objets, par exemple r&eacute;alisation d'un temporisateur (interrogation du temps &agrave; intervalles r&eacute;guliers), gestion du cache, acc&egrave;s aux bases de donn&eacute;es ou r&eacute;-acheminement du canal standard STDERR &agrave; un programme par exemple un programme de courrier &eacute;lectronique.<br>
<code>Time::</code> Contient des modules pour le calcul des mentions de temps, par exemple pour des mentions pr&eacute;cises &agrave; la seconde pr&egrave;s, pour la date du calendrier julien, et les fuseaux horaires.<br>
<code>Tree::</code> Contient des modules pour des structures de donn&eacute;es arborescentes ou des arborescences AVL.
</p>
</td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>07_Database_Interfaces</code></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top"><p>Contient des modules pour la communication avec les syst&egrave;mes de bases de donn&eacute;es connus.</p>
<p>Quelques modules ou groupes de modules int&eacute;ressants de ce sous-r&eacute;pertoire sont:<br>
<code>DBD::</code> Contient des modules qui font office de pilote pour l'interface  DBI ind&eacute;pendante des donn&eacute;es. Par  DBI il est par exemple possible d'acc&eacute;der aux syst&egrave;mes de bases de donn&eacute;es comme Adabas, DB2, Informix, Oracle, Ingres, MySQL, QBase ou bien Sybase. Les pilotes ODBC sont eux aussi contenus.<br>
<code>Metadata::</code> Contient des modules qui soutiennent les formats de donn&eacute;es Meta connus pour les syst&egrave;mes de recherche.
</p>
</td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>08_User_Interfaces</code></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top"><p>Contient des modules pour la programmation d'interfaces utilisateur avec  Perl.</p>
<p>Quelques modules ou groupes de modules int&eacute;ressants de ce sous-r&eacute;pertoire sont:<br>
<code>Cdk</code> et <code>Curses</code>: Contiennent des fonctions pour l'interface utilisateur connue orient&eacute;e sur le mode texte <i>Curses</i>.<br>
<code>Emacs::Lisp</code> Offre une interface pour l'&eacute;diteur de texte programmable <i>Emacs</i>.<br>
<code>Term::</code> Contient des modules pour le contr&ocirc;le de terminaux orient&eacute;s sur le mode texte. Ils comprennent des fonctions pour la repr&eacute;sentation des couleurs, les raccourcis clavier et les fonctions d'&eacute;dition avanc&eacute;es.<br>
<code>Tk::</code> Contiennent des fonctions pour servir des interfaces graphiques comme X11 (Unix) ou aussi  MS Windows.
</p>
</td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>09_Language_Interfaces</code></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top"><p>Contient des modules pour l'int&eacute;gration d'autres langages de programmation en Perl.</p>
<p>Quelques modules ou groupes de modules int&eacute;ressants de ce sous-r&eacute;pertoire sont:<br>
<code>C::</code> Contient des modules pour la liaison de programmes C et de biblioth&egrave;ques C.<br>
<code>Java</code> R&eacute;alise un environnement d'ex&eacute;cution Java pour Perl.<br>
<code>Python</code> Permet l'incorporation de code Perl dans des programmes  Python.
</p>
</td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>10_File_Names_Systems_Locking</code></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top"><p>Contient des modules pour la gestion de syst&egrave;mes de fichiers de noms de fichiers et le verrouillage de fichiers en cours d'utilisation.</p>
<p>Quelques modules ou groupes de modules int&eacute;ressants de ce sous-r&eacute;pertoire sont:<br>
<code>File::</code> Contient des modules qui d&eacute;passent ceux du module standard  File et propose des fonctions pour les sauvegardes, les descriptions de fichiers, les compteurs d'acc&egrave;s au fichier ou le chargement acc&eacute;l&eacute;r&eacute; de fichiers dans la m&eacute;moire de travail.<br>
<code>FileSys::</code> Contient des modules qui interrogent les informations syst&egrave;me comme par exemple la m&eacute;moire disponible.
</p>
</td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>11_String_Lang_Text_Proc</code></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top"><p>Contient des modules pour le traitement des cha&icirc;nes de caract&egrave;res et le traitement de texte.</p>
<p>Quelques modules ou groupes de modules int&eacute;ressants de ce sous-r&eacute;pertoire sont:<br>
<code>Font::</code> Contient des modules qui se consacrent aux tailles et formats de polices comme TrueType et Adobe Fonts.<br>
<code>Lingua::</code> Contient des modules qui se consacrent &agrave; la s&eacute;mantique et &agrave; la grammaire de langages naturels, par exemple la conversion de chiffres en lettres, la conjugaison de verbes, la formation du pluriel des substantifs etc...<br>
<code>Parser::</code> Contient des modules qui interpr&egrave;tent des langages artificiels connus.<br>
<code>RTF::</code> Contient des modules qui interpr&egrave;tent le format RTF (<i>Rich Text Format</i>) et le convertissent par exemple en texte ou en HTML.<br>
<code>SGML::</code> Contient des modules qui analysent la syntaxe de fichiers SGML.<br>
<code>String::</code> Contient des modules pour le traitement avanc&eacute; de cha&icirc;nes de caract&egrave;res, par exemple la recherche approximative, la recherche du nombre de bits, CRC (<i>Cycling Redundancy Checks</i>) etc...<br>
<code>Text::</code> Contient des modules pour des textes et formats de texte au del&agrave; de la ligne par exemple pour formater du texte, pour analyser la syntaxe de fichiers CSV (<i>Comma Separated Values</i>) etc...<br>
<code>XML::</code> Contient des modules pour l'analyse syntaxique de fichiers XML.
</p>
</td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>12_Opt_Arg_Param_Proc</code></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top"><p>Contient des modules pour la lecture de fichiers de configuration.</p>
<p>Un module ou groupe de modules int&eacute;ressant de ce sous-r&eacute;pertoire est:<br>
<code>ConfigReader</code> lit diff&eacute;rents fichiers de configuration.<br>
<code>Getopt::</code> Contient des modules qui  d&eacute;passent ceux du module standard Getopt et analysent les options de la ligne d'invite de commande &agrave; l'appel de l'interpr&eacute;teur Perl.<br>
<code>IniConf</code> lit les fichiers de configuration dans le format ini typique &agrave; Windows.
</p>
</td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>13_Internationalization_Locale</code></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top"><p>Contient des modules pour travailler avec des jeux de caract&egrave;res internationaux.</p>
<p>Quelques modules ou groupes de modules int&eacute;ressants de ce sous-r&eacute;pertoire sont:<br>
<code>Cz::</code> Contient des modules pour le traitement de textes en tch&egrave;que.<br>
<code>I18N::</code> Contient des modules pour le tri de noms de jeux de caract&egrave;res d'apr&egrave;s le standard IANA et pour les abr&eacute;viations de pays d'apr&egrave;s RFC 1766.<br>
<code>Locale::</code> Contient des modules pour le traitement de sp&eacute;cificit&eacute;s linguistiques locales, par exemple l'identification de pays d'apr&egrave;s les abr&eacute;viations de pays de RFC 1766 et pour le codage Unicode de textes.
</p>
</td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>14_Security_and_Encryption</code></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top"><p>Contient des modules pour le cryptage de donn&eacute;es et pour l'authentification. <b>Attention:</b> Observez avant le t&eacute;l&eacute;chargement de ces modules les restrictions sur le cryptage de votre pays! L'acquisition de code source avec des proc&eacute;d&eacute;s de cryptage illicites est un acte d&eacute;lictueux - malheureusement.</p>
<p>Quelques modules ou groupes de modules int&eacute;ressants de ce sous-r&eacute;pertoire sont:<br>
<code>Authen::</code> Contient des modules pour l'authentification, par exemple pour les cartes SecureID/ACE, le protocole Challenge-Response bas&eacute; sur MD5 ou l'authentification SAMBA sur les serveurs  Windows-NT.<br>
<code>Crypt::</code> Contient des modules pour le cryptage de donn&eacute;es, par exemple d'apr&egrave;s le standard de cryptage DES (<i>Data Encryption Standard</i>), d'apr&egrave;s le standard MD5 etc...<br>
<code>PGP::</code> Contient des modules pour l'adressage du programme PGP (<i>Pretty Good Privacy</i>).
</p>
</td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>15_World_Wide_Web_HTML_HTTP_CGI</code></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top"><p>Contient des modules pour les scripts CGI, les connexions HTTP et la cr&eacute;ation de HTML.</p>
<p>Quelques modules ou groupes de modules int&eacute;ressants de ce sous-r&eacute;pertoire sont:<br>
<code>Apache::</code> Contient des modules qui constituent pour la plupart des extensions pour le module <i>mod_perl</i> du serveur Web Apache. <i>mod_perl</i> est un interpr&eacute;teur Perl qui tourne &agrave; l'int&eacute;rieur d'un processus Apache et qui peut acc&eacute;l&eacute;rer fortement l'ex&eacute;cution des scripts Perl en relation avec CGI. La condition pr&eacute;alable pour les modules est une installation Apache avec le module <i>mod_perl</i>. Les modules offrent des fonctions pour l'authentification, l'acc&egrave;s aux fonctions d'identification (Logging) d'Apache, les r&eacute;-acheminements, les Server Side Includes, les informations sur l'&eacute;tat d'une connexion entre le serveur et le navigateur, l'acc&egrave;s aux informations recherch&eacute;es par Apache concernant le nombre d'octets transmis et d'acc&egrave;s aux fichiers etc...<br>
<code>CGI::</code> Contient des modules sp&eacute;ciaux pour les scripts CGI, qui d&eacute;passent ceux du module standard  CGI, par exemple des modules pour la sauvegarde temporaire de requ&ecirc;tes CGI dans un cache, pour g&eacute;n&eacute;rer du code HTML pour le navigateur, pour la gestion de graphiques compos&eacute;s de liens c&ocirc;t&eacute; serveur etc...<br>
<code>LWP::</code> Contient des modules pour la communication avec d'autres serveurs Web, par exemple pour lire des fichiers HTML situ&eacute;s sur d'autres serveurs.<br>
<code>MIME::</code> Contient des modules pour les types MIME. Y sont contenus par exemple des modules pour la transformation de texte 8 bits texte 7 bits en standard Base64 et pour l'analyse syntaxique de mentions MIME.<br>
<code>Netscape::</code> Contient des modules sp&eacute;cifiques &agrave; Netscape, par exemple pour analyser la m&eacute;moire cache ou l'historique sauvegard&eacute; du navigateur Netscape.<br>
<code>URI</code> S&eacute;pare les diff&eacute;rentes composantes d'une URI.<br>
<code>WWW::</code> Contient des modules pour un moteur de recherche simple et pour l'interactivit&eacute; entre le script Perl et les moteurs de recherche connus sur la toile.
</p>
</td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>16_Server_and_Daemon_Utilities</code></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top"><p>Contient des modules pour la programmation de son propre serveur.</p>
<p>Quelques modules ou groupes de modules int&eacute;ressants de ce sous-r&eacute;pertoire sont:<br>
<code>Event::</code> Contient des modules pour serveurs qui r&eacute;agissent &agrave; des &eacute;v&eacute;nements.<br>
<code>Netserver::</code> Contient des modules pour diff&eacute;rents serveurs par exemple pour HTTP et pour SMTP.
</p>
</td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>17_Archiving_and_Compression</code></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top"><p>Contient des modules pour l'archivage et la compression/ d&eacute;compression de fichiers dans et de formats de compression connus.</p>
<p>Quelques modules ou groupes de modules int&eacute;ressants de ce sous-r&eacute;pertoire sont:<br>
<code>Archive::Tar</code> peut lire et &eacute;crire des archives tar, comme elles sont habituelles sous Unix.<br>
<code>Compress::</code> Contient des modules pour diff&eacute;rents algorithmes de compression pour bzip, LZO et Zlib.<br>
<code>Convert::</code> Contient des modules de conversion par exemple pour les conversions de jeux de caract&egrave;res entre ASCII et EBCDIC, pour la conversion de nombres dans certaines formulations techniques, pour le d&eacute;codage de donn&eacute;es encod&eacute;es UU etc...</p>
</td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>18_Images_Pixmaps_Bitmaps</code></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top"><p>Contient des modules pour les formats d'image et de vid&eacute;o.</p>
<p>Quelques modules ou groupes de modules int&eacute;ressants de ce sous-r&eacute;pertoire sont:<br>
<code>Chart::</code> Contient des modules pour cr&eacute;er des lignes et des colonnes et la repr&eacute;sentation compl&egrave;te de graphiques et pour leur exportation dans un fichier GIF.<br>
<code>Image::</code> Contient des modules pour le t&eacute;l&eacute;chargement automatiques de graphiques sur le r&eacute;seau et pour la lecture de donn&eacute;es d'ent&ecirc;te importantes de formats graphiques comme  GIF, JPEG, PNG, TIFF, XPM, XBM, PGM et PBM, ainsi que pour l'application de filtres sur des graphiques en pixels par exemple pour la rotation automatique d'un graphique ou pour agrandir ou pour r&eacute;duire.<br>
<code>OpenGL</code> Permet l'acc&egrave;s &agrave; la biblioth&egrave;que OpenGL qui dispose de fonction pour les textures en trois dimensions, les projections etc...<br>
<code>VRML::</code> Contient des modules pour le code VRML.
</p>
</td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>19_Mail_and_Usenet_News</code></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top"><p>Contient des modules  pour les courriels et l'acc&egrave;s au serveur de nouvelles.</p>
<p>Quelques modules ou groupes de modules int&eacute;ressants de ce sous-r&eacute;pertoire sont:<br>
<code>Mail::</code> Contient des modules pour r&eacute;aliser un client courriel avec Perl, pour filtrer des courriels et pour envoyer des courriels par SMTP (fonction sendmail).<br>
<code>News::</code> Contient des modules pour rediriger des courriels &agrave; un groupe de nouvelles ou les rediriger des courriels sur une adresse &eacute;lectronique, pour r&eacute;aliser un client nouvelles avec Perl et pour cr&eacute;er des articles de nouvelles.
</p>
</td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>20_Control_Flow_Utilities</code></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top"><p>Contient des modules  pour le contr&ocirc;le du script en cours.</p>
<p>Quelques modules ou groupes de modules int&eacute;ressants de ce sous-r&eacute;pertoire sont:<br>
<code>AtExit</code> Dispose d'une fonction qui est automatiquement appel&eacute;e &agrave; la fin d'un script.<br>
<code>Memoize</code> Acc&eacute;l&egrave;re l'ex&eacute;cution de fonctions et peut sauvegarder dans un fichier des param&egrave;tres et les valeurs renvoy&eacute;es par une fonction.
</p>
</td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>21_File_Handle_Input_Output</code></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top"><p>Contient des modules  avec des fonctions d'entr&eacute;e et de sortie avec descripteurs.</p>
<p>Quelques modules ou groupes de modules int&eacute;ressants de ce sous-r&eacute;pertoire sont:<br>
<code>Expect</code> Dispose de fonctions pour contr&ocirc;ler des programmes orient&eacute;s sur le dialogue.<br>
<code>FileHandle::Multi</code> Peut &eacute;crire simultan&eacute;ment dans plusieurs canaux de sortie ou fichiers.<br>
<code>IO::</code> Contient outre les modules standard IO, des modules suppl&eacute;mentaires, par exemple pour relier des cha&icirc;nes de caract&egrave;res &agrave; des descripteurs ou pour fixer les param&egrave;tres de terminal  stty.<br>
<code>Log::</code> Contient des modules  pour lire et &eacute;crire de et dans des fichiers Log. Il est ainsi possible par exemple d'&eacute;crire des &eacute;l&eacute;ments dans les fichiers Log du serveur Web ou dans des fichiers Log d&eacute;finis soi-m&ecirc;me.
</p>
</td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>22_Microsoft_Windows_Modules</code></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top"><p>Contient des modules pour les syst&egrave;mes MS-Windows &agrave; partir de Windows 95.</p>
<p>Quelques modules ou groupes de modules int&eacute;ressants de ce sous-r&eacute;pertoire sont:<br>
<code>Win32::</code> Contient des modules  pour des fonctions r&eacute;seau sp&eacute;cifiques &agrave; Windows, pour serveur RAS, liaisons OLE etc...<br>
<code>Win32API::</code> Contient des modules  pour l'acc&egrave;s au registre, l'acc&egrave;s aux ports s&eacute;riels sous Windows et pour la gestion de fichiers et d'unit&eacute;s sous Windows.
</p>
</td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>23_Miscellaneous_Modules</code></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top"><p>Contient des modules  pour des t&acirc;ches diverses qui ne peuvent &ecirc;tre class&eacute;es ailleurs. La malle au tr&eacute;sor en quelque sorte!</p>
<p>Quelques modules ou groupes de modules int&eacute;ressants de ce sous-r&eacute;pertoire sont:<br>
<code>Agent::</code> Contient des modules  &agrave; l'aide duquel il est possible de r&eacute;aliser avec Perl un assistant logiciel intelligent qui m&egrave;ne &agrave; bien de fa&ccedil;on autonome certaines actions, filtre des donn&eacute;es etc...<br>
<code>Archie::</code> Contient des modules  pour questionner un serveur Archie.<br>
<code>Audio::</code> Contient des modules  pour traiter des fichiers audio par exemple des fichiers WAV.<br>
<code>Business::</code> Contient des modules  pour les &eacute;changes commerciaux, par exemple pour ce qui concerne les cartes de cr&eacute;dit.<br>
<code>Games::</code> Contient des modules  pour les jeux, par exemple pour les &eacute;checs.<br>
<code>MIDI::</code> Contient des modules  pour la cr&eacute;ation et le traitement de fichiers MIDI &agrave; l'aide de Perl.<br>
<code>Watchdog:</code> Contient des modules  pour v&eacute;rifier si le serveur Web ou le serveur de bases de donn&eacute;es MySQL tournent encore.
</p>
</td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>24_Commercial_Software_Interfaces</code></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top"><p>Contient des modules  pour la communication entre des programmes Perlet les produits logiciels commerciaux.</p>
<p>Quelques modules ou groupes de modules int&eacute;ressants de ce sous-r&eacute;pertoire sont:<br>
<code>AltaVista::</code> Contient des modules  pour l'acc&egrave;s au moteur de recherche de Altavista.<br>
<code>R3::</code> Contient des modules  pour l'acc&egrave;s aux fonctions du RFCSDK (jeu de d&eacute;veloppement logiciel de SAP-R3).<br>
<code>Real::</code> Contient des modules  pour l'acc&egrave;s aux flux de donn&eacute;es  RealMedia (RealAudio, RealVideo).
</p>
</td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>99_Not_In_Modulelist</code></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top"><p>Contient des modules , qui ne sont pas contenus dans la liste officielle des modules du r&eacute;pertoires CPAN.</p>
</td>
</tr>
</table>
</td></tr></table>
<br>&nbsp;





<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="telecharger_installer">T&eacute;l&eacute;charger et installer les modules du r&eacute;pertoire  CPAN</a></h2>

<p>Les r&eacute;pertoires avec des modules contiennent chacun et pour chaque module un fichier avec l'extension  <var>.readme</var> et un fichier avec l'extension <var>.tar.gz</var>. Le fichier readme est un fichier texte dont vous pouvez tirer au pr&eacute;alable des  d&eacute;tails concernant le fichier. Le fichier <var>tar.gz</var> est un fichier compress&eacute; tar d'apr&egrave;s le proc&eacute;d&eacute; GNU-Zip, donc un fichier archive. <var>GZip</var> et <var>tar</var> sont des outils typiques du monde Unix. Pour d&eacute;compresser les fichiers sous d'autres syst&egrave;mes d'exploitation, par exemple sous Windows, vous avez besoin d'un programme de d&eacute;compression pour fichiers <var>gzip</var>. Dans l'index des liens de l'offre en ligne de SELFHTML actuel, vous trouverez un r&eacute;capitulatif des produits avec des liens aux fournisseurs de ces programmes:</p>

<p><img src="../../src/serverdoc.gif" width="15" height="10" border="0" alt="Page d'information: connexion exig&eacute;e">&nbsp;<a target="_top" href="http://www.selfhtml.com.fr/liens/programmes_compression.htm"><b>SELFHTML Index des liens: Programmes de compression et de d&eacute;compression</b></a></p>

<p>Sur les syst&egrave;mes Unix, vous pouvez d&eacute;compresser un fichier archive compress&eacute; (dans l'exemple ci-apr&egrave;s le fichier <var>Algorithm-SISort-0.10.tar.gz</var>) avec la commande suivante:</p>

<p><kbd>tar -zxf Algorithm-SISort-0.10.tar.gz</kbd></p>

<p>Au cas o&ugrave; elle ne fonctionne pas, la commande ci apr&egrave;s doit fonctionner:</p>

<p><kbd>gzip -cd Algorithm-SISort-0.10.tar.gz | tar -xf -</kbd></p>

<p>Ensuite, les fichiers d&eacute;compress&eacute;s se trouvent dans un sous-r&eacute;pertoire du m&ecirc;me nom que le module, dans l'exemple donc dans un r&eacute;pertoire nomm&eacute; <var>Algorithm-SISort-0.10</var> par exemple.</p>

<p>Quand vous ne voulez pas installer le module sur votre propre ordinateur mais sur un ordinateur sur Internet ou vous louez un emplacement, vous avez besoin d'un acc&egrave;s Telnet ou d'un acc&egrave;s SSH &agrave; cet ordinateur pour pouvoir installer le module. Par ailleurs, vous avez besoin des droits pour pouvoir copier les fichiers dans les r&eacute;pertoires de modules de Perl. Renseignez vous &agrave; ce sujet le cas &eacute;ch&eacute;ant aupr&egrave;s de votre fournisseur d'acc&egrave;s! S'il s'agit pour l'ordinateur serveur d'un ordinateur avec syst&egrave;me Unix, vous pouvez dans un premier temps t&eacute;l&eacute;charger  sur votre ordinateur le fichier <var>tar.gz</var> du module puis le transmettre &agrave; votre ordinateur serveur et le d&eacute;compresser l&agrave; avec les commandes ci-dessus sur la console que vous recevez lors d'un acc&egrave;s par Telnet ou SSH.</p>

<p>Apr&egrave;s avoir d&eacute;compress&eacute; le fichier du module <var>tar.gz</var>, le module doit &ecirc;tre install&eacute;. Passez pour cela dans le r&eacute;pertoire des fichiers d&eacute;compress&eacute;s. La plupart du temps, vous y trouvez un fichier nomm&eacute; <var>README</var> ou <var>INSTALL</var>, dans lequel figure entre autres des informations sur l'installation du module.</p>

<p>Sous  <b>Unix</b> vous devez entrer sur la console les commandes suivantes:</p>

<p><kbd>perl Makefile.PL</kbd></p>

<p>Avec cette commande un fichier contenant les informations d'installation est cr&eacute;&eacute;. Vous devez &eacute;ventuellement &agrave; l'appel de <kbd>perl</kbd> mentionner le chemin du fichier ex&eacute;cutable de l'interpr&eacute;teur Perl.</p>

<p><kbd>make</kbd></p>

<p>Avec cette commande, l'installation est pr&eacute;par&eacute;e.</p>

<p><kbd>make test</kbd></p>

<p>Avec cette commande, la pr&eacute;paration de l'installation est test&eacute;e.</p>

<p><kbd>make install</kbd></p>

<p>Avec cette commande, l'installation est ex&eacute;cut&eacute;e.</p>

<p>Ex&eacute;cutez toujours imp&eacute;rativement ces quatre commandes dans l'ordre, quand vous installez un module! Le module est alors install&eacute; dans un r&eacute;pertoire. De plus amples informations sur la mani&egrave;re d'utiliser le module, peuvent &ecirc;tre trouv&eacute;es dans le fichier qui devrait exister <var>README</var> ou <var>INSTALL</var>.</p>

<p>Sous d'autres syst&egrave;mes comme <b>MS Windows</b>, o&ugrave; vous avez normalement acc&egrave;s &agrave; tous les r&eacute;pertoires de l'ordinateur, copiez simplement le contenu du sous-r&eacute;pertoire <var>lib</var>, qui devrait exister apr&egrave;s avoir d&eacute;compress&eacute;, sous le r&eacute;pertoire d'installation de Perl, dans la mesure o&ugrave; il s'agit d'un pur module Perl. Si le module travaille avec des extensions C, vous avez besoin d'un compilateur C ou bien vous utilisez l'utilitaire <var>ppm</var>, livr&eacute; avec ActivePerl-Distribution   pour installer une version du module d&eacute;j&agrave; compil&eacute;e.</p>


<h3 class="inf">Attention:</h3>

<p>Au cas o&ugrave; il ne vous est pas possible faute d'habilitation, d'installer sur l'ordinateur serveur les modules du r&eacute;pertoire CPAN dans le r&eacute;pertoires des modules de Perl, Vous pouvez les installer dans un r&eacute;pertoire de votre choix. Donc dans un r&eacute;pertoire o&ugrave; vous avez vous m&ecirc;me acc&egrave;s. Sans console comme elle est disponible avec  Telnet ou SSH , vous ne vous en sortirez toutefois pas.</p>

<p>Cr&eacute;ez d'abord pour cela le r&eacute;pertoire avec le nom d&eacute;sir&eacute; &agrave; l'endroit d&eacute;sir&eacute; de votre arborescence. Assurez vous ensuite que vous vous trouvez bien dans le r&eacute;pertoire du module &agrave; d&eacute;compresser. Entrez ensuite et dans l'ordre les commandes suivantes:</p>

<p>
<kbd>
perl Makefile.PL LIB=[chemin au r&eacute;pertoire]<br>
make<br>
make test<br>
make install</kbd>
</p>

<p>Pour <code>[chemin au r&eacute;pertoire]</code> vous devez adresser correctement le r&eacute;pertoire cr&eacute;&eacute; auparavant. Supposons que vous ayez d&eacute;compress&eacute; les fichiers modules, consid&eacute;r&eacute; &agrave; partir du r&eacute;pertoire de d&eacute;part de votre page d'accueil, dans <var>tmp/Algorithm-SISort-0.10</var>, et que le module doit &ecirc;tre install&eacute; dans  <var>cgi-bin/perlmodules/Algorithm-SISort-0.10</var>. Alors vous devez entrer, quand vous vous trouvez dans le r&eacute;pertoire <var>tmp/Algorithm-SISort-0.10</var>:<br>
<code>perl Makefile.PL LIB=../../cgi-bin/perlmodules/Algorithm-SISort-0.10</code></p>



<table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr><td colspan="2" bgcolor="#EEEEEE" class="doc">
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a>
</td></tr>
<tr><td bgcolor="#EEEEEE" class="doc" align="right"><a href="cgi.htm"><img src="../../src/suivant.gif" width="10" height="10" border="0" hspace="10" alt="page suivante"></a></td>
<td bgcolor="#FFFFFF"><img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information"> <a href="cgi.htm"><b>Module CGI: Fonctions pour la programmation CGI</b></a>
</td></tr>
<tr>
<td bgcolor="#EEEEEE" class="doc" align="right"><a href="modulesstandard.htm"><img src="../../src/precedent.gif" width="10" height="10" border="0" hspace="10" alt="page pr&eacute;c&eacute;dente"></a></td>
<td bgcolor="#FFFFFF" width="100%"><img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information"> <a href="modulesstandard.htm"><b>Modules standard de Perl</b></a>
</td>
</tr>
<tr><td colspan="2" bgcolor="#EEEEEE" class="doc">&#160;</td></tr>
</table><table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr>
<td bgcolor="#FFEEDD" class="nav"><a class="an" name="bottom"><img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"></a> <a href="../../index.htm"><b>SELFHTML</b></a>/<a href="../../navigation/index.htm" target="_parent">Aides &agrave; la navigation</a> <img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="../index.htm"><b>CGI/Perl</b></a> <img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="index.htm"><b>Modules Perl</b></a></td>
</tr>
</table>

<p>&copy; 2001 Stefan M&uuml;nz / &copy; 2003 Traduction <img src="../../src/courriel.gif" width="15" height="10" border="0" alt="Adresse &eacute;lectronique">&nbsp;<a href="mailto:13405@free.fr">Serge Fran&ccedil;ois, 13405@free.fr</a><br><img src="../../src/courriel.gif" width="15" height="10" border="0" alt="Adresse &eacute;lectronique">&nbsp;<a href="mailto:selfhtml@selfhtml.com.fr">selfhtml@selfhtml.com.fr</a></p>


</body>
</html>
