<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>SELFHTML: HTML/XHTML / R&egrave;gles g&eacute;n&eacute;rales pour HTML / Ossature d'un fichier HTML</title>
<link rel="stylesheet" type="text/css" href="../../src/selfhtml.css">
<meta name="description"    content="Quels &eacute;l&eacute;ments doit contenir tout fichier HTML.">
<meta name="keywords"       content="SELFHTML, HTML, ossature, &lt;html&gt;, &lt;head&gt;, &lt;title&gt;, &lt;body&gt; DOCTYPE, type de document, Strict, Transitional, jeu de cadres, Frameset, HTML Strict, HTML Transitional, HTML Frameset, XHTML">
<meta name="author"         content="Stefan M&uuml;nz, selfhtml@teamone.de">
<meta http-equiv="content-type" content="text/html; charset=ISO-8859-1">
<meta name="DC.Publisher"   content="Serge Fran&ccedil;ois, selfhtml@selfhtml.com.fr">
<meta name="DC.Date"        content="2003-01-27T08:00+00:00">
<meta name="DC.Identifier"  content="http://selfhtml.selfhtml.com.fr/html/generalites/ossature.htm">
<meta name="DC.Language"    content="fr">
<meta name="DC.Rights"      content="../../editorial/copyright.htm">
<meta name="DC.Date.Create" content="2003-01-27T08:00+00:00">
<meta name="SELF.Version"   content="1">
<meta name="SELF.Pagetype"  content="Information">
<meta name="SELF.Path"      content="SELFHTML == ../../index.htm // HTML/XHTML == ../index.htm // R&egrave;gles g&eacute;n&eacute;rales pour HTML == index.htm">
<link rel="stylesheet" type="text/css" href="../../src/selfhtml.css">
<!-- Matomo -->
<script type="text/javascript">
  var _paq = window._paq = window._paq || [];
  /* tracker methods like "setCustomDimension" should be called before "trackPageView" */
  _paq.push(['trackPageView']);
  _paq.push(['enableLinkTracking']);
  (function() {
    var u="//matomo.boitasite.com/";
    _paq.push(['setTrackerUrl', u+'matomo.php']);
    _paq.push(['setSiteId', '1']);
    var d=document, g=d.createElement('script'), s=d.getElementsByTagName('script')[0];
    g.type='text/javascript'; g.async=true; g.src=u+'matomo.js'; s.parentNode.insertBefore(g,s);
  })();
</script>
<!-- End Matomo Code -->
</head>

<body bgcolor="#FFFFFF" text="#000000" link="#AA5522" vlink="#772200" alink="#000000">

<table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr><td bgcolor="#FFEEDD" class="nav"><a class="an" name="top"><img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"></a> <a href="../../index.htm"><b>SELFHTML</b></a>/<a href="../../navigation/index.htm" target="_parent">Aides &agrave; la navigation</a> <img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="../index.htm"><b>HTML/XHML</b></a> <img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="index.htm"><b>R&egrave;gles g&eacute;n&eacute;rales pour HTML</b></a></td>
</tr></table>

<table cellpadding="4" cellspacing="0" border="0" width="100%">

<tr>
<td bgcolor="#EEEEEE" class="doc" width="110"><img src="../../src/logo.gif" width="106" height="109" border="0" alt="SELFHTML"></td>
<td bgcolor="#EEEEEE" class="doc" valign="bottom" width="100%"><h2>Ossature d'un fichier HTML</h2></td>
</tr>

<tr>
<td bgcolor="#EEEEEE" class="doc" valign="top" align="center">
<img src="../../src/docx.gif" width="30" height="20" vspace="6" border="0" alt="Page d'information: vue d'ensemble">
</td>

<td bgcolor="#FFFFFF" valign="top" nowrap>
<p>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#html"><b>Ossature d'un fichier HTML</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#xhtml"><b>Ossature d'un fichier XHTML</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#type_document"><b>Mentions du type de document</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#remarque"><b>Remarques pour la pratique</b></a><br>
</p>
</td>
</tr>

<tr><td colspan="2" bgcolor="#EEEEEE" class="doc">&#160;<a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&nbsp;</td></tr>
</table>

<h2 class="Sh2"><a class="an" name="html">Ossature d'un fichier HTML</a></h2>

<p>Un fichier HTML traditionnel comprend essentiellement les parties suivantes:</p>
<ul>
<li>Mention du type de document (mention de la version HTML utilis&eacute;e)</li>
<li>Header (ent&ecirc;te  par exemple mentions du titre ou similaires)</li>
<li>Body (corps - contenu &agrave; afficher donc texte avec des titres, des liens, des r&eacute;f&eacute;rences de graphique etc.)</li>
</ul>

<h3 class="xmp">Sch&eacute;ma de l'ossature d'un fichier HTML:</h3>

<table width="100%" cellpadding="10"><tr><td class="xmpcode" bgcolor="#FFFFE0"><pre>
&lt;!DOCTYPE HTML PUBLIC &quot;-//W3C//DTD HTML 4.01 Transitional//EN&quot;
       &quot;http://www.w3.org/TR/html4/transitional.dtd&quot;&gt;
&lt;html&gt;
&lt;head&gt;
&lt;title&gt;Texte du titre&lt;/title&gt;
&lt;/head&gt;
&lt;body&gt;

&lt;/body&gt;
&lt;/html&gt;
</pre></td></tr></table>

<h3 class="xpl">Explication:</h3>

<p>Au premier abord, la premi&egrave;re ligne peut para&icirc;tre d&eacute;concertante pour les d&eacute;butants. Cette mention un peu compliqu&eacute;e est une mention de type de document. Plus de d&eacute;tails &agrave; ce sujet ci-dessous <img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#type_document"><b>Mentions du type de document</b></a>.</p>

<p>Le reste de tout le fichier HTML est ins&eacute;r&eacute; dans les rep&egrave;res <code>&lt;html&gt;</code>
ou <code>&lt;/html&gt;</code>. L'&eacute;l&eacute;ment <code>html</code> est &eacute;galement d&eacute;sign&eacute; comme <b>&eacute;l&eacute;ment racine</b> d'un fichier HTML. Derri&egrave;re le rep&egrave;re d'ouverture HTML suit le rep&egrave;re d'ouverture pour l'ent&ecirc;te <code>&lt;head&gt;</code>. Entre ce rep&egrave;re et son rep&egrave;re correspondant <code>&lt;/head&gt;</code> sont not&eacute;es les <img src="../../src/chap.gif" width="15" height="13" border="0" alt="Chapitre: vue d'ensemble">&nbsp;<a href="../entete/index.htm"><b>Mentions d'ent&ecirc;te d'un fichier HTML</b></a>. La plus importante de ces donn&eacute;es est le <img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="../entete/titre.htm"><b>Titre du
fichier HTML</b></a>, d&eacute;limit&eacute par les rep&egrave;res <code>&lt;title&gt;</code> ou <code>&lt;/title&gt;</code>. Sous  le titre suit le corps du texte marqu&eacute par les rep&egrave;res <code>&lt;body&gt;</code> ou <code>&lt;/body&gt;</code>. Dans le corps du texte sera not&eacute le contenu proprement dit du fichier, &agrave savoir ce qui doit &ecirc;tre montr&eacute dans la fen&ecirc;tre d'affichage du navigateur WWW.</p>

<h3 class="inf">Attention:</h3>

<p>Quand vous voulez mettre des <img src="../../src/chap.gif" width="15" height="13" border="0" alt="Chapitre: vue d'ensemble">&nbsp;<a href="../frames/index.htm"><b>cadres</b></a> en &#339;uvre (plusieurs fen&ecirc;tres d'affichage), l'ossature de fichiers dans lesquels un jeu de cadres est d&eacute;fini est diff&eacute;rente. Cela est expliqu&eacute; dans la partie <img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="../frames/definir.htm#ossature"><b>Ossature d'un fichier HTML avec jeu de cadres </b></a>. Ne vous attaquez aux cadres que lorsque les bases de HTML vous seront d&eacute;j&agrave; un peu plus famili&egrave;res.</p>



<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&nbsp;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="xhtml">Ossature d'un fichier XHTML</a></h2>

<p>Si vous voulez &eacute;crire du HTML conforme pour XHTML, l'ossature est similaire, seul le d&eacute;but diff&egrave;re un peu.</p>

<h3 class="xmp">Sch&eacute;ma:</h3>

<table width="100%" cellpadding="10"><tr><td class="xmpcode" bgcolor="#FFFFE0"><pre>
&lt;?xml version=&quot;1.0&quot;?&gt;
&lt;!DOCTYPE html PUBLIC &quot;-//W3C//DTD XHTML 1.0 Transitional//EN&quot;
    &quot;http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd&quot;&gt;
&lt;html xmlns=&quot;http://www.w3.org/1999/xhtml&quot;&gt;
&lt;head&gt;
&lt;title&gt;Texte du titre&lt;/title&gt;
&lt;/head&gt;
&lt;body&gt;

&lt;/body&gt;
&lt;/html&gt;
</pre></td></tr></table>

<h3 class="xpl">Explication:</h3>

<p>Avant m&ecirc;me la mention de type de fichier, il faut pour les fichiers XHTML faire r&eacute;f&eacute;rence &agrave; XML. C'est &agrave; cela que sert la premi&egrave;re ligne avec le point d'interrogation derri&egrave;re la parenth&egrave;se pointue d'ouverture et devant la parenth&egrave;se pointue de fermeture. Notez cette ligne telle qu'elle figure dans l'exemple. Il s'agit de ce qu'on appelle une <b>d&eacute;claration XML</b>.</p>

<p>Pour la mention de type de document, il faut mentionner un type de document valide pour XHTML. Pour des d&eacute;tails &agrave; ce sujet, voir ci-dessous dans la partie <img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#type_document"><b>Mentions du type de document</b></a>.</p>

<p>Dans le rep&egrave;re d'ouverture <code>&lt;html&gt;</code> il faut mentionner l'espace XML utilis&eacute; avec l'attribut <code>xmlns=</code>. Employez la mention telle qu'elle figure dans l'exemple ci-dessus.</p>

<p>Ainsi, le fichier est d&eacute;clar&eacute; en tant que fichier XHTML. Le texte source qui suit est du HTML normal. Vous devez toutefois veiller dans ce cas aux <img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="../xhtml/differences.htm"><b>Diff&eacute;rences entre  XHTML et HTML</b></a>. Ne vous attaquez &agrave; ces diff&eacute;rences que lorsque les bases de HTML vous seront d&eacute;j&agrave; un peu plus famili&egrave;res.</p>




<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&nbsp;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="type_document">Mentions du type de document</a></h2>

<p>HTML n'est dans la famille des langages de marquage qu'un langage parmi beaucoup d'autres, m&ecirc;me si c'est le plus c&eacute;l&egrave;bre. HTML lui m&ecirc;me a en outre une histoire de plusieurs ann&eacute;es et a &eacute;t&eacute; norm&eacute; dans diverses versions quelquefois tr&egrave;s diff&eacute;rentes. Avec la mention du type de document, vous d&eacute;terminez quel langage de marquage, et quelle version vous utilisez. Un logiciel de lecture, par exemple un navigateur Web peut s'orienter gr&acirc;ce &agrave; cette mention.</p>

<p>Les r&egrave;gles pour HTML sont formul&eacute;es &agrave; l'aide de SGML, les r&egrave;gles pour XHTML &agrave; l'aide de XML. D'apr&egrave;s les r&egrave;gles des langages de marquage bas&eacute;s sur SGML ou XML, un fichier HTML n'est <b>valide</b> que s'il mentionne un certain type de document pour s'en tenir ensuite dans le reste du code-source aux r&egrave;gles qui sont d&eacute;finies pour ce type de document. Car derri&egrave;re chaque mention de type de document il y a ce qu'on appelle des <b>d&eacute;finitions de type de document</b> (<b>DTD</b>). M&ecirc;me pour HTML il existe de telles d&eacute;finitions de type de document. Y sont fix&eacute;s les &eacute;l&eacute;ments que peut contenir un document du type HTML, quels &eacute;l&eacute;ments peuvent figurer dans quels autres, quels attributs s'appliquent &agrave; un &eacute;l&eacute;ment, si la mention de ces attributs est facultative ou obligatoire etc.</p>

<p>En tant que d&eacute;butant, il est possible que tout le travail qui est fait ne vous saute pas aux yeux. Pourtant, pr&eacute;cis&eacute;ment ces types de documents &agrave; l'aide desquels les r&egrave;gles de langages tels que HTML peuvent &ecirc;tre exactement d&eacute;finies sont un &eacute;norme progr&egrave;s dans l'informatique. Car ce n'est qu'ainsi que peut s'imposer vraiment le concept de formats de fichier ind&eacute;pendant de tout logiciel, mais conformes &agrave; des r&egrave;gles. Sans la r&eacute;f&eacute;rence aux r&egrave;gles officielles, les langages comme HTML seraient des conventions qui ne forcent pas l'adh&eacute;sion qui se dilueraient vite en dialectes. C'est exactement comme pour les langues normales: sans une certaine r&eacute;glementation de l' &quot;orthographe&quot; une langue &eacute;crite se d&eacute;graderait si fortement au fil du temps qu'&agrave; la fin personne ou presque ne pourrait lire ce qu'un autre a voulu dire dans ses &eacute;crits. &Eacute;tant donn&eacute; que les logiciels sont d'ailleurs beaucoup plus b&ecirc;tes que les humains et ont besoin de r&egrave;gles beaucoup plus pr&eacute;cises pour &quot;comprendre&quot; ce qu'on leur dit, la r&eacute;f&eacute;rence &agrave; des r&egrave;gles y est m&ecirc;me encore beaucoup plus importante.</p>

<h3 class="xmp">Exemple d'une mention de type de document:</h3>

<table width="100%" cellpadding="10"><tr><td class="xmpcode" bgcolor="#FFFFE0"><pre>
&lt;!DOCTYPE HTML PUBLIC &quot;-//W3C//DTD HTML 4.01 Transitional//EN&quot;
        &quot;http://www.w3.org/TR/html4/loose.dtd&quot;&gt;
</pre></td></tr></table>

<h3 class="xpl">Explication:</h3>

<p>Notez la mention du type de document au d&eacute;but d'un fichier HTML avant le rep&egrave;re d'ouverture <code>&lt;html&gt;</code>. Derri&egrave;re la parenth&egrave;se pointue d'ouverture suit un point d'exclamation, suivi de la mention <code>DOCTYPE HTML PUBLIC</code>. Cela signifie, que vous vous r&eacute;f&eacute;rez au DTD HTML disponible publiquement. La mention suivante qui est plac&eacute;e entre guillemets est &agrave; comprendre ainsi:</p>

<p><code>W3C</code> est l'&eacute;diteur du DTD, donc le consortium W3. Une mention telle que <code>DTD HTML 4.01 Transitional</code> signifie que vous utilisez le type de document &quot;HTML&quot; et cela dans la version du langage 4.01 et sa variante &quot;Transitional&quot;. Le terme <code>EN</code> est une abr&eacute;viation pour la langue qui veut dire ici l'anglais (english). La mention se r&eacute;f&egrave;re &agrave; la langue parl&eacute;e dans laquelle les noms d'&eacute;l&eacute;ments et d'attributs du langage de rep&egrave;res ont &eacute;t&eacute; d&eacute;finis et non pas au contenu de votre fichier. Utilisez donc toujours <code>EN</code>, &eacute;tant donn&eacute; que les noms d'&eacute;l&eacute;ments et d'attributs HTML sont bas&eacute;s sur la langue anglaise.<br>
Notez les barres obliques comme dans l'exemple ci-dessus.</p>

<p>De plus la mention de type de document contient une adresse Web. La mention de cette adresse n'est pas absolument n&eacute;cessaire. Une mention telle que:<br>
<code>&lt;!DOCTYPE HTML PUBLIC &quot;-//W3C//DTD HTML 4.01 Transitional//EN&quot;&gt;</code><br>
est donc &eacute;galement permise.<br>
Par l'adresse Web mentionn&eacute;e, un logiciel de lecture  peut appeler la d&eacute;finition du type de document (DTD) pour y &quot;consulter&quot; les r&egrave;gles qui y sont not&eacute;es. Toutefois la plupart des navigateurs actuels ne le font pas pour HTML parce qu'ils doivent compter avec les d&eacute;formations du langage les plus graves pour beaucoup de pages Web et qu'ils sacrifient la capacit&eacute; d'afficher convenablement &agrave; l'&eacute;cran du HTML m&ecirc;me non-conforme aux r&egrave;gles au profit de l' &quot;enseignement pur&quot;. La conduite en fait souhait&eacute;e est pourtant, qu'un navigateur qui lit un fichier HTML contenant une mention de type de document, veille &agrave; l'observation des r&egrave;gles de ce type de document. Pour les documents XML il est tout &agrave; fait courant qu'un <img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="../generalites/marquertexte.htm#html_parser"><b>analyseur syntaxique</b></a> s'interrompe en cas d'infraction aux r&egrave;gles - &agrave; la place de la page Web appara&icirc;t alors un message d'erreur laconique qui annonce le document comme n'&eacute;tant pas valide.</p>

<p>&Agrave; la cl&ocirc;ture de la r&eacute;daction de ce document, c'est la version 4.01 qui est actuelle. Pour cette version HTML et m&ecirc;me pour la version 4.0 il y a trois variantes du langage. Vous devez opter pour l'une d'entre elles et mentionner le type de document correspondant:</p>

<h3>La variante &quot;Strict&quot; pour HTML:</h3>

<table width="100%" cellpadding="10"><tr><td class="xmpcode" bgcolor="#FFFFE0"><pre>
&lt;!DOCTYPE HTML PUBLIC &quot;-//W3C//DTD HTML 4.01//EN&quot;
        &quot;http://www.w3.org/TR/html4/strict.dtd&quot;&gt;
</pre></td></tr></table>

<p>Utilisez cette mention lorsque vous ne voulez plus utiliser certains &eacute;l&eacute;ments et attributs qui faisaient partie dans le temps du standard HTML mais qui entre-temps peuvent &ecirc;tre remplac&eacute;s par d'autres possibilit&eacute;s (avant tout par les <img src="../../src/chap.gif" width="15" height="13" border="0" alt="Chapitre: vue d'ensemble">&nbsp;<a href="../../css/index.htm"><b>feuilles de style en cascade</b></a>)
et qui pour cette raison ne font plus partie du HTML &quot;ch&acirc;ti&eacute;&quot;. De plus, les r&egrave;gles d'imbrication pour les &eacute;l&eacute;ments HTML dans la variante &quot;strict&quot; sont plus restrictives et formul&eacute;es plus proprement dans le sens de contenus  structur&eacute;s. Ainsi par exemple, n'est il pas permis dans cette variante de noter simplement du texte entre les rep&egrave;res <code>&lt;body&gt;</code> et <code>&lt;/body&gt;</code>. Tous les contenus doivent figurer dans des blocs d'&eacute;l&eacute;ments, par exemple en titres, en paragraphes de texte, en tableaux etc.</p>

<h3>La variante &quot;Transitional&quot; pour HTML:</h3>

<table width="100%" cellpadding="10"><tr><td class="xmpcode" bgcolor="#FFFFE0">
<pre>&lt;!DOCTYPE HTML PUBLIC &quot;-//W3C//DTD HTML 4.01 Transitional//EN&quot;
          &quot;http://www.w3.org/TR/html4/loose.dtd&quot;&gt;
</pre>
</td></tr></table>

<p>Utilisez cette mention lorsque vous voulez encore utiliser certains &eacute;l&eacute;ments et attributs qui faisaient partie dans le temps du standard  HTML. Une raison de se d&eacute;cider pour cette variante peut &ecirc;tre que vous voulez &eacute;crire votre HTML de telle fa&ccedil;on qu'il rende &eacute;galement l'effet d&eacute;sir&eacute; avec des Netscape 3.x et d'autres navigateurs plus anciens qui n'interpr&eacute;taient pas encore les feuilles de style. Car dans la variante &quot;strict&quot; sont exclus pratiquement tous les &eacute;l&eacute;ments et attributs qui garantissaient autrefois l' &quot;effet optique&quot; dans les pages Web. En font partie les mentions pour l'alignement du texte, sur les couleurs d'arri&egrave;re-plan etc. Vous pouvez maintenant d&eacute;finir tout cela avec des feuilles de style, mais les navigateurs plus anciens n'interpr&egrave;tent encore aucune feuille de style. Dans la variante &quot;transitional&quot; les r&egrave;gles d'imbrication sont &eacute;galement un peu plus souples. Ainsi est-il permis d'apr&egrave;s cette variante de noter entre les rep&egrave;res <code>&lt;body&gt;</code> et <code>&lt;body&gt;</code> du &quot;simple texte&quot; &agrave; l'exclusion de tout autre &eacute;l&eacute;ment.</p>

<h3>La variante &quot;Frameset&quot; :pour HTML</h3>

<table width="100%" cellpadding="10"><tr><td class="xmpcode" bgcolor="#FFFFE0"><pre>
&lt;!DOCTYPE HTML PUBLIC &quot;-//W3C//DTD HTML 4.01 Frameset//EN&quot;
        &quot;http://www.w3.org/TR/html4/frameset.dtd&quot;&gt;
</pre></td></tr></table>

<p>Cette mention n'est con&ccedil;ue que pour des fichiers HTML sp&eacute;ciaux dans lesquels des jeux de cadres sont d&eacute;finis. Voyez &agrave; ce sujet la partie sur <img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="../frames/definir.htm"><b>d&eacute;finir des cadres et jeux de cadres</b></a>.</p>

<h3>Mentions correspondantes de type de document pour XHTML:</h3>

<table width="100%" cellpadding="10"><tr><td class="xmpcode" bgcolor="#FFFFE0"><pre>
&lt;!DOCTYPE html PUBLIC &quot;-//W3C//DTD XHTML 1.0 Strict//EN&quot;
     &quot;http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd&quot;&gt;
</pre></td></tr></table><table width="100%" cellpadding="10"><tr><td class="xmpcode" bgcolor="#FFFFE0"><pre>
&lt;!DOCTYPE html PUBLIC &quot;-//W3C//DTD XHTML 1.0 Transitional//EN&quot;
     &quot;http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd&quot;&gt;
</pre></td></tr></table><table width="100%" cellpadding="10"><tr><td class="xmpcode" bgcolor="#FFFFE0"><pre>
&lt;!DOCTYPE html PUBLIC &quot;-//W3C//DTD XHTML 1.0 Frameset//EN&quot;
     &quot;http://www.w3.org/TR/xhtml1/DTD/xhtml1-frameset.dtd&quot;&gt;
</pre></td></tr></table>

<p>M&ecirc;me pour XHTML 1.0 existent les trois variantes &quot;Strict&quot;, &quot;Transitional&quot; et &quot;Frameset&quot;. Dans la partie centrale de la mention de type du document il faut pourtant noter pour la version 1.0 de XHTML <code>XHTML 1.0</code>. Les adresses Web pour la r&eacute;f&eacute;rence sont elles aussi diff&eacute;rentes de celles de HTML.</p>

<p>Il y a aussi une version du langage 1.1 de XHTML qui est organis&eacute;e diff&eacute;remment en interne de XHTML 1.0. En  XHTML 1.1 n'existe aucune autre variante de langage. XHTML 1.1 ne correspond plus qu'&agrave; la variante &quot;Strict&quot; de XHTML 1.0.</p>

<h3>Mentions de types de document pour  XHTML 1.1:</h3>

<table width="100%" cellpadding="10"><tr><td class="xmpcode" bgcolor="#FFFFE0"><pre>
&lt;!DOCTYPE html PUBLIC &quot;-//W3C//DTD XHTML 1.1//EN&quot;
    &quot;http://www.w3.org/TR/xhtml11/DTD/xhtml11.dtd&quot;&gt;
</pre></td></tr></table>



<h3>Mentions de types de document plus anciennes:</h3>

<p>Dans certains cas exceptionnels, il peut s'av&eacute;rer judicieux de se r&eacute;f&eacute;rer &agrave; une version HTML plus ancienne. Ne le faites pourtant que si des raisons techniques quelconques l'exigent. Il existe les mentions plus anciennes suivantes:</p>

<table width="100%" cellpadding="10"><tr><td class="xmpcode" bgcolor="#FFFFE0"><pre>
&lt;!DOCTYPE HTML PUBLIC &quot;-//W3C//DTD HTML 2.0//EN&quot;&gt;
</pre></td></tr></table>

<p>Utilisez cette mention de type de document quand vous voulez vous r&eacute;f&eacute;rer &agrave; HTML 2.0.</p>


<table width="100%" cellpadding="10"><tr><td class="xmpcode" bgcolor="#FFFFE0"><pre>
&lt;HTML PUBLIC &quot;-//W3C//DTD HTML 3.2//EN&quot;&gt;
</pre></td></tr></table>

<p>Utilisez cette mention de type de document quand vous voulez vous r&eacute;f&eacute;rer &agrave; HTML 3.2.</p>

<p>Les mentions de type de document pour d'autres versions HTML ne sont plus en usage.</p>




<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&nbsp;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="remarque">Remarques pour la pratique</a></h2>

<p>Si les bras vous tombent maintenant devant tout ce fatras de HTML et XHTML, de variantes de langage, de d&eacute;clarations XML et instructions de type de document, ne vous laissez pas trop impressionner. Le fatras est apparu du fait des nombreux d&eacute;veloppements dans le domaine des langages de marquage et que pour ce d&eacute;veloppement, on a aussi r&eacute;colt&eacute; trop t&ocirc;t. Bien des choses n'avaient alors pas m&ucirc;ri et aujourd'hui on s'efforce de faire le grand &eacute;cart entre les d&eacute;buts euphoriques de HTML et les exigences impos&eacute;es &agrave; HTML qui vont croissant quand il doit &ecirc;tre utilis&eacute; pour un traitement des donn&eacute;es professionnel.</p>

<p>Employez dans un premier temps pour vos premiers pas en HTML tout simplement l'<img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut">&nbsp;<a href="#html"><b>Ossature d'un fichier HTML</b></a> pr&eacute;sent&eacute;e plus haut telle qu'elle y est not&eacute;e et apprenez &agrave; manier les autres &eacute;l&eacute;ments HTML et leurs attributs ainsi que le maniement des feuilles de style en cascade. Ce n'est que lorsque ces langages vous seront plus familiers que vous comprendrez mieux quel sens et quel but ont les diff&eacute;rences entre HTML et XHTML et les diff&eacute;rences entre les variantes de langage comme  &quot;Strict&quot;, &quot;Transitional&quot; et &quot;Frameset&quot;.</p>




<table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr><td colspan="2" bgcolor="#EEEEEE" class="doc">
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a>
</td></tr>

<tr><td bgcolor="#EEEEEE" class="doc" align="right"><a href="editer.htm"><img src="../../src/suivant.gif" width="10" height="10" border="0" hspace="10" alt="page suivante"></a></td>
<td bgcolor="#FFFFFF"><img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information"> <a href="editer.htm"><b>R&egrave;gles pour &eacute;diter en HTML</b></a>
</td></tr>

<tr>
<td bgcolor="#EEEEEE" class="doc" align="right"><a href="marquertexte.htm"><img src="../../src/precedent.gif" width="10" height="10" border="0" hspace="10" alt="page pr&eacute;c&eacute;dente"></a></td>
<td bgcolor="#FFFFFF" width="100%"><img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information"> <a href="marquertexte.htm"><b>Marquage de texte</b></a>
</td>

</tr>
<tr><td colspan="2" bgcolor="#EEEEEE" class="doc">&nbsp;</td></tr>
</table>

<table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr><td bgcolor="#FFEEDD" class="nav"><a class="an" name="bottom"><img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"></a> <a href="../../index.htm"><b>SELFHTML</b></a>/<a href="../../navigation/index.htm" target="_parent">Aides &agrave; la navigation</a> <img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="../index.htm"><b>HTML/XHML</b></a> <img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="index.htm"><b>R&egrave;gles g&eacute;n&eacute;rales pour HTML</b></a></td>
</tr></table>

<p>&copy; 2001 Stefan M&uuml;nz / &copy; 2003 Traduction <img src="../../src/courriel.gif" width="15" height="10" border="0" alt="Adresse &eacute;lectronique">&nbsp;<a href="mailto:13405@free.fr">Serge Fran&ccedil;ois, 13405@free.fr</a><br><img src="../../src/courriel.gif" width="15" height="10" border="0" alt="Adresse &eacute;lectronique">&nbsp;<a href="mailto:selfhtml@selfhtml.com.fr">selfhtml@selfhtml.com.fr</a></p>

</body>
</html>
