<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>SELFHTML: HTML/XHTML / R&egrave;gles g&eacute;n&eacute;rales pour HTML / R&eacute;f&eacute;rencer en  HTML</title>
<link rel="stylesheet" type="text/css" href="../../src/selfhtml.css">
<meta name="description"    content="Comment mentionner d'autres fichiers en HTML pour des liens par exemple ou pour les incorporer comme source externe.">
<meta name="keywords"       content="SELFHTML, HTML, r&eacute;f&eacute;rences, chemins, URIs, chemins relatifs, chemins absolus">
<meta name="author"         content="Stefan M&uuml;nz, selfhtml@teamone.de">
<meta http-equiv="content-type" content="text/html; charset=ISO-8859-1">
<meta name="DC.Publisher"   content="Serge Fran&ccedil;ois, selfhtml@selfhtml.com.fr">
<meta name="DC.Date"        content="2003-01-27T08:00+00:00">
<meta name="DC.Identifier"  content="http://selfhtml.selfhtml.com.fr/html/generalites/referencer.htm">
<meta name="DC.Language"    content="fr">
<meta name="DC.Rights"      content="../../editorial/copyright.htm">
<meta name="DC.Date.Create" content="2003-01-27T08:00+00:00">
<meta name="SELF.Version"   content="1">
<meta name="SELF.Pagetype"  content="Information">
<meta name="SELF.Path"      content="SELFHTML == ../../index.htm // HTML/XHTML == ../index.htm // R&egrave;gles g&eacute;n&eacute;rales pour HTML  == index.htm">
<link rel="stylesheet" type="text/css" href="../../src/selfhtml.css">
<!-- Matomo -->
<script type="text/javascript">
  var _paq = window._paq = window._paq || [];
  /* tracker methods like "setCustomDimension" should be called before "trackPageView" */
  _paq.push(['trackPageView']);
  _paq.push(['enableLinkTracking']);
  (function() {
    var u="//matomo.boitasite.com/";
    _paq.push(['setTrackerUrl', u+'matomo.php']);
    _paq.push(['setSiteId', '1']);
    var d=document, g=d.createElement('script'), s=d.getElementsByTagName('script')[0];
    g.type='text/javascript'; g.async=true; g.src=u+'matomo.js'; s.parentNode.insertBefore(g,s);
  })();
</script>
<!-- End Matomo Code -->
</head>

<body bgcolor="#FFFFFF" text="#000000" link="#AA5522" vlink="#772200" alink="#000000">

<table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr><td bgcolor="#FFEEDD" class="nav"><a class="an" name="top"><img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"></a> <a href="../../index.htm"><b>SELFHTML</b></a>/<a href="../../navigation/index.htm" target="_parent">Aides &agrave; la navigation</a> <img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="../index.htm"><b>HTML/XHML</b></a> <img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="index.htm"><b>R&egrave;gles g&eacute;n&eacute;rales pour HTML</b></a></td>
</tr></table>

<table cellpadding="4" cellspacing="0" border="0" width="100%">

<tr>
<td bgcolor="#EEEEEE" class="doc" width="110"><img src="../../src/logo.gif" width="106" height="109" border="0" alt="SELFHTML"></td>
<td bgcolor="#EEEEEE" class="doc" valign="bottom" width="100%"><h2>R&eacute;f&eacute;rencer en  HTML</h2></td>
</tr>

<tr>
<td bgcolor="#EEEEEE" class="doc" valign="top" align="center">
<img src="../../src/docx.gif" width="30" height="20" vspace="6" border="0" alt="Page d'information: vue d'ensemble">
</td>

<td bgcolor="#FFFFFF" valign="top" nowrap>
<p>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#generalites"><b>G&eacute;n&eacute;ralit&eacute;s pour r&eacute;f&eacute;rencer en HTML</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#uri"><b>R&eacute;f&eacute;rencer avec des URI compl&egrave;tes</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#absolu"><b>R&eacute;f&eacute;rencer avec des mentions de chemins absolus relatifs &agrave; l'URI de base</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#relatif"><b>R&eacute;f&eacute;rencer avec des mentions de chemins relatifs &agrave; l'URI de base</b></a><br>
</p>
</td>
</tr>

<tr><td colspan="2" bgcolor="#EEEEEE" class="doc">&#160;<a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&nbsp;</td></tr>
</table>



<h2 class="Sh2"><a class="an" name="generalites">G&eacute;n&eacute;ralit&eacute;s pour r&eacute;f&eacute;rencer en HTML</a></h2>

<p>Les fichiers HTML contiennent comme on le sait du texte. Cependant, de nombreuses pages Web contiennent des graphiques, des graphiques d'arri&egrave;re plan, des &eacute;l&eacute;ments multim&eacute;dia, des applets Java, des animations Flash ou autres choses similaires. De tels &eacute;l&eacute;ments sont not&eacute;s en HTML sous forme d'une r&eacute;f&eacute;rence &agrave; la source de donn&eacute;es correspondante. M&ecirc;me un lien ex&eacute;cutable &agrave; une autre de vos pages ou &agrave; une page sur le Web n'est ex&eacute;cutable que s'il nomme sa cible. &Agrave; ces fins, vous avez besoin de r&eacute;f&eacute;rencer en HTML.</p>

<p>De m&ecirc;me il y a dans les langages compl&eacute;mentaires comme les <img src="../../src/chap.gif" width="15" height="13" border="0" alt="Chapitre: vue d'ensemble">&nbsp;<a href="../../css/index.htm"><b>feuilles de style CSS</b></a> ou en  <img src="../../src/chap.gif" width="15" height="13" border="0" alt="Chapitre: vue d'ensemble">&nbsp;<a href="../../javascript/index.htm"><b>JavaScript</b></a>, des endroits auxquels vous devez r&eacute;f&eacute;rencer d'autres sources.</p>

<p>Les r&egrave;gles pour r&eacute;f&eacute;rencer restent toujours les m&ecirc;mes. La raison en est le sch&eacute;ma central et uniforme d'adressage sur le Web qui est ind&eacute;pendant de la syntaxe des diff&eacute;rents syst&egrave;mes d'exploitation et qui permet l'adressage exact de sources du Web de votre choix..</p>





<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&nbsp;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="uri">R&eacute;f&eacute;rencer avec des URI compl&egrave;tes</a></h2>

<p>Vous devez r&eacute;f&eacute;rencer avec des URI compl&egrave;tes quand la source d&eacute;sir&eacute;e grosso modo ne se trouve pas dans votre propre offre Web actuelle.</p>

<p>Une <b>URI</b> (<i>Universal Resource Identifier - d&eacute;signation de source universelle</i>) est par exemple quelque chose comme <var>http://www.selfhtml.com.fr/</var> ou bien <var>http://selfhtml/selfhtml.com.fr/html/generalites/referencer.htm</var>. Ces deux adresses en exemple sont en m&ecirc;me temps ce qu'on appelle des <b>URL</b>  (<i>Uniform Resource Locators - observateurs de source uniformes</i>). Et il y a encore - afin de d&eacute;boussoler compl&egrave;tement - ce qu'on appelle les <b>URN</b>s (<i>Uniform Resource Names - noms de source uniformes</i>). Les derniers servent &agrave; nommer sans &eacute;quivoque des sources de donn&eacute;es qui n'existent pas vraiment, tout en existant mais sans pouvoir &ecirc;tre appel&eacute;es par un protocole Internet connu sur la toile. Une URI est donc un terme g&eacute;n&eacute;rique qui recouvre les URL et URN, tandis que les URI et URL pour des adresses typiques derri&egrave;re lesquelles se cachent des donn&eacute;es concr&egrave;tes ou des sources de donn&eacute;es et dont il est question ici sont en fait la m&ecirc;me chose. Dans le standard HTML on parle pourtant d'URI.</p>

<h3 class="xmp">exemples d'URI:</h3>

<table width="100%" cellpadding="10"><tr><td class="xmpcode" bgcolor="#FFFFE0"><pre>
http://www.votre-estimable-nom.fr/
http://www.votre-estimable-nom.fr/index.htm
http://www.votre-estimable-nom.fr/index.htm#impressum
http://www.votre-estimable-nom.fr/arriereplan.gif
http://www.votre-estimable-nom.fr/presentation.pdf
http://www.votre-estimable-nom.fr/cgi-bin/recherche.cgi?expression=lapin
http://www.google.fr/search?q=Serge+Fran%E7ois&amp;hl=fr&amp;btnG=Recherche+Google&amp;meta=cr%3DcountryFR
ftp://www.votre-estimable-nom.fr/presentation.pdf
http://192.168.78.10/
http://www.votre-estimable-nom.fr:8082/secret.htm
</pre></td></tr></table>

<h3 class="xpl">Explication:</h3>

<p>Une URI compl&egrave;te comprend la mention d'un protocole Internet par exemple <code>http</code> ou <code>ftp</code>, suivi de deux points. Derri&egrave;re peut &ecirc;tre faite une mention suppl&eacute;mentaire &agrave; un nom de r&eacute;seau local - cela diff&egrave;re d'un protocole &agrave; l'autre. Cette mention est ins&eacute;r&eacute;e entre deux barres obliques <code>//</code>. Pour la plupart des adresses, une telle mention n'existe pas, ce pourquoi les deux barres obliques sont simplement juxtapos&eacute;es sans contenu.</p>

<p>Derri&egrave;re ces mentions figure l'adresse de l'ordinateur h&ocirc;te sur le r&eacute;seau, ordinateur sur lequel se trouve la source de donn&eacute;es. Cela peut &ecirc;tre un nom de domaine ou une adresse IP num&eacute;rique. Le nom de domaine est d'ailleurs  <code>votre-estimable-nom.fr</code> dans les exemples ci-dessus. Le <code>www</code> qui le pr&eacute;c&egrave;de est un r&eacute;glage par d&eacute;faut typique pour les sous-domaines qui peut &ecirc;tre modifi&eacute; sur les serveurs Web.</p>

<p>Derri&egrave;re l'adressage de l'ordinateur h&ocirc;te peut suivre, s&eacute;par&eacute; par deux points ce qu'on appelle un num&eacute;ro de port comme dans le dernier des exemples ci-dessus pour <code>:8082</code>. Cela est toujours indispensable quand la source de donn&eacute;es ne peut pas &ecirc;tre atteinte par le port standard du protocole mentionn&eacute; comme par exemple <code>http</code> mais par un autre port. Dans la pratique vous avez plut&ocirc;t rarement besoin de la mention de port, mais vous devez la conna&icirc;tre.</p>

<p>Derri&egrave;re enfin est mentionn&eacute; le chemin local &agrave; la source de donn&eacute;es d&eacute;sir&eacute;e. Peu importe ici de quel syst&egrave;me d'exploitation il s'agit - les r&eacute;pertoires dans les chemins sont toujours s&eacute;par&eacute;s par des barres obliques normales. C'est le travail du logiciel serveur sur l'ordinateur de d&eacute;chiffrer correctement les mentions de chemins. Ainsi, vous n'avez pas &agrave; vous soucier du syst&egrave;me d'exploitation utilis&eacute; par l'ordinateur auquel vous vous adressez..</p>

<p>Sur l'ordinateur, vous pouvez adresser des fichiers et des sources de donn&eacute;es de votre choix. La condition pr&eacute;alable en est qu'ils puissent &ecirc;tre atteints par le protocole mentionn&eacute; comme par exemple <code>http</code> et par l'adresse. Il ne doit pas forc&eacute;ment s'agir de fichiers. Ainsi gr&acirc;ce &agrave; <code>#</code> suivi d'un nom un ancrage cible d&eacute;termin&eacute; dans un fichier HTML peut &ecirc;tre consult&eacute;. Comment de telles ancres peuvent &ecirc;tre d&eacute;finies est d&eacute;crit dans la partie <img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="../liens/projetinterne.htm#ancre"><b>d&eacute;finir des ancres et des liens &agrave; des ancres</b></a>. M&ecirc;me les appels &agrave; des scripts CGI avec des param&egrave;tres sont des URI, comme dans l'exemple ci dessus <code>recherche.cgi?expression=lapin</code>.</p>

<p>Vous devez masquer dans l'URI les signes qui ne font pas partie du <img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="../../internationalisation/jeux_caracteres.htm#iso8859"><b>jeu de caract&egrave;res ASCII</b></a> ou qui sont importants dans l'URI (par exemple la barre oblique, les deux points ou le signe de pourcentage). Cela s'effectue par la mention du signe pourcentage <code>%</code> suivi de la valeur hexad&eacute;cimale du signe. Dans l'exemple ci-dessus vous le voyez par exemple pour <code>Fran%E7ois</code>, o&ugrave; <code>E7</code> est la mention hexad&eacute;cimale du nombre 231 et que celui-ci exprime lui-m&ecirc;me la lettre &quot;&ccedil;&quot;.</p>


<h3 class="inf">Attention:</h3>

<p>Les descriptions ci-dessus s'adressent &agrave; ceux qui pratiquent et elles ne pr&eacute;tendent pas &ecirc;tre exhaustives. Le concept des URI est encore beaucoup plus vari&eacute; que la repr&eacute;sentation qui en est faite ici. Si cela vous int&eacute;resse, vous pouvez consulter la page <img src="../../src/en.gif" width="16" height="10" border="0" alt="Page en langue anglaise">&nbsp;<a target="_top" href="http://www.ietf.org/rfc/rfc1630.txt"><b>RFC 1630</b></a>.</p>

<p>Vous pouvez bien s&ucirc;r &eacute;galement r&eacute;f&eacute;rencer des sources de donn&eacute;es de votre propre offre Web avec des URI compl&egrave;tes. Mais ainsi pourtant vous vous imposez une limite (Voir les remarques d'introduction au paragraphe <img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#relatif"><b>R&eacute;f&eacute;rencer avec des mentions de chemins relatifs &agrave; l'URI de base</b></a>)</p>


<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&nbsp;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="absolu">R&eacute;f&eacute;rencer avec des mentions de chemins absolus relatifs &agrave; l'URI de base</a></h2>

<p>Vous pouvez choisir cette variante pour r&eacute;f&eacute;rencer lorsque la source de donn&eacute;es d&eacute;sir&eacute;e se trouve sur le m&ecirc;me ordinateur h&ocirc;te et peut &ecirc;tre atteinte par le protocole actuel et le port standard. Cela para&icirc;t plus compliqu&eacute; que &ccedil;a ne l'est. Dans l'URI compl&egrave;te <var>http://selfhtml.selfhtml.com.fr/html/generalites/referencer.htm</var> la partie <var>/html/generalites/referencer.htm</var> est une mention de chemin absolu, relative &agrave; l'URI de base  <var>http://selfhtml.selfhtml.com.fr</var>. &Agrave; l'int&eacute;rieur de votre propre offre Web et de votre propre domaine ou sous-domaine vous pouvez donc travailler avec ce genre de mentions de chemin.</p>

<h3 class="xmp">Exemples:</h3>

<table width="100%" cellpadding="10"><tr><td class="xmpcode" bgcolor="#FFFFE0"><pre>
/
/index.htm
/index.htm#impressum
/arriereplan.gif
/presentation.pdf
/cgi-bin/recherche.cgi?expression=lapin
/search?hl=de&amp;safe=off&amp;q==Serge+Fran%E7ois&amp;hl
</pre></td></tr></table>

<h3 class="xpl">Explication:</h3>

<p>La premi&egrave;re barre oblique derri&egrave;re l'URI de base exprime le r&eacute;pertoire racine du service Internet concern&eacute;. Il ne s'agit pas ici du r&eacute;pertoire racine effectif de l'ordinateur ou du disque dur auquel vous &ecirc;tes en train d'acc&eacute;der. Pour les serveurs Web, il est par exemple possible de r&eacute;gler quel r&eacute;pertoire effectif doit correspondre su r&eacute;pertoire racine Web.</p>

<p>Derri&egrave;re l'adresse URI de base tout ce qui a &eacute;t&eacute; &eacute;voqu&eacute; dans le paragraphe  <img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut">&nbsp;<a href="#uri"><b>R&eacute;f&eacute;rencer avec des URI compl&egrave;tes</b></a> peut suivre.</p>





<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&nbsp;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="relatif">R&eacute;f&eacute;rencer avec des mentions de chemins relatifs &agrave; l'URI de base</a></h2>

<p>Vous pouvez choisir cette variante quand vous choisissez comme URI de r&eacute;f&eacute;rence l'URI actuelle. Alors il vous est possible de faire des adressages relatifs &agrave; partir de l'endroit o&ugrave; vous vous trouvez. Le fichier HTML dont l'URI est  <var>http://selfhtml.selfhtml.com.fr/html/generalites/referencer.htm</var>
contient par exemple pour r&eacute;f&eacute;rencer un graphique la mention suivante: <var>../../src/logo.gif</var>.
Ce qui signifie: va deux r&eacute;pertoires en amont, de l&agrave; dans le sous-r&eacute;pertoire <var>src</var> o&ugrave; tu trouveras le fichier <var>logo.gif</var>. Exprim&eacute;e de fa&ccedil;on absolue, ce fichier a donc l'URI <var>http://selfhtml.selfhtml.com.fr/src/logo.gif</var>.</p>

<p>Cette forme d'adressage est vivement conseill&eacute;e &agrave; l'int&eacute;rieur de projets Web. La raison en est que vous pouvez ainsi sans probl&egrave;me d&eacute;placer le projet Web &agrave; une autre adresse, sans g&ecirc;ner le fonctionnement de tous les liens internes au projet ni les r&eacute;f&eacute;rences de graphiques. Particuli&egrave;rement dans le cas o&ugrave; vous voulez publier &eacute;galement  votre projet sur CD-ROM ou sur d'autres m&eacute;dias, l'adressage relatif s'impose.</p>


<h3 class="xmp">Exemples:</h3>

<table width="100%" cellpadding="10"><tr><td class="xmpcode" bgcolor="#FFFFE0"><pre>
./
couleurs.htm
./couleurs.htm
images/graphique.gif
./images/graphique.gif
../
../../../../ailleurs/fichier.htm
</pre></td></tr></table>

<h3 class="xpl">Explication:</h3>

<p>Un fichier dans le m&ecirc;me r&eacute;pertoire comme celui dans lequel vous vous trouvez, peut &ecirc;tre r&eacute;f&eacute;renc&eacute; simplement par la mention de son nom de fichier - dans l'exemple ci-dessus par exemple, le fichier <code>couleurs.htm</code>. Vous r&eacute;f&eacute;rencez le r&eacute;pertoire actuel par <code>./</code> - donc un point suivi d'une barre oblique. L'adressage de <code>couleurs.htm</code> et de  <code>./couleurs.htm</code> dans l'exemple ci-dessus a donc le m&ecirc;me effet.</p>

<p>Une mention telle que <code>images/graphique.gif</code> r&eacute;f&eacute;rence un fichier nomm&eacute; <code>graphique.gif</code> dans le r&eacute;pertoire <code>images</code>, qui est un sous-r&eacute;pertoire du r&eacute;pertoire actuel. La notation <code>./images/graphique.gif</code> a le m&ecirc;me effet que <code>images/graphique.gif</code>.</p>

<p>Avec <code>../</code> vous r&eacute;f&eacute;rencez le r&eacute;pertoire en amont du r&eacute;pertoire actuel, peu importe son nom. Avec <code>../../</code> vous r&eacute;f&eacute;rencez le r&eacute;pertoire en amont du r&eacute;pertoire qui est en amont du r&eacute;pertoire actuel etc. Vous pouvez &agrave; nouveau acc&eacute;der aux sous-r&eacute;pertoires des r&eacute;pertoires ainsi adress&eacute;s comme dans le dernier des exemples ci-dessus.</p>









<table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr><td colspan="2" bgcolor="#EEEEEE" class="doc">
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a>
</td></tr>

<tr><td bgcolor="#EEEEEE" class="doc" align="right"><a href="commentaires.htm"><img src="../../src/suivant.gif" width="10" height="10" border="0" hspace="10" alt="page suivante"></a></td>
<td bgcolor="#FFFFFF"><img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information"> <a href="commentaires.htm"><b>Commentaires et droits</b></a>
</td></tr>

<tr>
<td bgcolor="#EEEEEE" class="doc" align="right"><a href="couleurs.htm"><img src="../../src/precedent.gif" width="10" height="10" border="0" hspace="10" alt="page pr&eacute;c&eacute;dente"></a></td>
<td bgcolor="#FFFFFF" width="100%"><img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information"> <a href="couleurs.htm"><b>D&eacute;finir les couleurs en HTML</b></a>
</td>

</tr>
<tr><td colspan="2" bgcolor="#EEEEEE" class="doc">&nbsp;</td></tr>
</table>

<table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr><td bgcolor="#FFEEDD" class="nav"><a class="an" name="bottom"><img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"></a> <a href="../../index.htm"><b>SELFHTML</b></a>/<a href="../../navigation/index.htm" target="_parent">Aides &agrave; la navigation</a> <img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="../index.htm"><b>HTML/XHML</b></a> <img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="index.htm"><b>R&egrave;gles g&eacute;n&eacute;rales pour HTML</b></a></td>
</tr></table>

<p>&copy; 2001 Stefan M&uuml;nz / &copy; 2003 Traduction <img src="../../src/courriel.gif" width="15" height="10" border="0" alt="Adresse &eacute;lectronique">&nbsp;<a href="mailto:13405@free.fr">Serge Fran&ccedil;ois, 13405@free.fr</a><br><img src="../../src/courriel.gif" width="15" height="10" border="0" alt="Adresse &eacute;lectronique">&nbsp;<a href="mailto:selfhtml@selfhtml.com.fr">selfhtml@selfhtml.com.fr</a></p>

</body>
</html>
