<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>SELFHTML: HTML/XHTML / R&egrave;gles g&eacute;n&eacute;rales pour HTML / Un bon style HTML</title>
<link rel="stylesheet" type="text/css" href="../../src/selfhtml.css">
<meta name="description"    content="Ce &agrave; quoi vous devez veiller lors de l'&eacute;tablissement de fichiers HTML pour &eacute;crire dans un code propre et qui convienne pour Internet.">
<meta name="keywords"       content="SELFHTML, HTML, style HTML, code HTML">
<meta name="author"         content="Stefan M&uuml;nz, selfhtml@teamone.de">
<meta http-equiv="content-type" content="text/html; charset=ISO-8859-1">
<meta name="DC.Publisher"   content="Serge Fran&ccedil;ois, selfhtml@selfhtml.com.fr">
<meta name="DC.Date"        content="2003-01-27T08:00+00:00">
<meta name="DC.Identifier"  content="http://selfhtml.selfhtml.com.fr/html/generalites/style.htm">
<meta name="DC.Language"    content="fr">
<meta name="DC.Rights"      content="../../editorial/copyright.htm">
<meta name="DC.Date.Create" content="2003-01-27T08:00+00:00">
<meta name="SELF.Version"   content="1">
<meta name="SELF.Pagetype"  content="Information">
<meta name="SELF.Path"      content="SELFHTML == ../../index.htm // HTML/XHTML == ../index.htm // R&egrave;gles g&eacute;n&eacute;rales pour HTML == index.htm">
<link rel="stylesheet" type="text/css" href="../../src/selfhtml.css">
<!-- Matomo -->
<script type="text/javascript">
  var _paq = window._paq = window._paq || [];
  /* tracker methods like "setCustomDimension" should be called before "trackPageView" */
  _paq.push(['trackPageView']);
  _paq.push(['enableLinkTracking']);
  (function() {
    var u="//matomo.boitasite.com/";
    _paq.push(['setTrackerUrl', u+'matomo.php']);
    _paq.push(['setSiteId', '1']);
    var d=document, g=d.createElement('script'), s=d.getElementsByTagName('script')[0];
    g.type='text/javascript'; g.async=true; g.src=u+'matomo.js'; s.parentNode.insertBefore(g,s);
  })();
</script>
<!-- End Matomo Code -->
</head>

<body bgcolor="#FFFFFF" text="#000000" link="#AA5522" vlink="#772200" alink="#000000">

<table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr><td bgcolor="#FFEEDD" class="nav"><a class="an" name="top"><img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"></a> <a href="../../index.htm"><b>SELFHTML</b></a>/<a href="../../navigation/index.htm" target="_parent">Aides &agrave; la navigation</a> <img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="../index.htm"><b>HTML/XHML</b></a> <img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="index.htm"><b>R&egrave;gles g&eacute;n&eacute;rales pour HTML</b></a></td>
</tr></table>

<table cellpadding="4" cellspacing="0" border="0" width="100%">

<tr>
<td bgcolor="#EEEEEE" class="doc" width="110"><img src="../../src/logo.gif" width="106" height="109" border="0" alt="SELFHTML"></td>
<td bgcolor="#EEEEEE" class="doc" valign="bottom" width="100%"><h2>Un bon style HTML</h2></td>
</tr>

<tr>
<td bgcolor="#EEEEEE" class="doc" valign="top" align="center">
<img src="../../src/docx.gif" width="30" height="20" vspace="6" border="0" alt="Page d'information: vue d'ensemble">
</td>

<td bgcolor="#FFFFFF" valign="top" nowrap>
<p> <img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#generalites"><b>Remarques g&eacute;n&eacute;rales</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#navigateur"><b>Ne pas &eacute;crire pour des navigateurs d&eacute;termin&eacute;s</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#ecran"><b>Ne pas &eacute;crire pour des r&eacute;solutions d'&eacute;cran d&eacute;termin&eacute;es</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#detourner"><b>Ne pas d&eacute;tourner les rep&egrave;res de leur destination</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#textes_lien"><b>Utiliser des textes de lien honn&ecirc;tes et explicites</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#graphiques"><b>Utiliser les graphiques &agrave; bon escient</b></a><br>
</p>
</td>
</tr>

<tr><td colspan="2" bgcolor="#EEEEEE" class="doc">&#160;<a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&nbsp;</td></tr>
</table>




<h2 class="Sh2"><a class="an" name="generalites">Remarques g&eacute;n&eacute;rales</a></h2>

<p>Il n'y a pas de lignes directrices arr&ecirc;t&eacute;es pour un HTML &quot;correct&quot;. Il y a bien s&ucirc;r des r&egrave;gles concernant l'apparence d'un document HTML valide. En tous cas, il est globalement recommand&eacute de s'en tenir autant que faire se peut au standard du langage HTML du consortium W3. Entre-temps le consortium W3 a aussi reconnu que sa mission ne se r&eacute;sumait pas  &agrave; traiter des sp&eacute;cifications techniques, mais aussi &agrave; les transmettre &agrave; des utilisateurs humains &quot;normaux et mortels&quot;qui n'ont pas de ma&icirc;trise en informatique. Si vous vous occupez de fa&ccedil;on intensive et durable de cr&eacute;er vos propres pages Web, vous devriez pour cette raison visiter r&eacute;guli&egrave;rement les <img src="../../src/en.gif" width="16" height="10" border="0" alt="Page en langue anglaise">&nbsp;<a target="_top" href="http://www.w3.org/"><b>pages Web du consortium W3</b></a> pour voir les nouveaut&eacute;s et derni&egrave;res tendances et directives. Il n'existe pour l'instant qu'une <img src="../../src/fr.gif" width="16" height="10" border="0" alt="Page en langue fran&ccedil;aise">&nbsp;<a target="_top" href="http://www.inria.fr/w3c/"><b>pr&eacute;sentation fran&ccedil;aise du W3C</b></a>, qui propose des informations importantes sur le consortium W3 en langue fran&ccedil;aise.</p>

<p>Pour les auteurs HTML, le consortium W3 propose en plus un service qui permet de v&eacute;rifier l'exactitude syntaxique des fichiers cr&eacute;&eacute;s: ce qu'on appelle le <img src="../../src/en.gif" width="16" height="10" border="0" alt="Page en langue anglaise">&nbsp;<a target="_top" href="http://validator.w3.org/"><b>Valideur</b></a>. Gr&acirc;ce &agrave; lui, vous pouvez faire v&eacute;rifier vos pages si elle peuvent &ecirc;tre atteintes sur le Web &agrave; une adresse HTTP.</p>

<p>&Agrave vrai dire, en ce qui concerne un &quot;bon style HTML&quot; il est bien pr&eacute;f&eacute;rable de d&eacute;crire ce qu'il ne faudrait faire en aucun cas. &Agrave ce sujet il y a un mode d'emploi sur le WWW qui garde sa valeur malgr&eacute; son &acirc;ge: <img src="../../src/de.gif" width="16" height="10" border="0" alt="Page en langue allemande">&nbsp;<a target="_top" href="http://www.karzauninkat.com/Goldhtml/"><b>r&egrave;gles
d'or pour un mauvais HTML</b></a> de Stefan Karzauninkat.</p>






<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&nbsp;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="navigateur">Ne pas &eacute;crire pour des navigateurs d&eacute;termin&eacute;s</a></h2>

<p>Si vous voulez placer des fichiers sur le WWW, vous devez utiliser plus qu'un
navigateur WWW pour tester vos fichiers. Utilisez les produits les plus
r&eacute;pandus comme Netscape et l' Explorer Internet MS, et si c'est possible
aussi dans plusieurs versions, mais aussi un produit plus ancien comme par exemple Mosaic. Si vous avez la possibilit&eacute de tester sur plusieurs plate-formes (MS-Windows Macintosh, Sun etc...) ne manquez pas d'en faire usage. Et examinez peut &ecirc;tre vos pages &eacute;galement avec un ordinateur portable ou avec une paire de lunettes qui n'est plus adapt&eacute;e &agrave; votre vue.</p>

<p>Maintenant personne ne peut vous interdire d'&eacute;crire des fichiers HTML ne
pouvant &ecirc;tre interpr&eacute;t&eacute;s correctement que par Netscape ou que par l' Explorer Internet MS. Mais si vous mettez de telles pages sur la toile, vous devez savoir, qu'en fin de compte vous nuisez ainsi &agrave; votre image.</p>






<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&nbsp;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="ecran">Ne pas &eacute;crire pour des r&eacute;solutions d'&eacute;cran d&eacute;termin&eacute;es</a></h2>

<p>Forcer des largeurs fixes par la mise en &#339;uvre de tableaux imbriqu&eacute;s et de &quot;pixels aveugles&quot; s'est entre-temps r&eacute;pandue de telle fa&ccedil;on sur le Web que certains auteurs de pages d'accueil semblent avoir oubli&eacute; que le HTML simple cr&eacute;e du texte courant normal qui s'adapte &agrave; la fen&ecirc;tre du navigateur. Maintenant cela n'a plus aucun sens d'imposer des largeurs minimales avec abus. Les tableaux avec plusieurs colonnes et un contenu correspondant ont besoin d'une certaine largeur et HTML n'est pas du WML (un langage sp&eacute;cial pour cr&eacute;er des pages Web pour des t&eacute;l&eacute;phones portables). Si pourtant la question se pose de savoir si vous devez &quot;optimiser&quot; vos pages Web pour une r&eacute;solution d'&eacute;cran de 1024 ou de 800 - alors ce n'est pas la bonne question. Car beaucoup d'utilisateurs surfent avec plusieurs instances de leur navigateur et ouvrent des liens dans des nouvelles fen&ecirc;tres du navigateur. Souvent, ces fen&ecirc;tres ne sont pas affich&eacute;es en mode plein &eacute;cran. Il y a m&ecirc;me beaucoup d'utilisateurs qui ont des programmes ouverts qui leur occupent une partie de l'&eacute;cran et sont affich&eacute;s en permanence - par exemple les programmes de messages instantan&eacute;s comme ICQ. Tout ces utilisateurs ne vous feront pas le plaisir sp&eacute;cialement pour vos pages, d'agrandir la fen&ecirc;tre de leur navigateur en mode plein &eacute;cran. C'est pourquoi il est inutile de ruminer sur la moyenne suppos&eacute;e des r&eacute;solutions d'&eacute;cran. Tout ce que vous pouvez exiger, ce sont quelques centaines de pixels de large donc une mention tr&egrave;s ind&eacute;finie).</p>

<p>Utilisez de pr&eacute;f&eacute;rence pour les tableaux ou les cadres des mentions de hauteur et de largeur en pourcentage. Les mentions absolues en pixels n'ont un sens que par exemple lorsque la premi&egrave;re colonne d'un tableau sans quadrillage doit recouvrir une image d'arri&egrave;re plan divis&eacute;e en deux couleurs. Autrement, il ne faut pas trop vous cramponner &agrave; des id&eacute;es telles que celle o&ugrave; un graphique ou un paragraphe doit commencer &agrave; 10,8 cm de la marge gauche. Si l'apparence est belle chez vous, c'est loin de vouloir dire qu'elle sera belle chez quelqu'un d'autre, et dans certains cas elle peut &ecirc;tre particuli&egrave;rement vilaine.</p>






<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&nbsp;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="detourner">Ne pas d&eacute;tourner les rep&egrave;res de leur destination</a></h2>

<p>Vous ne devez pas particuli&egrave;rement utiliser les &eacute;l&eacute;ments logiques et s&eacute;mantiques de HTML pour obtenir certains effets de formatage. Ainsi par exemple, certains utilisent le rep&egrave;re <code>blockquote</code> pour ins&eacute;rer un retrait de paragraphe, pour la simple raison que la plupart des navigateurs repr&eacute;sentent le texte ins&eacute;r&eacute; dans <code>&lt;blockquote&gt;</code> ... <code>&lt;/blockquote&gt;</code>, comme un paragraphe ind&eacute;pendant en retrait. Le rep&egrave;re <code>blockquote</code> est
pourtant con&ccedil;u pour les citations et ne devrait &ecirc;tre employ&eacute qu'&agrave cette fin.</p>

<p>Plus fr&eacute;quemment ce sont les titres qui sont trait&eacute;s honteusement. Les titres ne sont pas l&agrave pour &eacute;crire du texte en grand et en caract&egrave;res gras mais pour indiquer des rapports de hi&eacute;rarchie logiques entre les diff&eacute;rentes parties d'un texte. Si vous voulez formatez du texte, utilisez les  <img src="../../src/chap.gif" width="15" height="13" border="0" alt="Chapitre: vue d'ensemble">&nbsp;<a href="../../css/index.htm"><b>feuilles de style CSS</b></a>.</p>








<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&nbsp;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="textes_lien">Utiliser des textes de lien honn&ecirc;tes et explicites</a></h2>

<p>La r&egrave;gle g&eacute;n&eacute;rale stipule: la cible d'un lien doit tenir ce que le lien promet. Ce qui signifie lors de l'&eacute;tablissement du lien: le texte du lien ne doit promettre ni trop ni trop peu. Si par exemple vous proposez de l'information sur un produit logiciel sans le proposer au t&eacute;l&eacute;chargement, il n'est pas correct de sugg&eacute;rer &agrave; l'utilisateur qu'il puisse le t&eacute;l&eacute;charger imm&eacute;diatement avec un lien &agrave; l'information.</p>

<p>Les liens en HTML peuvent &ecirc;tre o&ugrave; l'on veut dans un texte. Si toutefois vous lisez un texte o&ugrave; il y a un lien tous les deux mots vous remarquerez vite que cela nuit &agrave; la lisibilit&eacute;. La raison en est que les liens attirent tout de suite l'attention et distraient le lecteur de ce qu'il a &agrave; faire &agrave; savoir la compr&eacute;hension de ce qui y est exprim&eacute; . Il est d'autant plus important que les
liens dans le corps d'un texte ne soient pas des &eacute;nigmes mais puissent &ecirc;tre imm&eacute;diatement compris.</p>

<p>N'employez un lien dans un corps de texte seulement si le texte du
lien a un sens et formulez des phrases dans lesquelles le texte se rapportant au
lien appara&icirc;t de telle mani&egrave;re qu'il soit renforc&eacute; par le contexte.</p>

<p>N'&eacute;crivez pas par exemple:<br>
&quot;Pour plus d'informations cliquez <a name="faux" href="#faux">ici</a>&quot;,<br>
mais:<br>
&quot;vous pouvez obtenir des<a name="correct" href="#correct"> informations compl&eacute;mentaires</a>.&quot;</p>








<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&nbsp;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="graphiques">Utiliser les graphiques &agrave; bon escient</a></h2>

<p>&Agrave; moins que vous ne programmiez justement une exposition d'art virtuelle en HTML, &eacute;vitez les grands fichiers graphiques. Pensez, quand vous &eacute;tablissez des fichiers pour le WWW, que beaucoup d'utilisateurs ont un acc&egrave;s Internet limit&eacute; en volume, c'est &agrave; dire qu'ils paient en fonction des donn&eacute;es qu'ils chargent en m&eacute;moire sur leur ordinateur. Il est vrai que la plupart des navigateurs permet de d&eacute;sactiver le chargement de graphiques, cependant, si l'utilisateur ne
se sert pas de cette fonction, cela ne veut pas dire tant s'en faut qu'il est
pr&ecirc;t &agrave; charger sans avertissement un graphique d'un m&eacute;gaoctet.</p>

<p>Pour cette raison essayez de pr&eacute;f&eacute;rence avec des petits graphiques bien plac&eacute;s. Souvent 16 couleurs suffisent au lieu de 256 ou m&ecirc;me 16,7 millions. Cela r&eacute;duit leur taille de fa&ccedil;on significative.</p>

<p>D'autre part vous ne devez en aucun cas renoncer &agrave; l'utilisation de
graphiques. Du texte 100% est &agrave; vrai dire beaucoup plus fatigant &agrave; lire &agrave; l'&eacute;cran que sous leur forme imprim&eacute;e. C'est pourquoi il faut que des textes plus longs soient riches en contenu et a&eacute;r&eacute;s dans toute la mesure du possible. L'emploi de graphiques vous aide aussi &agrave; y parvenir.</p>

<p>L'id&eacute;al, ce sont des petits graphiques de la taille d'une ic&ocirc;ne. Ils sont vite charg&eacute;s et vous pouvez sans souci en r&eacute;f&eacute;rencer plusieurs par fichier .</p>

<p>Des petits graphiques peuvent aussi assurer certaines fonctions pour l'image
de marque ou pour l'orientation de l'utilisateur. L'avantage de graphiques
employ&eacute;s &agrave; plusieurs reprises est qu'il suffit &agrave; la plupart des navigateurs de les charger une fois seulement et de les conserver ensuite en m&eacute;moire.</p>





<table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr><td colspan="2" bgcolor="#EEEEEE" class="doc">
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a>
</td></tr>
<tr><td bgcolor="#EEEEEE" class="doc" align="right"><a href="../entete/titre.htm"><img src="../../src/suivant.gif" width="10" height="10" border="0" hspace="10" alt="page suivante"></a></td>
<td bgcolor="#FFFFFF"><img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information"> <a href="../entete/titre.htm"><b>Titre d'un fichier HTML</b></a>
</td></tr>

<tr>
<td bgcolor="#EEEEEE" class="doc" align="right"><a href="organisation.htm"><img src="../../src/precedent.gif" width="10" height="10" border="0" hspace="10" alt="page pr&eacute;c&eacute;dente"></a></td>
<td bgcolor="#FFFFFF" width="100%"><img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information"> <a href="organisation.htm"><b>R&eacute;partition de l'information et organisation des fichiers</b></a>
</td>

</tr>
<tr><td colspan="2" bgcolor="#EEEEEE" class="doc">&nbsp;</td></tr>
</table>

<table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr><td bgcolor="#FFEEDD" class="nav"><a class="an" name="bottom"><img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"></a> <a href="../../index.htm"><b>SELFHTML</b></a>/<a href="../../navigation/index.htm" target="_parent">Aides &agrave; la navigation</a> <img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="../index.htm"><b>HTML/XHML</b></a> <img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="index.htm"><b>R&egrave;gles g&eacute;n&eacute;rales pour HTML</b></a></td>
</tr></table>

<p>&copy; 2001 Stefan M&uuml;nz / &copy; 2003 Traduction <img src="../../src/courriel.gif" width="15" height="10" border="0" alt="Adresse &eacute;lectronique">&nbsp;<a href="mailto:13405@free.fr">Serge Fran&ccedil;ois, 13405@free.fr</a><br><img src="../../src/courriel.gif" width="15" height="10" border="0" alt="Adresse &eacute;lectronique">&nbsp;<a href="mailto:selfhtml@selfhtml.com.fr">selfhtml@selfhtml.com.fr</a></p>

</body>
</html>
