<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>SELFHTML: CGI/Perl / Introduction / Installer un serveur WWW localement sur un ordinateur personnel</title>
<link rel="stylesheet" type="text/css" href="../../src/selfhtml.css">
<meta name="description"    content="Comment installer un environnement serveur HTTM sur un ordinateur personnel pour essayer tranquillement les scripts CGI hors connection.">
<meta name="keywords"       content="SELFHTML, CGI, serveur Web, Webserver, Web-Server, HTTP, serveur local">
<meta name="author"         content="Stefan M&uuml;nz, selfhtml@teamone.de">
<meta http-equiv="content-type" content="text/html; charset=ISO-8859-1">
<meta name="DC.Publisher"   content="Serge Fran&ccedil;ois, selfhtml@selfhtml.com.fr">
<meta name="DC.Date"        content="2003-01-27T08:00+00:00">
<meta name="DC.Identifier"  content="http://selfhtml.selfhtml.com.fr/cgiperl/introduction/ordiserveurweb.htm">
<meta name="DC.Language"    content="fr">
<meta name="DC.Rights"      content="../../editorial/copyright.htm">
<meta name="DC.Date.Create" content="2003-01-27T08:00+00:00">
<meta name="SELF.Version"   content="1">
<meta name="SELF.Pagetype"  content="Information">
<meta name="SELF.Path"      content="SELFHTML == ../../index.htm // CGI/Perl == ../index.htm // Introduction == index.htm">
<!-- Matomo -->
<script type="text/javascript">
  var _paq = window._paq = window._paq || [];
  /* tracker methods like "setCustomDimension" should be called before "trackPageView" */
  _paq.push(['trackPageView']);
  _paq.push(['enableLinkTracking']);
  (function() {
    var u="//matomo.boitasite.com/";
    _paq.push(['setTrackerUrl', u+'matomo.php']);
    _paq.push(['setSiteId', '1']);
    var d=document, g=d.createElement('script'), s=d.getElementsByTagName('script')[0];
    g.type='text/javascript'; g.async=true; g.src=u+'matomo.js'; s.parentNode.insertBefore(g,s);
  })();
</script>
<!-- End Matomo Code -->
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#AA5522" vlink="#772200" alink="#000000">

<table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr>
<td bgcolor="#FFEEDD" class="nav"><a class="an" name="top"><img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"></a> <a href="../../index.htm"><b>SELFHTML</b></a>/<a href="../../navigation/index.htm" target="_parent">Aides &agrave; la navigation</a> <img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="../index.htm"><b>CGI/Perl</b></a> <img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="index.htm"><b>Introduction</b></a></td>
</tr>
</table><table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr>
<td bgcolor="#EEEEEE" class="doc" width="110"><img src="../../src/logo.gif" width="106" height="109" border="0" alt="SELFHTML"></td>
<td bgcolor="#EEEEEE" class="doc" valign="bottom" width="100%"><h2>Installer un serveur WWW localement sur un ordinateur personnel</h2>
<tr>
<td bgcolor="#EEEEEE" class="doc" valign="top" align="center">
<img src="../../src/docx.gif" width="30" height="20" vspace="6" border="0" alt="Page d'information: vue d'ensemble">
</td>
<td bgcolor="#FFFFFF" valign="top" nowrap>
<p>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#serveur_web_perso"><b>Le serveur Web personnel</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#produits"><b>Produits appropri&eacute;s</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#reglages_base"><b>R&eacute;glages de base pour une utilisation locale</b></a><br>
</p>
</td>
</tr><tr><td colspan="2" bgcolor="#EEEEEE" class="doc">&#160;<a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;</td></tr>
</table>



<h2 class="Sh2"><a class="an" name="serveur_web_perso">Le serveur Web personnel</a></h2>

<p>Beaucoup d'utilisateurs de PC ayant acc&egrave;s &agrave; Internet associent le concept de &quot;serveur Web&quot; &agrave; une esp&egrave;ce de gros ordinateur sur lequel se trouveraient les donn&eacute;es qu'on trouve sur Internet. &Agrave; vrai dire, un serveur Web est un programme logiciel pas particuli&egrave;rement grand qui peut en principe tourner sur n'importe quel ordinateur, donc pas sp&eacute;cialement sur des ordinateurs serveurs sur Internet, mais aussi sur chaque ordinateur personnel. Il n'est m&ecirc;me pas besoin d'&ecirc;tre connect&eacute; &agrave; Internet pour exploiter un serveur WWW. Il suffit en fin de compte d'un "Socket" TCP/IP (sous Microsoft Windows c'est par exemple le fichier <var>winsock.dll</var>). Si donc vous avez un acc&egrave;s Internet en &eacute;tat de marche, toutes les conditions pr&eacute;alables sont d&eacute;j&agrave; remplies pour exploiter un serveur Web hors connexion et sans frais de communication. Le navigateur Web et le serveur Web tournent alors sur le m&ecirc;me ordinateur et peuvent donc communiquer entre eux comme lors de liaisons connect&eacute;es sur Internet.</p>

<p>Dans le contexte trait&eacute; ici, il est recommand&eacute; d'installer votre propre serveur Web afin de disposer localement sur votre ordinateur d'un port CGI. Car CGI ne fonctionne que si un serveur Web existe. Vous pouvez alors r&eacute;aliser localement sur votre propre ordinateur beaucoup de ce qui est possible sur le Web avec CGI. Ainsi vous pouvez tester vos propres scripts CGI pendant la phase de conception - dans le calme et sans frais de connexion. Vous pouvez alors travailler exactement comme vous y &ecirc;tes habitu&eacute;s avec les fichiers HTML et les JavaScripts. En outre, vous appr&eacute;hendez plus vite les rapports existant entre le navigateur WWW et le serveur Web .</p>

<p>M&ecirc;me si vous &ecirc;tes vous-m&ecirc;me fournisseur d'acc&egrave;s et poss&eacute;dez une liaison permanente sur Internet et que vous exploitez un serveur Web public, il est judicieux d'installer sur un ordinateur s&eacute;par&eacute; un serveur Web local. Ainsi l'ordinateur public n'est pas surcharg&eacute; pendant que vous concevez et testez vos scripts CGI.</p>

<p>Un serveur WWW install&eacute; localement ne nuit pas &agrave; votre acc&egrave;s Internet existant. Il n'utilise en fin de compte que le protocole TCP/IP de votre ordinateur (par exemple le <var>winsock.dll</var>). Les r&eacute;glages qui sont importants pour votre connexion sur Internet n'ont aucune influence sur le serveur Web et peuvent demeurer inchang&eacute;s.</p>

<p>Un serveur Web install&eacute; peut &ecirc;tre joint par le Web lorsqu'une connexion Internet est &eacute;tablie, dans la mesure o&ugrave; vous n'utilisez pas l'ordinateur dans un r&eacute;seau local prot&eacute;g&eacute; et que vous n'avez pas install&eacute; un logiciel de protection suppl&eacute;mentaire (logiciel pare-feu). Car pour chaque connexion &agrave; Internet, vous entrez avec une adresse IP claire et sans ambigu&iuml;t&eacute;. Soit vous avez re&ccedil;u de votre fournisseur d'acc&egrave;s une adresse IP fixe, soit l'adresse IP vous est attribu&eacute;e de fa&ccedil;on dynamique lors de votre connexion &agrave; Internet par le serveur. Sous Windows MS, vous pouvez, lorsque vous &ecirc;tes connect&eacute; &agrave; Internet, appeler le programme <var>winipcfg.exe</var> dans le r&eacute;pertoire Windows pour conna&icirc;tre votre propre adresse IP. &Agrave; supposer que vous soyez connect&eacute;s avec l'adresse IP <var>145.233.101.211</var>t, alors, votre r&eacute;seau local, quand le serveur Web tourne peut &ecirc;tre joint sur Internet &agrave; l'adresse <var>http://145.233.101.211/</var>. Cette adresse doit naturellement d'abord &ecirc;tre connue de l'utilisateur ext&eacute;rieur. Mais s'il la conna&icirc;t ou la trouve, il peut alors &quot;surfer&quot; sur votre PC dans le domaine des r&eacute;pertoires, qui est fix&eacute; par le serveur Web. Cela pr&eacute;sente des avantages et des inconv&eacute;nients. D'un c&ocirc;t&eacute; vous pouvez ainsi montrer vos pages Web &agrave; d'autres personnes, sans qu'il soit n&eacute;cessaire de les transmettre au serveur public. D'un autre c&ocirc;t&eacute;, un visiteur ind&eacute;sirable pourrait essayer de mettre le nez partout sur votre ordinateur.</p>





<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="produits">Produits appropri&eacute;s</a></h2>

<p>Heureusement, il existe sur Internet diff&eacute;rents serveurs Web &agrave; t&eacute;l&eacute;charger qui sont soit des gratuiciels , soit des partagiciels c'est &agrave; dire des produits qui ne co&ucirc;tent rien ou r&eacute;clament apr&egrave;s une phase de test gratuite, une taxe d'enregistrement minime. Pour la mise en service locale, de tels produite sont amplement suffisants. Le choix suivant n'est pas complet mais se limite &agrave; des produits particuli&egrave;rement bien appropri&eacute;s. Le serveur Web le plus r&eacute;pandu sur Internet <b>Apache</b> est entre-temps &eacute;galement disponible pour des syst&egrave;mes d'exploitation typiques tels que MS Windows. Consid&eacute;rant que ce produit remplit son office entre-temps sur la plupart des serveurs sur Internet, Il est bien le produit &agrave; recommander le plus vivement.</p>

<p>Dans l'index des liens de l'offre en ligne de SELFHTML actuel, vous trouverez un r&eacute;capitulatif des produits avec des liens &agrave; leurs fournisseurs:</p>

<p><img src="../../src/serverdoc.gif" width="15" height="10" border="0" alt="Page d'information: connexion exig&eacute;e">&nbsp;<a target="_top" href="http://www.selfhtml.com.fr/liens/logiciels_server.htm"><b>SELFHTML index des liens: logiciels serveur</b></a></p>

<p>En r&egrave;gle g&eacute;n&eacute;rale, vous pouvez charger les produits sur les pages des fournisseurs.</p>



<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="reglages_base">R&eacute;glages de base pour une utilisation locale</a></h2>

<p>Un serveur WWW n'est pas un programme avec une &quot;surface de travail&quot;. Par l'appel du programme ex&eacute;cutable vous d&eacute;marrez seulement le fonctionnement du serveur. Votre navigateur WWW est alors en mesure de communiquer avec ce serveur sur votre ordinateur, exactement comme il le ferait avec un serveur public sur le WWW. Pour que cela fonctionne correctement, vous devez cependant installer le serveur WWW, c'est &agrave; dire entreprendre des r&eacute;glages de base importants.</p>

<p>Quelques serveurs Web peuvent &ecirc;tre install&eacute;s apr&egrave;s le d&eacute;marrage avec des boites de dialogue (par exemple OmniHTTPd pour Windows ou Quid Pro Quo pour Macintosh), pour d'autres produits vous installez le serveur Web avant le d&eacute;part en &eacute;ditant les fichiers de configuration (par exemple pour Apache le fichier <var>httpd.conf</var> du sous r&eacute;pertoire de programme <var>conf</var>).  Certains produits tournent sous MS-Windows dans une fen&ecirc;tre DOS (par exemple Apache). En cas de doute, recherchez les fichiers d'aide &agrave; l'installation du serveur Web dans le r&eacute;pertoire de celui-ci. L&agrave; devrait &ecirc;tre document&eacute;e la fa&ccedil;on d'installer votre serveur Web. Tous les r&eacute;glages restent sauvegard&eacute;s dans tous les cas. Quand votre serveur WWW fonctionne, il ne vous reste qu'&agrave; l'allumer et l'&eacute;teindre en d&eacute;marrant et en arr&ecirc;tant le fichier programme.</p>

<p>Vous devez r&eacute;gler les donn&eacute;es importantes suivantes &agrave; souhait voire correctement:</p>
<ul>
<li><b>adresse IP et nom d'h&ocirc;te du serveur</b><br>
Pour une exploitation locale, vous devez normalement porter ici l'adresse IP r&eacute;serv&eacute;e <kbd>127.0.0.1</kbd> ou l'adresse nominale <kbd>localhost</kbd>. Si aucune des deux mentions ne fonctionne, essayez de trouver des informations dans les fichiers d'aide, ou mettez vous en relation avec le fournisseur de produit du serveur Web en visitant sa page d'accueil (cherchez l'adresse &eacute;lectronique!). Si les mentions fonctionnent, vous pouvez, apr&egrave;s avoir allum&eacute; le serveur WWW local, appeler par l'adresse Internet <var>http://127.0.0.1/</var> ou <var>http://localhost/</var> des fichiers HTML, qui se trouvent sur votre ordinateur, dans votre navigateur Web.</li>
<li><b>port du Serveur</b><br>
L&agrave;, il faut normalement porter <kbd>80</kbd>. Les ports sont des num&eacute;ros pour des services TCP/IP sur l'ordinateur concern&eacute;. Pour des services utilis&eacute;s souvent, sont fix&eacute;s ce qu'on appelle les <i>Well Known Ports</i> (ports bien connus). Ce qui veut dire que ces num&eacute;ros de port sont utilis&eacute;s comme num&eacute;ros standard par les clients comme les navigateurs Web ou les programmes FTP dans la mesure ou rien d'autre n'est sp&eacute;cifi&eacute;. Pour le service FTP, ce sont par exemple les num&eacute;ros de port habituels 20 et 21, pour le service HTTP, c'est le 80. Reportez vous cependant, par mesure de pr&eacute;caution, &agrave; la documentation du serveur WWW pour savoir le num&eacute;ro qu'il vous faut indiquer ici.</li>
<li><b>r&eacute;pertoire principal pour fichiers HTML</b> (<i>document root</i>)<br>
L&agrave;, vous mentionnez conform&eacute;ment &agrave; la syntaxe du syst&egrave;me d'exploitation, le nom de chemin o&ugrave; se trouvent vos fichiers HTML locaux. Si par exemple vous utilisez MS Windows, vous pourriez entrer ici par exemple <kbd>c:\www\donn&eacute;es</kbd> - selon l'endroit ou vous avez plac&eacute; votre page d'accueil HTML locale. Si par exemple vous avez dans le r&eacute;pertoire principal un fichier nomm&eacute; <var>myhome.htm</var>, vous pouvez appelez ce fichier dans votre navigateur WWW, quand le serveur est allum&eacute;, par le protocole HTTP en entrant <var>http://127.0.0.1/myhome.htm</var> ou <var>http://localhost/myhome.htm</var>.</li>
<li><b>nom de fichier HTML par d&eacute;faut pour r&eacute;pertoire</b><br>
Les noms les plus courants sont <kbd>index.html</kbd> ou <kbd>index.htm</kbd>. Si un fichier HTML de ce nom se trouve  dans le r&eacute;pertoire, il suffit de mentionner comme adresse URI par exemple <var>http://127.0.0.1/repertoire/</var>: c'est <var>http://127.0.0.1/repertoire/index.html</var> qui sera appel&eacute; automatiquement.</li>
<li><b>r&eacute;pertoire principal et r&eacute;pertoire virtuel pour scripts CGI</b><br>
Comme r&eacute;pertoire principal vous mentionnez conform&eacute;ment &agrave; la syntaxe du syst&egrave;me d'exploitation, le nom de chemin du r&eacute;pertoire dans lequel vous voulez sauvegarder vos scripts CGI ex&eacute;cutables. Le nom habituel de r&eacute;pertoire est: <kbd>/cgi-bin</kbd>. Si par exemple vous utilisez MS Windows, vous pourriez entrer ici par exemple <kbd>c:\www\cgi-bin</kbd> - selon l'endroit o&ugrave; vous voulez sauvegarder les scripts CGI. Vous devez cr&eacute;er le r&eacute;pertoire correspondant. D'autre part, pour la plupart des serveurs WWW, il vous faut mentionner un r&eacute;pertoire CGI virtuel: Mentionnez pour le mieux <var>cgi-bin</var>. Si par exemple vous sauvegardez par la suite un script Perl nomm&eacute; <var>guestbook.pl</var> dans votre r&eacute;pertoire <var>c:\www\cgi-bin</var>, vous pouvez alors l'ex&eacute;cuter avec <var>http://127.0.0.1/cgi-bin/guestbook.pl</var> ou bien <var>http://localhost/cgi-bin/guestbook.pl</var>.</li>
<li><b>interpr&eacute;teur Perl et autres interpr&eacute;teurs</b><br>
Pour pouvoir ex&eacute;cuter des scripts Perl en tant que scripts CGI, vous devez mentionner le nom de chemin complet du fichier ex&eacute;cutable de l'interpr&eacute;teur Perl. Sous MS-Windows vous devez par exemple entrer <kbd>c:\programme\perl\bin\perl.exe</kbd>, selon l'endroit o&ugrave; se trouve le fichier programme ex&eacute;cutable. Pour cela il vous faut <img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="ordiperl.htm"><b>installer Perl ou l'interpr&eacute;teur Perl</b></a>.</li>
<li><b>fichiers Log</b><br>
La plupart des serveurs WWW tiennent des &quot;fichiers Log&quot; sur tous les acc&egrave;s HTTP &agrave; des fichiers ou des programmes CGI. Ce sont les  <img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="../../projet/controler.htm#logdateien"><b>fichiers Log</b></a> standard. Il existe trois fichiers Log importants: un pour le protocole des acc&egrave;s (<var>access.log</var>), un pour le protocole des adresses d'origine (<var>referrer.log</var>), et un pour le protocole d'erreurs (<var>error.log</var>). Entrez de pr&eacute;f&eacute;rence ces noms typiques. Vous pouvez d'ailleurs appeler &agrave; tout moment ces fichiers avec l'aper&ccedil;u rapide ou l'&eacute;diteur de texte.</li>
<li><b>Timeouts</b><br>
Il existe des valeurs limite de temps qui fixent combien de temps le navigateur Web doit attendre la r&eacute;ponse du serveur et combien de temps le serveur doit essayer d'envoyer des donn&eacute;es au navigateur WWW. Les mentions se font en r&egrave;gle g&eacute;n&eacute;rale sous forme de secondes. Entrez par exemple pour envoi et r&eacute;ception <kbd>60</kbd> (= une minute).</li>
<li><b>types Mime</b><br>
Les <img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="../../divers/typesmime.htm"><b>types Mime</b></a> fixent dans ce contexte les formats de fichier que le serveur Web conna&icirc;t et qu'il est pr&ecirc;t &agrave; transmettre au navigateur WWW qui appelle. Des types de fichiers autres que ceux qui sont mentionn&eacute;s ici ne seront pas envoy&eacute;s par le serveur ou le feront avec le tape Mime standard (<code>text/plain</code> par exemple). Normalement, tous les types de fichiers importants sont d&eacute;j&agrave; pr&eacute;-configur&eacute;s. Pour ajouter un type de fichier d&eacute;termin&eacute; (par exemple des fichiers Excel), vous devez mentionner le nom du type Mime (par exemple <kbd>application/ms-excel</kbd>)) et une extension typique du nom de fichier (par exemple <kbd>.xls</kbd>). Alors le serveur sera pr&ecirc;t &agrave; transmettre ce genre de fichier au navigateur Web. Le navigateur doit &eacute;videmment savoir ce qu'il doit faire avec le type de fichier concern&eacute; (voir &agrave; ce sujet la partie sur les <img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="../../html/liens/types_fichiers.htm#beliebig"><b>liens &agrave; des fichiers de votre choix sur Internet</b></a>).</li>
</ul>

<p>Il y a d'autres possibilit&eacute;s de r&eacute;glage. Mais si vous avez ex&eacute;cut&eacute; correctement les r&eacute;glages mentionn&eacute;s ci-dessus, le serveur Web devrait &ecirc;tre pr&ecirc;t pour une utilisation locale.</p>







<table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr><td colspan="2" bgcolor="#EEEEEE" class="doc">
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a>
</td></tr>
<tr><td bgcolor="#EEEEEE" class="doc" align="right"><a href="ordiperl.htm"><img src="../../src/suivant.gif" width="10" height="10" border="0" hspace="10" alt="page suivante"></a></td>
<td bgcolor="#FFFFFF"><img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information"> <a href="ordiperl.htm"><b>  Installer Perl localement sur un ordinateur personnel</b></a>
</td></tr>
<tr>
<td bgcolor="#EEEEEE" class="doc" align="right"><a href="cgihtml.htm"><img src="../../src/precedent.gif" width="10" height="10" border="0" hspace="10" alt="page pr&eacute;c&eacute;dente"></a></td>
<td bgcolor="#FFFFFF" width="100%"><img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information"> <a href="cgihtml.htm"><b>CGI et HTML</b></a>
</td>
</tr>
<tr><td colspan="2" bgcolor="#EEEEEE" class="doc">&#160;</td></tr>
</table><table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr>
<td bgcolor="#FFEEDD" class="nav"><a class="an" name="bottom"><img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"></a> <a href="../../index.htm"><b>SELFHTML</b></a>/<a href="../../navigation/index.htm" target="_parent">Aides &agrave; la navigation</a> <img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="../index.htm"><b>CGI/Perl</b></a> <img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="index.htm"><b>Introduction</b></a></td>
</tr>
</table>

<p>&copy; 2001 Stefan M&uuml;nz / &copy; 2003 Traduction <img src="../../src/courriel.gif" width="15" height="10" border="0" alt="Adresse &eacute;lectronique">&nbsp;<a href="mailto:13405@free.fr">Serge Fran&ccedil;ois, 13405@free.fr</a><br><img src="../../src/courriel.gif" width="15" height="10" border="0" alt="Adresse &eacute;lectronique">&nbsp;<a href="mailto:selfhtml@selfhtml.com.fr">selfhtml@selfhtml.com.fr</a></p>



</body>
</html>
