<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>SELFHTML: Introduction / Hypertexte / Hypertexte et compr&eacute;hension humaine</title>
<link rel="stylesheet" type="text/css" href="../../src/selfhtml.css">
<meta name="description"    content="Quelles chances a l'hypertexte pour la perception humaine de l'information et quels sont les probl&egrave;mes.">
<meta name="keywords"       content="SELFHTML, Hypertexte">
<meta name="author"         content="Stefan M&uuml;nz, selfhtml@teamone.de">
<meta http-equiv="content-type" content="text/html; charset=ISO-8859-1">
<meta name="DC.Publisher"   content="Serge Fran&ccedil;ois, selfhtml@selfhtml.com.fr">
<meta name="DC.Date"        content="2003-01-27T08:00+00:00">
<meta name="DC.Identifier"  content="http://selfhtml.selfhtml.com.fr/introduction/hypertexte/comprendre.htm">
<meta name="DC.Language"    content="fr">
<meta name="DC.Rights"      content="../../editorial/copyright.htm">
<meta name="DC.Date.Create" content="2003-01-27T08:00+00:00">
<meta name="SELF.Version"   content="1">
<meta name="SELF.Pagetype"  content="Information">
<meta name="SELF.Path"      content="SELFHTML == ../../index.htm // Introduction == ../index.htm // Hypertexte == index.htm">
<!-- Matomo -->
<script type="text/javascript">
  var _paq = window._paq = window._paq || [];
  /* tracker methods like "setCustomDimension" should be called before "trackPageView" */
  _paq.push(['trackPageView']);
  _paq.push(['enableLinkTracking']);
  (function() {
    var u="//matomo.boitasite.com/";
    _paq.push(['setTrackerUrl', u+'matomo.php']);
    _paq.push(['setSiteId', '1']);
    var d=document, g=d.createElement('script'), s=d.getElementsByTagName('script')[0];
    g.type='text/javascript'; g.async=true; g.src=u+'matomo.js'; s.parentNode.insertBefore(g,s);
  })();
</script>
<!-- End Matomo Code -->
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#AA5522" vlink="#772200" alink="#000000">

<table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr>
<td bgcolor="#FFEEDD" class="nav"><a class="an" name="top"><img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"></a> <a href="../../index.htm"><b>SELFHTML</b></a>/<a href="../../navigation/index.htm" target="_parent">Aides &agrave; la navigation</a> <img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="../index.htm"><b>Introduction</b></a> <img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="index.htm"><b>Hypertexte</b></a></td>
</tr>
</table><table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr>
<td bgcolor="#EEEEEE" class="doc" width="110"><img src="../../src/logo.gif" width="106" height="109" border="0" alt="SELFHTML"></td>
<td bgcolor="#EEEEEE" class="doc" valign="bottom" width="100%"><h2>Hypertexte et compr&eacute;hension humaine</h2>
<tr>
<td bgcolor="#EEEEEE" class="doc" valign="top" align="center">
<img src="../../src/docx.gif" width="30" height="20" vspace="6" border="0" alt="Page d'information: vue d'ensemble">
</td>
<td bgcolor="#FFFFFF" valign="top" nowrap>
<p>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#textes_relies"><b>Des textes reli&eacute;s pour une pens&eacute;e associative</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#conflits_dintegration"><b>Conflit d'int&eacute;gration pour les &quot;r&eacute;seau &agrave; r&eacute;seau&quot;</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#interaction"><b>Interaction et espace de r&eacute;action</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#incontrole"><b>Prise d'information non contr&ocirc;l&eacute;e</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#cent_mille"><b>&quot;Du centi&egrave;me au milli&egrave;me&quot;: avantages et inconv&eacute;nients</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#etudes"><b>&Eacute;tudes sur l'hypertexte</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#resume"><b>R&eacute;sum&eacute;: Hypertexte et compr&eacute;hension humaine</b></a><br>
</p>
</td>
</tr><tr><td colspan="2" bgcolor="#EEEEEE" class="doc">&#160;<a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;</td></tr>
</table>



<h2 class="Sh2"><a class="an" name="textes_relies">Des textes reli&eacute;s pour une pens&eacute;e associative</a></h2>

<p><cite>&quot;L'hypertexte donne l'impression, &agrave; supposer qu'il soit cr&eacute;dible pour acc&eacute;der &agrave; la connaissance, que le savoir... dans l'esprit humain est organis&eacute; en structures non-lin&eacute;aires topologiques reli&eacute;es entre elles. Sous ces conditions, l'appr&eacute;hension du savoir par une forme d'organisation comparable telle qu'elle est offerte par l'hypertexte, pourrait &ecirc;tre plus efficace qu'une appr&eacute;hension faisant le 'd&eacute;tour' par des formes de pr&eacute;sentation lin&eacute;aires (conf&eacute;rences, textes)&quot;</cite> (<img src="../../src/docf.gif" width="15" height="10" border="0" alt="D&eacute;monstration - nouvelle fen&ecirc;tre">&nbsp;<a href="../../sources/kuhlen.htm" target="_blank"><b>Kuhlen</b></a>, page 182).</p>

<p>Si l'&eacute;tudiant, c'est l'argumentation, fait la connaissance d'un nouvel &eacute;l&eacute;ment de connaissance dans un environnement relationnel il verra plus facilement o&ugrave; cet &eacute;l&eacute;ment de connaissance se place dans ses propres connaissances relationnelles. Si par exemple, &agrave; partir de l'&eacute;l&eacute;ment de connaissance isol&eacute; &quot;t&eacute;nia&quot; des liens m&egrave;nent &agrave; &quot;vers en g&eacute;n&eacute;ral&quot;, &quot;h&ocirc;tes et parasites&quot;, &quot;vers chez l'homme&quot;, &quot;tournis&quot; et &quot;maladies occasionn&eacute;es par les vers en g&eacute;n&eacute;ral&quot;, ces liens aident &agrave; classer le &quot;t&eacute;nia&quot; dans les connaissances d&eacute;j&agrave; acquises.</p>






<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="conflits_dintegration">Conflit d'int&eacute;gration pour les &quot;r&eacute;seau &agrave; r&eacute;seau&quot;</a></h2>

<p>Contrant cette supposition selon laquelle une pr&eacute;sentation relationnelle des connaissances facilite leur appr&eacute;hension, deux arguments sont avanc&eacute;s:</p>

<p>Le premier de ces arguments est que le lecteur d'hypertexte doit d'abord construire sa voie de lecture lui-m&ecirc;me ce qui lui co&ucirc;te en temps et en &eacute;nergie. Pour cela l'appr&eacute;hension de la connaissance ne fonctionne finalement pas autrement qu'avec du texte &quot;ordinaire&quot;: elle <cite>&quot;a lieu..., &eacute;galement par la navigation en hypertexte dans une s&eacute;rie s&eacute;quentielle dans le temps, de telle mani&egrave;re que chaque chemin de fait est, cependant, en fin de compte lin&eacute;aire&quot;</cite> (<img src="../../src/docf.gif" width="15" height="10" border="0" alt="D&eacute;monstration - nouvelle fen&ecirc;tre">&nbsp;<a href="../../sources/kuhlen.htm" target="_blank"><b>Kuhlen</b></a>, page 56) - voir &eacute;galement &agrave; ce sujet le th&egrave;me <img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="terminologie.htm#cohesion"><b>n:m-Relation, harmonie de la coh&eacute;sion</b></a>.</p>

<p>Le deuxi&egrave;me de ces arguments oppose que l'int&eacute;gration de connaissances relationnelles dans un r&eacute;seau de connaissances est justement plus probl&eacute;matique que l'int&eacute;gration de connaissances &quot;simples&quot; dans le r&eacute;seau de connaissances. Cela cache la supposition  <cite>&quot;que deux r&eacute;seaux d'autant plus quand ils sont structur&eacute;s de fa&ccedil;on  poly-hi&eacute;rarchique sont plus difficiles &agrave; int&eacute;grer qu'une structure lin&eacute;aire dans un r&eacute;seau existant&quot;</cite> (<img src="../../src/docf.gif" width="15" height="10" border="0" alt="D&eacute;monstration - nouvelle fen&ecirc;tre">&nbsp;<a href="../../sources/kuhlen.htm" target="_blank"><b>Kuhlen</b></a>, page 56).</p>





<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="interaction">Interaction et espace de r&eacute;action</a></h2>

<p>Des hypertextes finement structur&eacute;s offrent la possibilit&eacute; de communiquer l'information non seulement d'une fa&ccedil;on, mais de diff&eacute;rentes fa&ccedil;ons, sur diff&eacute;rents niveaux et dans diff&eacute;rents contextes. Le lecteur hypertexte, et c'est l'argumentation, n'a pas d'espace de r&eacute;action lors de l'appr&eacute;hension de l'information. En faisant un agrandissement sur des (<img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="terminologie.htm#fish_eye_views"><b>visualisations &#339;il de poisson</b></a>), dans une navigation sans contraintes (&quot;furetage&quot;), des <img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="terminologie.htm#visualisations_web"><b>Visualisations Web</b></a> etc. il peut de fa&ccedil;on interactive avec le syst&egrave;me hypertexte, essayer plusieurs strat&eacute;gies pour arriver &agrave; l'effet d'int&eacute;r&ecirc;t d&eacute;sir&eacute; lors des processus de compr&eacute;hension.</p>

<p>Car chacun conna&icirc;t cet effet: on ne comprend pas quelque chose, bien que ce soit expliqu&eacute; explicitement. Et brusquement, on le comprend - sans beaucoup d'explications, simplement parce que l'on a trouv&eacute; le rapport cherch&eacute;, le mot-cl&eacute; manquant, la place exacte pour ranger dans sa propre m&eacute;moire. .</p>





<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="incontrole">Prise d'information non contr&ocirc;l&eacute;e</a></h2>

<p>Oppos&eacute; &agrave; la pluralit&eacute; de vues et &agrave; la multitude d'offres en hypertexte on avance l'argument contradictoire suivant, en rapport avec l'acquisition de connaissances: L'&eacute;tudiant se trouve dans un <cite>&quot;&eacute;tat de connaissances anormal&quot;</cite> (Brooks). Dans cette situation inconfortable, l'offre d'une navigation libre est particuli&egrave;rement d&eacute;plac&eacute;e. Pr&eacute;cis&eacute;ment dans cet &eacute;tat o&ugrave; se trouve l'&eacute;tudiant qui ne domine pas encore le sujet, qui n'en comprend pas grand chose et qui ne peut pas encore d&eacute;cider quelle information est importante et quelle autre ne l'est pas, le m&eacute;dia qui transmet ( instituteur, professeur ou livre) doit prendre le contr&ocirc;le. L'hypertexte invite &agrave; la libre navigation, et par l&agrave;-m&ecirc;me &agrave; la distraction et &agrave; la prise d'information non contr&ocirc;l&eacute;e.</p>





<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="cent_mille">&quot;Du centi&egrave;me au milli&egrave;me&quot;: avantages et inconv&eacute;nients</a></h2>

<p>&quot;Du centi&egrave;me au milli&egrave;me&quot; est une expression avec une connotation n&eacute;gative. Au figur&eacute; cependant, cette expression signifie simplement suivre le libre cours de ses pens&eacute;es sans lui imposer de barri&egrave;res rationnelles ou autres. L'hypertexte soutient cette fa&ccedil;on de penser.</p>

<p>Cette fa&ccedil;on de penser semble pr&eacute;senter des avantages dans deux cas::</p>

<p>1. Avant d'aborder un nouveau domaine. Dans ce cas, la navigation libre soutient l'&eacute;veil de l'int&eacute;r&ecirc;t et ainsi la disponibilit&eacute; intellectuelle de s'y plonger davantage.</p>

<p>2. &Agrave; un stade avanc&eacute; de la connaissance. Celui qui s'y conna&icirc;t d&eacute;j&agrave; dans un domaine, pourra utiliser les possibilit&eacute;s de l'hypertexte &agrave; bon escient et avec ma&icirc;trise, &eacute;tant donn&eacute; qu'il sait ce qu'il cherche quand il utilise un tel syst&egrave;me.</p>

<p>La fa&ccedil;on de penser favoris&eacute;e par l'hypertexte constitue un inconv&eacute;nient alors que l'appr&eacute;hension concentr&eacute;e du savoir dans la phase d'apprentissage, pendant cette phase dans laquelle celui qui apprend se fait des mod&egrave;les mentaux &agrave; partir des connaissances acquises. &Agrave; ce stade la distraction ou la richesse de l'offre ne sont que des freins. Pour soutenir cette phase d'appr&eacute;hension de la connaissance &eacute;lectroniquement, l'hypertexte peut certes proposer le syst&egrave;me des <img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="terminologie.htm#guided_tours"><b>visites guid&eacute;es</b></a>.</p>





<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="etudes">&Eacute;tudes sur l'hypertexte</a></h2>

<p>L'&eacute;tude de Schnotz (1987) examine l'effet de textes continus par opposition aux textes discontinus sur le succ&egrave;s de l'enseignement. Le savoir transmis dans les deux cas &eacute;tait le m&ecirc;me. Dans les textes discontinus le contexte a &eacute;t&eacute; supprim&eacute;, c'est &agrave; dire toutes les structures de liaison ou d'argumentation. L'&eacute;tude conduite sur 34 &eacute;tudiants, conclut que l'information globale par des textes continus avait tendance &agrave; mieux passer que par la version discontinue.  Une pond&eacute;ration des r&eacute;sultats prouva que: Les personnes ayant des connaissances pr&eacute;alables &eacute;lev&eacute;es tirent grand profit des textes discontinus. Les personnes aux connaissances plus faibles privil&eacute;gient sans conteste les textes continus. L'&eacute;tude de Schnotz n'avait cependant pas &eacute;t&eacute; faite pour comparer l'hypertexte au texte. La performance consistant &agrave; cr&eacute;er la coh&eacute;sion et la continuit&eacute; par les liens en hypertexte n'a pas &eacute;t&eacute; prise en consid&eacute;ration. En transposant sur de la documentation technique, on pourrait dire que l'&eacute;tude a plut&ocirc;t examin&eacute; la diff&eacute;rence entre didacticiel et ouvrage de r&eacute;f&eacute;rence.</p>

<p>L'&eacute;tude Intermedia (1987) se r&eacute;f&egrave;re &agrave; deux cours, un sur la litt&eacute;rature anglaise, et un autre sur la m&eacute;decine biologique. Pour les deux cours, le support de cours a &eacute;t&eacute; organis&eacute; en hypertexte avec le logiciel <i>Interm&eacute;dia</i>. Les r&eacute;sultats de l'&eacute;tude ne visaient pas &agrave; quantifier les r&eacute;sultats de l'enseignement mais &agrave; &eacute;valuer les opinions des &eacute;tudiants questionn&eacute;s. Le soutien par hypertexte fut consid&eacute;r&eacute; globalement comme meilleur qu'un support de cours traditionnel. La vari&eacute;t&eacute; montre en tous cas que les qualificatifs de &quot;meilleur&quot; &agrave;  &quot;pire&quot; suffisent. Chez les m&eacute;decins biologistes, l'&eacute;cho &eacute;tait plus favorable que chez les &eacute;tudiants en litt&eacute;rature. D'apr&egrave;s les assertions des enseignants, les r&eacute;sultats lors des examens de l'examen final ont &eacute;t&eacute; sensiblement plus &eacute;lev&eacute;s.</p>

<p>Autres &eacute;tudes sur le th&egrave;me:</p>

<ul>
<li>Gordon entre autres pr&eacute;senta en 1988 &agrave; 24 &eacute;tudiants en tout, des textes techniques &agrave; l'&eacute;cran et cela respectivement dans une version lin&eacute;aire et dans une version non-lin&eacute;aire. Les tests sur les faits m&eacute;moris&eacute;s, donn&egrave;rent une pr&eacute;f&eacute;rence pour la repr&eacute;sentation lin&eacute;aire.</li>
<li>McKnight/Dillon/Richardson pr&eacute;sent&egrave;rent &agrave; des volontaires un texte (&quot;HYPTEXTduction to wines&quot;) en 4 Versions: 2 lin&eacute;aires (papier et &eacute;diteur de texte) ainsi que 2 non-lin&eacute;aires (produits logiciels hypertexte <i>HyperTIES</i> et <i>Hypercard</i>). Les tests sur les faits m&eacute;moris&eacute;s donn&egrave;rent ici aussi une pr&eacute;f&eacute;rence &agrave; la pr&eacute;sentation de texte lin&eacute;aire.</li>
<li>D'autres &eacute;tudes de Allinson/Hammond (1988/89) et de Vickers/Gaines (1988) examinent la question de savoir comment une base en hypertexte doit &ecirc;tre cr&eacute;&eacute;e pour pour soutenir l'enseignement de fa&ccedil;on efficace.</li>
</ul>




<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="resume">R&eacute;sum&eacute;: Hypertexte et compr&eacute;hension humaine</a></h2>

<p>Une sur&eacute;l&eacute;vation na&iuml;ve de l'hypertexte est certainement infond&eacute;e. Tous les arguments en faveur du nouveau m&eacute;dia peuvent &ecirc;tre r&eacute;fut&eacute;s. Des &eacute;tudes empiriques donnent un tableau uniforme: en partie en faveur de l'hypertexte, en partie en faveur de repr&eacute;sentation lin&eacute;aire du savoir.</p>

<p>La mise en &#339;uvre de l'hypertexte actuellement se fait avec le plus de succ&egrave;s pour la documentation technique . Ce n'est pas autrement surprenant, car la documentation technique est un genre de litt&eacute;rature que peu lisent volontiers de son plein gr&eacute; de la premi&egrave;re &agrave; la derni&egrave;re page. M&ecirc;me dans ce document que vous &ecirc;tes en train de lire, vous trouverez des chapitres que vous ne lirez certainement pas comme vous le faites ici avec l'introduction. L'hypertexte met toujours ses forces en valeur quand le contenu &agrave; repr&eacute;senter peut &ecirc;tre fragment&eacute; judicieusement. Une fragmentation brutale de n'importe quel contenu selon le pr&eacute;cepte &quot;mais il faut pourtant que ce soit de l'hypertexte!&quot; manquera par contre son but. HTML, le format de base des pages Web, ne leur impose pas une fragmentation brutale mais le leur permet cependant. En ce sens, vous &ecirc;tes libre de la r&eacute;partition de l'information et pouvez d&eacute;cider vous-m&ecirc;me dans quelle mesure vous fragmentez les contenus. Le genre des contenus respectifs doit en &ecirc;tre l'&eacute;l&eacute;ment d&eacute;terminant. Si les contenus peuvent &ecirc;tre fragment&eacute;s facilement, alors la cr&eacute;ation Web de tels contenus doit exploiter la fragmentation et la mise en relation des &eacute;l&eacute;ments. Pour des contenus qui ne se laissent pas fragmenter judicieusement, un texte peut alors bien rester un texte d'un seul tenant.</p>







<table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr><td colspan="2" bgcolor="#EEEEEE" class="doc">
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a>
</td></tr>
<tr><td bgcolor="#EEEEEE" class="doc" align="right"><a href="../../html/generalites/marquertexte.htm"><img src="../../src/suivant.gif" width="10" height="10" border="0" hspace="10" alt="page suivante"></a></td>
<td bgcolor="#FFFFFF"><img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information"> <a href="../../html/generalites/marquertexte.htm"><b>Marquage de texte</b></a>
</td></tr>
<tr>
<td bgcolor="#EEEEEE" class="doc" align="right"><a href="histoire.htm"><img src="../../src/precedent.gif" width="10" height="10" border="0" hspace="10" alt="page pr&eacute;c&eacute;dente"></a></td>
<td bgcolor="#FFFFFF" width="100%"><img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information"> <a href="histoire.htm"><b>Histoire de l'hypertexte</b></a>
</td>
</tr>
<tr><td colspan="2" bgcolor="#EEEEEE" class="doc">&#160;</td></tr>
</table><table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr>
<td bgcolor="#FFEEDD" class="nav"><a class="an" name="bottom"><img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"></a> <a href="../../index.htm"><b>SELFHTML</b></a>/<a href="../../navigation/index.htm" target="_parent">Aides &agrave; la navigation</a> <img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="../index.htm"><b>Introduction</b></a> <img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="index.htm"><b>Hypertexte</b></a></td>
</tr>
</table>

<p>&copy; 2001 Stefan M&uuml;nz / &copy; 2003 Traduction <img src="../../src/courriel.gif" width="15" height="10" border="0" alt="Adresse &eacute;lectronique">&nbsp;<a href="mailto:13405@free.fr">Serge Fran&ccedil;ois, 13405@free.fr</a><br><img src="../../src/courriel.gif" width="15" height="10" border="0" alt="Adresse &eacute;lectronique">&nbsp;<a href="mailto:selfhtml@selfhtml.com.fr">selfhtml@selfhtml.com.fr</a></p>



</body>
</html>
