<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>SELFHTML: Introduction / Hypertexte / D&eacute;finitions sur l' &quot;hypertexte&quot;</title>
<link rel="stylesheet" type="text/css" href="../../src/selfhtml.css">
<meta name="description"    content="Que faut-il entendre par hypertexte?.">
<meta name="keywords"       content="SELFHTML, Hypertexte, D&eacute;finitions hypertexte">
<meta name="author"         content="Stefan M&uuml;nz, selfhtml@teamone.de">
<meta http-equiv="content-type" content="text/html; charset=ISO-8859-1">
<meta name="DC.Publisher"   content="Serge Fran&ccedil;ois, selfhtml@selfhtml.com.fr">
<meta name="DC.Date"        content="2003-01-27T08:00+00:00">
<meta name="DC.Identifier"  content="http://selfhtml.selfhtml.com.fr/introduction/hypertexte/definitions.htm">
<meta name="DC.Language"    content="fr">
<meta name="DC.Rights"      content="../../editorial/copyright.htm">
<meta name="DC.Date.Create" content="2003-01-27T08:00+00:00">
<meta name="SELF.Version"   content="1">
<meta name="SELF.Pagetype"  content="Information">
<meta name="SELF.Path"      content="SELFHTML == ../../index.htm // Introduction == ../index.htm // Hypertexte == index.htm">
<!-- Matomo -->
<script type="text/javascript">
  var _paq = window._paq = window._paq || [];
  /* tracker methods like "setCustomDimension" should be called before "trackPageView" */
  _paq.push(['trackPageView']);
  _paq.push(['enableLinkTracking']);
  (function() {
    var u="//matomo.boitasite.com/";
    _paq.push(['setTrackerUrl', u+'matomo.php']);
    _paq.push(['setSiteId', '1']);
    var d=document, g=d.createElement('script'), s=d.getElementsByTagName('script')[0];
    g.type='text/javascript'; g.async=true; g.src=u+'matomo.js'; s.parentNode.insertBefore(g,s);
  })();
</script>
<!-- End Matomo Code -->
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#AA5522" vlink="#772200" alink="#000000">

<table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr>
<td bgcolor="#FFEEDD" class="nav"><a class="an" name="top"><img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"></a> <a href="../../index.htm"><b>SELFHTML</b></a>/<a href="../../navigation/index.htm" target="_parent">Aides &agrave; la navigation</a> <img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="../index.htm"><b>Introduction</b></a> <img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="index.htm"><b>Hypertexte</b></a></td>
</tr>
</table><table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr>
<td bgcolor="#EEEEEE" class="doc" width="110"><img src="../../src/logo.gif" width="106" height="109" border="0" alt="SELFHTML"></td>
<td bgcolor="#EEEEEE" class="doc" valign="bottom" width="100%"><h2>D&eacute;finitions sur l' &quot;hypertexte&quot;</h2>
<tr>
<td bgcolor="#EEEEEE" class="doc" valign="top" align="center">
<img src="../../src/docx.gif" width="30" height="20" vspace="6" border="0" alt="Page d'information: vue d'ensemble">
</td>
<td bgcolor="#FFFFFF" valign="top" nowrap>
<p>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#texte"><b>Hypertexte et texte</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#media"><b>Hypertexte, hyperm&eacute;dia et multim&eacute;dia</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#categories"><b>Hypertexte, chapitre, r&eacute;pertoires et liens crois&eacute;s</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#ordinateur"><b>Hypertexte, ordinateurs et r&eacute;seaux d'ordinateurs</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#positions"><b>Positions fondamentales sur l'hypertexte</b></a><br>
</p>
</td>
</tr><tr><td colspan="2" bgcolor="#EEEEEE" class="doc">&#160;<a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;</td></tr>
</table>



<h2 class="Sh2"><a class="an" name="texte">Hypertexte et texte</a></h2>

<p>Le texte est &eacute;crit et lu &quot;au fur et &agrave; mesure&quot;. Cette lin&eacute;arit&eacute; n'est pourtant pas inh&eacute;rente &agrave; la nature du m&eacute;dia &quot;texte&quot;, mais plut&ocirc;t &agrave; la nature des moyens de pr&eacute;sentation de texte utilis&eacute;s jusqu'alors. &Agrave; commencer par le rouleau de papyrus, jusqu'au livre moderne: Le texte est rang&eacute; comme si cela allait de soi comme un ver compos&eacute; de lettres sur une tige. Fr&eacute;d&eacute;ric Vester d&eacute;crit cela &agrave; la fin de son livre <img src="../../src/docf.gif" width="15" height="10" border="0" alt="D&eacute;monstration - nouvelle fen&ecirc;tre">&nbsp;<a href="../../sources/vester.htm" target="_blank"><b>La nouvelle contr&eacute;e de la pens&eacute;e</b></a> de la fa&ccedil;on suivante <cite>&quot; La disposition lin&eacute;aire d'un ver solitaire form&eacute; de lettres d'environ 1,9 kilom&egrave;tre de long dans le cas pr&eacute;sent, fait du m&eacute;dia  &#187;livre&#171; un instrument qui, tout comme le langage, n'est en fin de compte appropri&eacute; pour le th&egrave;me que je me suis
fix&eacute; que sous certaines r&eacute;serves. La tentative de donner une image globale de la r&eacute;alit&eacute; en r&eacute;seau, qui &agrave; vrai dire ne peut &ecirc;tre appr&eacute;hend&eacute;e que simultan&eacute;ment, ne peut qu'obligatoirement rester imparfaite.&quot;</cite></p>

<p>Sans s'appesantir sur le d&eacute;sespoir m&eacute;taphysique exprim&eacute; dans cette citation, on peut dire une chose: il y a une critique moderne de la lin&eacute;arit&eacute;. Pas forc&eacute;ment de la lin&eacute;arit&eacute; sur le plan de simples phrases ou passages, mais sur le plan d'un texte plus important compos&eacute; de nombreuses parties reconnaissables entre elles et qui en raison de son moyen de pr&eacute;sentation est condamn&eacute; &agrave; &ecirc;tre per&ccedil;u du d&eacute;but &agrave; la fin.</p>

<p>L'hypertexte est un moyen de pr&eacute;sentation non-lin&eacute;aire pour la pr&eacute;sentation de ce genre de textes. Au lieu du ver compos&eacute; de lettres entrent en sc&egrave;ne des <img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="terminologie.htm#unites"><b>unit&eacute;s</b></a> de texte reli&eacute;es entre elles. Par le soutien des ordinateurs, la d&eacute;pendance du texte purement lin&eacute;aire se r&eacute;duit. En poussant ces r&eacute;flexions plus loin, cela a suscit&eacute; l'espoir que l'on puisse mieux qu'auparavant adapter la r&eacute;daction et la lecture &agrave; la pens&eacute;e et &agrave; la compr&eacute;hension humaine.</p>





<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="media">Hypertexte, hyperm&eacute;dia et multim&eacute;dia</a></h2>

<p>L'hypertexte n'est rien d'autre que du texte. L'hypertexte est du texte comme il l'&eacute;tait avant, mais &ccedil;a n'est plus ce texte qui sugg&eacute;rait au lecteur par sa seule apparence, qu'il est oblig&eacute; de lire du d&eacute;but &agrave; la fin. L'information, le divertissement etc. sont aussi transmis par l'hypertexte. Parmi les m&eacute;dias, la tendance s'oriente vers des m&eacute;dias visuellement plus  accrocheurs par exemple des images, des vid&eacute;os et des mondes simul&eacute;s et anim&eacute;s. Le prolongement logique du d&eacute;veloppement de l'hypertexte est pour cette raison l' &quot;hyperm&eacute;dia&quot;. L'hyperm&eacute;dia est pourtant autre chose que le &quot;multim&eacute;dia&quot; qui est sur toutes les l&egrave;vres. Le &quot;multim&eacute;dia&quot;  ne signifie rien d'autre que: &quot;plusieurs m&eacute;dias en m&ecirc;me temps&quot;. L'&quot;hyperm&eacute;dia&quot; signifie quant &agrave; lui: &quot;plusieurs m&eacute;dias organis&eacute;s de la fa&ccedil;on que l'on conna&icirc;t dans l'hypertexte&quot;. Le pr&eacute;fixe &quot;Hyper-&quot; signifie ici une certaine fa&ccedil;on d'organiser. Cette mani&egrave;re d'organiser se distingue par la  <img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="terminologie.htm#fragmentation"><b>fragmentation</b></a> en unit&eacute;s distinctes d'un c&ocirc;t&eacute; et par une relation intelligente de ces unit&eacute;s entre elles de l'autre c&ocirc;t&eacute;.</p>

<p>Ce n'est pas la diff&eacute;rence entre l' &quot;hypertexte&quot; et l'  &quot;hyperm&eacute;dia&quot; qui est d&eacute;cisive, mais la diff&eacute;rence entre &quot;hyper-&quot; et &quot;multi-&quot;. Tout recevoir en une seule fois conduit en fin de compte &agrave; une submersion d'attraits Il est d&eacute;cisif pour celui qui re&ccedil;oit de tout recevoir de tout ainsi qu'il le d&eacute;sire pour chaque chose. C'est cette promesse que tentent de tenir l'hypertexte et l'hyperm&eacute;dia.</p>





<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="categories">Hypertexte, chapitre, r&eacute;pertoires et liens crois&eacute;s</a></h2>

<p>Les livres fortement structur&eacute;s contiennent en principe tout ce que l'hypertexte contient aussi: Des structures hi&eacute;rarchiques (chapitre et sous-chapitre), des &eacute;l&eacute;ments de relation (liens crois&eacute;s), ainsi que diff&eacute;rents acc&egrave;s &agrave; l'information (index du contenu, index des mots-cl&eacute;s). La diff&eacute;rence r&eacute;side dans la seule pr&eacute;sentation: Le livre &quot;incitera&quot; uniquement d'apr&egrave;s son apparence ext&eacute;rieure et ce, malgr&eacute; les caract&eacute;ristiques non-lin&eacute;aires de son contenu, &agrave; ce qu'on le lise de fa&ccedil;on lin&eacute;aire - &quot;page apr&egrave;s page&quot;. Pour les hypertextes pr&eacute;sent&eacute;s &agrave; l'&eacute;cran, cette &quot;recommandation&quot; implicite des livres dispara&icirc;t.</p>

<p>En caricaturant, on pourrait l'exprimer ainsi: Le texte dans des livres, m&ecirc;me fortement structur&eacute;s, on le lit; l'hypertexte par contre, on ne le lit pas, mais on y navigue. Si cette lecture est effectivement insuffisante, c'est une question &agrave; prendre absolument au s&eacute;rieux que le m&eacute;dia hypertexte doit se poser.</p>

<p>Il y a effectivement &eacute;galement des livres qui n'ont pas &agrave; &ecirc;tre lus du d&eacute;but &agrave; la fin. Les dictionnaires par exemple, ou m&ecirc;me les livres sp&eacute;cialis&eacute;s, faits davantage pour &ecirc;tre compuls&eacute;s. Et c'est justement avec ce genre de litt&eacute;rature que l'hypertexte, jusqu'ici, a fait ses preuves avec le plus de succ&egrave;s. Par contre on peut &agrave; peine s'imaginer l'hypertexte dans des genres litt&eacute;raires comme les ouvrages classiques ou les romans au fil conducteur bien clair. D'un autre c&ocirc;t&eacute;, la plupart des romans modernes justement, n'ont plus ce fil conducteur bien clair. Depuis au moins cent ans d&eacute;j&agrave; m&ecirc;me la litt&eacute;rature de bel esprit d&eacute;vie de la lin&eacute;arit&eacute;. De cette fa&ccedil;on, elle devient d&eacute;terminante pour l'hypertexte m&ecirc;me si dans ce domaine tout est encore plus dans la phase d'exp&eacute;rimentation.</p>






<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="ordinateur">Hypertexte, ordinateurs et r&eacute;seaux d'ordinateurs</a></h2>

<p>L'hypertexte aujourd'hui est r&eacute;alis&eacute; exclusivement sur ordinateurs, &eacute;tant donn&eacute; que ceux-ci soutiennent particuli&egrave;rement bien les exigences sp&eacute;cifiques de l'hypertexte. Il y eut pourtant dans le pass&eacute; &eacute;galement des tentatives pour r&eacute;aliser quelque chose comme l'hypertexte avec des moyens traditionnels. Ainsi au d&eacute;but des ann&eacute;es 1970 on vit devenir &agrave; la mode un concept p&eacute;dagogique qui s'appelait &quot;instruction programm&eacute;e&quot;. Il s'agissait l&agrave; de livres que l'on ne pouvait pas lire de fa&ccedil;on s&eacute;quentielle mais qui &eacute;taient ainsi construits que l'&eacute;l&egrave;ve se voyait proposer des bribes d'information ou des questions accompagn&eacute;es d'un choix de liens crois&eacute;s menant &agrave; d'autres endroits dans le livre. M&ecirc;me les destinations de ces liens &eacute;taient des bribes d'information ou des commentaires sur la r&eacute;ponse choisie, accompagn&eacute;s d'un autre choix de liens crois&eacute;s menant &agrave; d'autres endroits.</p>

<p>Il s'av&eacute;ra cependant que beaucoup de pages dans ce genre de livres n'inclinait pas forc&eacute;ment &agrave; la concentration sur le sujet enseign&eacute;. Ici les ordinateurs sont bien sup&eacute;rieurs. Un cliquement de souris sur un lien et la cible du lien est affich&eacute;e. Cette &eacute;vidence ne peut pas &ecirc;tre sous-estim&eacute;e. Il est prouv&eacute; que des interruptions sup&eacute;rieures &agrave; trois secondes r&eacute;duisent &agrave; n&eacute;ant une concentration soutenue. Feuilleter dure la plupart du temps plus longtemps et fait appel en outre &agrave; des ressources du cerveau. Cliquer et attendre que le contenu soit l&agrave; va en r&egrave;gle g&eacute;n&eacute;rale plus vite et ne fait pas du tout ou beaucoup moins appel aux r&eacute;serves.</p>

<p>La pr&eacute;sentation &eacute;lectronique des textes a de toutes fa&ccedil;ons &eacute;galement des d&eacute;fauts ( il ne s'agit pas ici de l'id&eacute;e fixe de certains qui pensent ne pas pouvoir vivre sans papier): On ne peut pas voir quelle est la taille d'un hypertexte &eacute;lectronique c'est &agrave; dire on ne peut pas s'en faire une id&eacute;e juste. Cela peut avoir un effet angoissant ou l&eacute;nifiant selon la disposition de l'utilisateur par rapport au m&eacute;dia. Il peut &ecirc;tre aussi d&eacute;sagr&eacute;able de ne pas savoir quelle taille a l' &quot;ensemble&quot; parce que l'on est pas en mesure d'avoir  d'avoir une id&eacute;e du tout au d&eacute;part. Il peut &ecirc;tre &eacute;galement d&eacute;sagr&eacute;able de ne pas avoir la moindre id&eacute;e sur l'ensemble. Les techniques internes &agrave; l'hypertexte comme les <img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="terminologie.htm#visualisations_Web"><b>Visualisations Web</b></a>  essaient de pallier les angoisses correspondantes de l'utilisateur.</p>

<p>Mais le probl&egrave;me n'est pas d'appr&eacute;hender la taille d'un seul hypertexte. Les hypertextes ont en plus tendance tendance &agrave; vrai dire &agrave; se relier entre eux et de ce fait de former des &quot;touts&quot; toujours plus grands. C'est pour cette raison que des hypertextes disponibles localement sur un ordinateur ou un support s'enregistrement, peu satisfaisants sur la dur&eacute;e. Tr&egrave;s t&ocirc;t d&eacute;j&agrave; (c'&eacute;tait en 1965 avec <img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="histoire.htm#nelson"><b>Ted Nelson</b></a>) on en vint &agrave; l'id&eacute;e de relier des projets hypertexte distincts &agrave; l'&eacute;chelle mondiale. Pourtant, ce n'est qu'&agrave; la fin des ann&eacute;es 1980 quand le th&egrave;me de l'hypertexte fut discut&eacute; dans des cercles plus larges, que naquit l'id&eacute;e d'utiliser le r&eacute;seau mondial d'Internet pour un service orient&eacute; hypertexte. De ces r&eacute;flexions apparut finalement au d&eacute;but des ann&eacute;es 1990 le World Wide Web.</p>





<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="positions">Positions fondamentales sur l'hypertexte</a></h2>

<p>On peut distinguer les positions fondamentales suivantes sur l' &quot;hypertexte&quot;:</p>
<ul>
<li>La position selon laquelle l'hypertexte est la poursuite logique du d&eacute;veloppement de textes fortement structur&eacute;s. Citation <img src="../../src/docf.gif" width="15" height="10" border="0" alt="D&eacute;monstration - nouvelle fen&ecirc;tre">&nbsp;<a href="../../sources/kuhlen.htm" target="_blank"><b>Kuhlen</b></a>: <cite>&quot;On en arrive au r&eacute;sultat que l'hypertexte &eacute;l&egrave;ve au rang de principe les moyens de structure non lin&eacute;aire d&eacute;j&agrave; employ&eacute;s dans les textes...&quot;</cite>.</li>
<li>La position selon laquelle l'hypertexte est une nouvelle recherche particuli&egrave;rement conviviale pour l'utilisateur dans les grandes banques de donn&eacute;es et d'informations. Citation <img src="../../src/docf.gif" width="15" height="10" border="0" alt="D&eacute;monstration - nouvelle fen&ecirc;tre">&nbsp;<a href="../../sources/schnupp.htm" target="_blank"><b>Schnupp</b></a>: <cite>&quot;L'hypertexte dresse dans les documents texte une hyperstructure pour assister dans les recherches&quot;</cite>.</li>
<li>La position selon laquelle l'hypertexte cr&eacute;e de nouveaux r&ecirc;ves libres et cr&eacute;atifs ainsi que des nouvelles dimensions pour des auteurs et les lecteurs en gommant les fronti&egrave;res qui les s&eacute;parent. Citation <img src="../../src/docf.gif" width="15" height="10" border="0" alt="D&eacute;monstration - nouvelle fen&ecirc;tre">&nbsp;<a href="../../sources/joyce.htm" target="_blank"><b>Joyce</b></a>: <cite>&quot;Hypertext narratives become virtual storytellers and narrative is no longer disseminated irreversibly from singer to listener or writer to reader&quot;</cite> (<i>&quot;Les r&eacute;cits en hypertexte deviennent des conteurs d'histoires virtuelles et ce qui est racont&eacute; n'est plus propag&eacute; de fa&ccedil;on irr&eacute;versible du chanteur &agrave; l'auditeur ou de l'auteur au lecteur&quot;</i>).</li>
</ul>


<p>Rainer Kuhlen repr&eacute;sente le plus clairement la premi&egrave;re position. Il &eacute;crit sur la lin&eacute;arit&eacute; des textes: <cite>&quot;La lin&eacute;arit&eacute; repose en th&eacute;orie &eacute;galement sur l'utilisation correcte de  <img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="terminologie.htm#cohesion"><b>coh&eacute;sion</b></a> microtextuelle de moyens de cr&eacute;ation&quot;</cite>. En font partie par exemple les indications explicites au lecteur telles que &quot;Il faut comprendre ceci de telle fa&ccedil;on que...&quot;, ou des remarques indicatives telles que &quot;ce probl&egrave;me a d&eacute;j&agrave; &eacute;t&eacute; pos&eacute; dans le premier chapitre&quot;. La coh&eacute;rence des textes lin&eacute;aires utilise donc toujours &eacute;galement des moyens qui font entorse &agrave; la lin&eacute;arit&eacute;. Ces moyens d&eacute;rogeant &agrave; la lin&eacute;arit&eacute; sont simplement &eacute;rig&eacute;s en principe dans les hypertextes. &Agrave; partir de textes avec des moyens immanents au texte qui cr&eacute;ent la coh&eacute;sion, se font <img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="terminologie.htm#unites"><b>des unit&eacute;s informatives</b></a> (<img src="../../src/docf.gif" width="15" height="10" border="0" alt="D&eacute;monstration - nouvelle fen&ecirc;tre">&nbsp;<a href="../../sources/kuhlen.htm" target="_blank"><b>Kuhlen</b></a>), qui sont reli&eacute;es entre elles par des liens ex&eacute;cutables. Les liens n'ont l&agrave; aucune fonction qui soit fondamentalement nouvelle. Ce ne sont pas des liens arbitraires mais qui servent l'argumentation tout en se fondant sur la s&eacute;mantique, qui servent &agrave; la navigation ou &agrave; l'&eacute;laboration de liens crois&eacute;s. Seule leur ex&eacute;cution rendue possible par ordinateur est nouvelle.</p>

<p>Sur le Web, il y a par exemple d'innombrables petits projets aboutis qui utilisent sciemment les moyens de HTML pour r&eacute;aliser sciemment une structure hypertexte (la page d'accueil comprenant quelques pages Web). De tels projets sont pourtant trop petits pour y effectuer de vastes recherches de donn&eacute;es. Ils sont &agrave; d&eacute;crire au mieux par la position adopt&eacute;e par Rainer Kuhlen.</p>

<p>P. Schnupp met par contre le plus clairement l'accent sur la position de recherche - peut-&ecirc;tre aussi parce qu'il n'accorde pas le caract&egrave;re d'hypertexte aux petits projets. Don introduction &agrave; ce th&egrave;me commence par ces mots: <cite>&quot;Le besoin qui donna naissance &agrave; l'hypertexte, est le m&ecirc;me que celui qui mena du fichier &agrave; la base de donn&eacute;es&quot;</cite>. Ainsi de m&ecirc;me que la base de donn&eacute;es avec des donn&eacute;es structur&eacute;es ouvrait de nouvelles possibilit&eacute;s de recherche de donn&eacute;es par rapport au fichier distinct, l'hypertexte a pour vocation d' <cite>&quot;acc&eacute;l&eacute;rer et d'all&eacute;ger la recherche interactive dans des vastes quantit&eacute;s de texte&quot;</cite>.</p>

<p>Ce qui est innovant pour Schnupp dans l'hypertexte, c'est avant tout les techniques de recherche intuitives sans qu'elles exigent au pr&eacute;alable des connaissances approfondies en informatique: <cite>&quot;De la m&ecirc;me fa&ccedil;on que les feuilles de calcul rendaient accessibles &agrave; l'utilisateur individuel la programmation de t&acirc;ches num&eacute;riques, L'hypertexte lui apporte la cr&eacute;ation et l'entretien de vastes archives de texte par lui m&ecirc;me. Comme pour les donn&eacute;es, il en va aussi pour les textes; Ce n'est que par la relation qu'on &eacute;tablit entre eux, qu'une grande partie du 'savoir' qui s'y trouve sauvegard&eacute; devient accessible&quot;</cite>.</p>

<p>Pour les projets avec de grandes quantit&eacute;s de texte la r&eacute;alisation d'une quantit&eacute; d'unit&eacute;s de texte distinctes, sauvegard&eacute;es statiquement et pouvant &ecirc;tre appel&eacute;es a certes ses limites. Pour de telles quantit&eacute;s de texte l'utilisateur attend avec raison une possibilit&eacute; d'effectuer des recherches s'apr&egrave;s des expressions ou des crit&egrave;res dans la totalit&eacute; du texte et de pr&eacute;parer les r&eacute;sultats de la recherche  &quot;sur demande&quot; .</p>

<p>La conception d'une nature cr&eacute;ative de l'hypertexte se fait elle aussi toujours attendre. Justement dans le domaine litt&eacute;raire - tout au moins l&agrave; o&ugrave; les auteurs savent se servir d'un ordinateur - on fait entre-temps beaucoup d'essais avec l'hypertexte. La transparence pour l'obtention d'information n'y a pas forc&eacute;ment la priorit&eacute; mais c'est m&ecirc;me au contraire plut&ocirc;t l' &quot;attirance du lecteur dans une quantit&eacute; de mondes partiels int&eacute;ressants&quot;. Le lecteur y est intentionnellement soumis au stress de manquer quelque chose &agrave; un autre endroit qu'il suit d&eacute;j&agrave; mais vient de quitter par un lien. La question de savoir si cette mise intentionnelle sous pression est ressentie par le lecteur de toutes fa&ccedil;ons comme plut&ocirc;t captivante qu'&eacute;nervante, sera tranch&eacute;e par la critique artistique. L'hypertexte est en tous cas en mesure de faire ce genre de choses avec les lecteurs et les textes reli&eacute;s qui pr&eacute;tendent pour eux-m&ecirc;mes &ecirc;tre une volont&eacute; d'expression artistique, ne se laissent pas mesurer par des m&eacute;thodes scientifiques d'information.</p>







<table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr><td colspan="2" bgcolor="#EEEEEE" class="doc">
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a>
</td></tr>
<tr><td bgcolor="#EEEEEE" class="doc" align="right"><a href="terminologie.htm"><img src="../../src/suivant.gif" width="10" height="10" border="0" hspace="10" alt="page suivante"></a></td>
<td bgcolor="#FFFFFF"><img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information"> <a href="terminologie.htm"><b>Terminologie propre &agrave; l'hypertexte</b></a>
</td></tr>
<tr>
<td bgcolor="#EEEEEE" class="doc" align="right"><a href="../aide/aide.htm"><img src="../../src/precedent.gif" width="10" height="10" border="0" hspace="10" alt="page pr&eacute;c&eacute;dente"></a></td>
<td bgcolor="#FFFFFF" width="100%"><img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information"> <a href="../aide/aide.htm"><b>Support</b></a>
</td>
</tr>
<tr><td colspan="2" bgcolor="#EEEEEE" class="doc">&#160;</td></tr>
</table><table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr>
<td bgcolor="#FFEEDD" class="nav"><a class="an" name="bottom"><img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"></a> <a href="../../index.htm"><b>SELFHTML</b></a>/<a href="../../navigation/index.htm" target="_parent">Aides &agrave; la navigation</a> <img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="../index.htm"><b>Introduction</b></a> <img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="index.htm"><b>Hypertexte</b></a></td>
</tr>
</table>

<p>&copy; 2001 Stefan M&uuml;nz / &copy; 2003 Traduction <img src="../../src/courriel.gif" width="15" height="10" border="0" alt="Adresse &eacute;lectronique">&nbsp;<a href="mailto:13405@free.fr">Serge Fran&ccedil;ois, 13405@free.fr</a><br><img src="../../src/courriel.gif" width="15" height="10" border="0" alt="Adresse &eacute;lectronique">&nbsp;<a href="mailto:selfhtml@selfhtml.com.fr">selfhtml@selfhtml.com.fr</a></p>



</body>
</html>
