<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>SELFHTML: Introduction / Hypertexte / Histoire de l'hypertexte</title>
<link rel="stylesheet" type="text/css" href="../../src/selfhtml.css">
<meta name="description"    content="Welche Meilensteine man in der Geschichte von Hypertext ausmachen kann.">
<meta name="keywords"       content="SELFHTML, Hypertext, Vannevar Bush, Memex, Douglas C. Engelbart, Augment, Ted Nelson, Xanadu, Arno Schmidt, Zettels Traum, Hypertext-Konferenzen, World Wide Web">
<meta name="author"         content="Stefan M&uuml;nz, selfhtml@teamone.de">
<meta http-equiv="content-type" content="text/html; charset=ISO-8859-1">
<meta name="DC.Publisher"   content="Serge Fran&ccedil;ois, selfhtml@selfhtml.com.fr">
<meta name="DC.Date"        content="2003-01-27T08:00+00:00">
<meta name="DC.Identifier"  content="http://selfhtml.selfhtml.com.fr/introduction/hypertexte/histoire.htm">
<meta name="DC.Language"    content="fr">
<meta name="DC.Rights"      content="../../editorial/copyright.htm">
<meta name="DC.Date.Create" content="2003-01-27T08:00+00:00">
<meta name="SELF.Version"   content="1">
<meta name="SELF.Pagetype"  content="Information">
<meta name="SELF.Path"      content="SELFHTML == ../../index.htm // Introduction == ../index.htm // Hypertexte == index.htm">
<!-- Matomo -->
<script type="text/javascript">
  var _paq = window._paq = window._paq || [];
  /* tracker methods like "setCustomDimension" should be called before "trackPageView" */
  _paq.push(['trackPageView']);
  _paq.push(['enableLinkTracking']);
  (function() {
    var u="//matomo.boitasite.com/";
    _paq.push(['setTrackerUrl', u+'matomo.php']);
    _paq.push(['setSiteId', '1']);
    var d=document, g=d.createElement('script'), s=d.getElementsByTagName('script')[0];
    g.type='text/javascript'; g.async=true; g.src=u+'matomo.js'; s.parentNode.insertBefore(g,s);
  })();
</script>
<!-- End Matomo Code -->
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#AA5522" vlink="#772200" alink="#000000">

<table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr>
<td bgcolor="#FFEEDD" class="nav"><a class="an" name="top"><img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"></a> <a href="../../index.htm"><b>SELFHTML</b></a>/<a href="../../navigation/index.htm" target="_parent">Aides &agrave; la navigation</a> <img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="../index.htm"><b>Introduction</b></a> <img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="index.htm"><b>Hypertexte</b></a></td>
</tr>
</table><table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr>
<td bgcolor="#EEEEEE" class="doc" width="110"><img src="../../src/logo.gif" width="106" height="109" border="0" alt="SELFHTML"></td>
<td bgcolor="#EEEEEE" class="doc" valign="bottom" width="100%"><h2>Histoire de l'hypertexte</h2>
<tr>
<td bgcolor="#EEEEEE" class="doc" valign="top" align="center">
<img src="../../src/docx.gif" width="30" height="20" vspace="6" border="0" alt="Page d'information: vue d'ensemble">
</td>
<td bgcolor="#FFFFFF" valign="top" nowrap>
<p>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#bush"><b>Vannevar Bush et son &quot;Memex&quot;</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#engelbart"><b>Douglas C. Engelbart et son &quot;Augment&quot;</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#nelson"><b>Ted Nelson et son &quot;Xanadu&quot;</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#conferences"><b>Conf&eacute;rences hypertexte</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#present"><b>Le pr&eacute;sent et ses motivations plus profondes pour l'hypertexte</b></a><br>
</p>
</td>
</tr><tr><td colspan="2" bgcolor="#EEEEEE" class="doc">&#160;<a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;</td></tr>
</table>



<h2 class="Sh2"><a class="an" name="bush">Vannevar Bush et son &quot;Memex&quot;</a></h2>

<p><cite>&quot;Le 'Memex' de Bush est un syst&egrave;me d'information (projet sur papier non r&eacute;alis&eacute; exp&eacute;rimentalement) qui repose sur l'&eacute;tat m&eacute;thodique et technique des connaissances livresques de 1945 (indexation, vocabulaires contr&ocirc;l&eacute;s, mise en relation et transfert sur microfilms), ceci il est vrai avec la radicalisation de l'id&eacute;e de de la relation ('association') critiquait et &eacute;largissait en concr&eacute;tisant ainsi un sch&eacute;ma directeur, qui encore aujourd'hui multiplie les id&eacute;es des concepteurs de syst&egrave;mes. Memex &eacute;tait con&ccedil;u comme une machine qui devait &eacute;largir et soutenir la m&eacute;moire humaine et ses facult&eacute;s d'associations... Bush s'imaginait un appareil photographique qui devait &ecirc;tre accroch&eacute; au front et par lequel tout ce qui au cours de la journ&eacute;e &eacute;veillait l'int&eacute;r&ecirc;t de son propri&eacute;taire devait &ecirc;tre imm&eacute;diatement enregistr&eacute; et rendu disponible dans le Memex&quot;</cite> (<img src="../../src/docf.gif" width="15" height="10" border="0" alt="D&eacute;monstration - nouvelle fen&ecirc;tre">&nbsp;<a href="../../sources/kuhlen.htm" target="_blank"><b>Kuhlen</b></a>, page 67).</p>

<p>Le <b>Memex</b> de Vannevar Bush (1945) fait partie du domaine de l'utopisme scientifique et technique. Pourtant l'utopie du Memex fait partie de ces utopies dont l'id&eacute;e de base est trop convaincante pour la bannir purement et simplement au royaume des fables:</p>

<p><cite>&quot;The human mind...operates by association. With one item in its grasp, it snaps instantly to the next that is suggested by the association of thoughts, in accordance with some intricate web of trails carried by the cells of the brain&quot;</cite> (Bush) - &quot;<i>L'esprit humain travaille ... &agrave; l'aide d'associations. &Agrave; peine a-t il un contenu &agrave; sa port&eacute;e que tout de suite il se saisit du suivant qui lui est propos&eacute; par l'association des id&eacute;es, suivant un r&eacute;seau de chemins imp&eacute;n&eacute;trable port&eacute;s par les cellules du cerveau.</i>&quot;.</p>

<p>Pour ce trait fondamental de la pens&eacute;e et de la compr&eacute;hension humaine, Bush s'imaginait un soutien ad&eacute;quat par une machine. Cette id&eacute;e nourrit encore aujourd'hui l'enthousiasme pour l'hypertexte.</p>






<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="engelbart">Douglas C. Engelbart et son &quot;Augment&quot;</a></h2>

<p><b>Augment</b> est le syst&egrave;me hypertexte au pass&eacute; le plus ancien. &quot;Augment&quot; a &eacute;t&eacute; d&eacute;velopp&eacute; d&egrave;s 1963 au SRI International de Stanford, et &agrave; partir de 1978 les droits commerciaux en ont &eacute;t&eacute; transmis &agrave; Tymshare.</p>

<p><cite>&quot;&Agrave; l'origine AUGMENT a &eacute;t&eacute; d&eacute;velopp&eacute; dans un environnement r&eacute;seau pour des gros ordinateurs en temps partag&eacute;. Les outils mis en &#339;uvre qui d&eacute;terminent aujourd'hui les standards d'ordinateurs personnels et d'ordinateurs individuels de travail ont &eacute;t&eacute; directeurs: la souris comme p&eacute;riph&eacute;rique d'entr&eacute;e, la technique multifen&ecirc;tres avec traitement 'parall&egrave;le' ... mise en relation de mat&eacute;riaux h&eacute;t&eacute;rog&egrave;nes par des pointeurs, mise en &#339;uvre intensive de graphiques int&eacute;gr&eacute;e... Engelbart voyait tr&egrave;s clairement les effets de plus-value pouvant &ecirc;tre atteints par rapport aux formes lin&eacute;aires comme les livres... AUGMENT a &eacute;t&eacute; depuis le d&eacute;but incorpor&eacute; dans un environnement de communication &eacute;lectronique qui par exemple devait permettre la publication et l'&eacute;dition partag&eacute;es, l'envoi &eacute;lectronique de documents, la poste &eacute;lectronique, les t&eacute;l&eacute;conf&eacute;rences.&quot;</cite> (<img src="../../src/docf.gif" width="15" height="10" border="0" alt="D&eacute;monstration - nouvelle fen&ecirc;tre">&nbsp;<a href="../../sources/kuhlen.htm" target="_blank"><b>Kuhlen</b></a>, page 69).</p>

<p>La plupart des concepteurs hypertexte du pass&eacute; sous-estimaient &agrave; l'encontre d'Engelbart l'importance de l' &quot;aspect et de la convivialit&eacute; &quot; pour l'utilisateur final. L' <img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="../internet/www.htm"><b>Apparition du World Wide Web</b></a> a montr&eacute; que la perc&eacute;e n'a r&eacute;ussi qu'avec les navigateurs modernes dot&eacute;s d'une interface utilisateur graphique, et non pas avec les id&eacute;es et les concepts seuls, aussi convaincants qu'ils soient. Engelbart pensait d&eacute;j&agrave; &agrave; l'interface graphique et &agrave; la souris alors que Steve Jobs et d'autres qui passent pour les inventeurs de l'interface graphique, &eacute;taient encore enfants. Cependant l'&eacute;poque n'&eacute;tait pas venue pour les repr&eacute;sentations graphiques d'Engelbart. Les films de science fiction des ann&eacute;es 1960 illustrent bien comment les hommes se repr&eacute;sentaient les ordinateurs du futur: &agrave; l'image d'armoires qui certes pouvaient discuter sans peine avec les humains mais ne consistaient autrement qu'en ampoules de contr&ocirc;le, boutons, et tout au plus en une console primitive avec un affichage d'une ligne de texte. L'importance d'Engelbart pour l'histoire de l'hypertexte r&eacute;side avant tout dans sa reconnaissance que l'hypertexte est li&eacute; &agrave; des techniques de repr&eacute;sentation visuellement attractives et &agrave; des formes d'interaction ergonomiques.</p>



<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="nelson">Ted Nelson et son &quot;Xanadu&quot;</a></h2>

<p>Les travaux de Ted Nelson - ou plus pr&eacute;cis&eacute;ment ses visions - sont la base des recherches hypertexte et de l'enthousiasme hypertexte actuels. <cite>&quot;Ce n'est pas seulement les deux d&eacute;signations 'hypertexte' et 'hyperm&eacute;dia' qui lui furent attribu&eacute;es, mais encore c'est avant tout les id&eacute;es non conventionnelles qu'il a poursuivies pendant des dizaines d'ann&eacute;es  d'un syst&egrave;me de mise &agrave; disposition de l'information et de gestion du savoir, XANADU, qui firent de lui l'un des chercheurs hypertexte les plus cr&eacute;atifs.
Ce qui est remarquable chez Nelson est de plus qu'il ne se laissa pas lier &agrave; des institutions ou &agrave; des firmes commerciales mais plut&ocirc;t qu'il ait toujours emprunt&eacute; des voies alternatives li&eacute; par une certitude &eacute;clair&eacute;e de transmission qui a vu ces derni&egrave;res ann&eacute;es en fin de compte, la chance de valorisation &eacute;conomique a tout &agrave; fait reconnue.&quot;</cite> (<img src="../../src/docf.gif" width="15" height="10" border="0" alt="D&eacute;monstration - nouvelle fen&ecirc;tre">&nbsp;<a href="../../sources/kuhlen.htm" target="_blank"><b>Kuhlen</b></a>, page 69). On peut faire remonter l'id&eacute;e de Nelson sur le &quot;Xanadu&quot; jusqu'en 1965. Depuis la fin des ann&eacute;es 80 et avant la fin des ann&eacute;es 90, le &quot;Xanadu&quot; fut commercialis&eacute;.</p>

<p>Nelson s'imagine le Xanadu comme une banque d'informations sans limite de taille. <cite>&quot;Le but final qui aujourd'hui &eacute;galement semble encore utopique en est la gestion des connaissances mondiales par un r&eacute;seau &eacute;norme d'id&eacute;es soutenu par ordinateur qui permet l'acc&egrave;s aux unit&eacute;s d'information correspondantes. Gr&acirc;ce &agrave; la possibilit&eacute; du traitement collectif et simultan&eacute; d'un document l'antinomie tendancielle entre le lecteur et l'auteur doit &ecirc;tre lev&eacute;e. La mission de tels syst&egrave;mes ne se cantonne pas &agrave; la seule gestion des nombreuses et complexes relations entre les diverses unit&eacute;s hypertexte. Au del&agrave; des m&eacute;canismes sont &eacute;galement n&eacute;cessaires qui en cas d'une utilisation Multi-Utilisateurs extensible doivent garantir l'int&eacute;grit&eacute;, la mise &agrave; jour, ainsi que l'historique de cr&eacute;ation d'un document et &eacute;galement soutenir la protection des droits d'auteur, d'utilisation et de reproduction</cite> (<img src="../../src/docf.gif" width="15" height="10" border="0" alt="D&eacute;monstration - nouvelle fen&ecirc;tre">&nbsp;<a href="../../sources/kuhlen.htm" target="_blank"><b>Kuhlen</b></a>, page 217). Le Xanadu de Nelson met diff&eacute;rentes propri&eacute;t&eacute;s &agrave; disposition pour ces t&acirc;ches.</p>

<p>Par des stations de travail et des ordinateurs puissants, l'acc&egrave;s en ligne au stock d'informations Xanadu est possible depuis  1989/90. Le syst&egrave;me permet outre l'appel d'informations, l'incorporation et mise sur r&eacute;seau de ses propres donn&eacute;es dans le stock d'informations. Pour ce faire l'auteur d&eacute;cide s'il s'agit de ses propres donn&eacute;es personnelles (l'acc&egrave;s n'est possible que par l'auteur lui m&ecirc;me) ou de donn&eacute;es publiques (l'acc&egrave;s est possible pour tous). L'acc&egrave;s en ligne au stock d'informations est payant. Les auteurs re&ccedil;oivent des tanti&egrave;mes - l'ordinateur s'en occupe - quand leurs donn&eacute;es sont appel&eacute;es par des liens actionn&eacute;s par d'autres utilisateurs. Ainsi, chaque utilisateur peut devenir auteur, et chaque auteur est toujours &eacute;galement utilisateur. Xanadu met en plus des outils pour le contr&ocirc;le de versions de documents &agrave; disposition. Pourtant, ce n'est pas lui qui pr&eacute;pare les donn&eacute;es sauvegard&eacute;es pour l'utilisateur final. Pour cela, une &quot;interface logicielle  de navigation frontale&quot; est n&eacute;cessaire qui prend en charge les sorties &agrave; l'&eacute;cran, l'ex&eacute;cution des liens etc.</p>

<p>C'est ainsi que Ted Nelson a ouvert la voie &agrave; la technologie du World Wide Web d&eacute;j&agrave; 25 ans avant sa cr&eacute;ation, et ses id&eacute;es sont en partie plus m&ucirc;ries (par exemple le syst&egrave;me des tanti&egrave;mes ou le contr&ocirc;le de versions de document). On peut comprendre que Ted Nelson soit f&acirc;ch&eacute; de la perc&eacute;e du  Web, qui l'a simplement balay&eacute;.</p>






<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="conferences">Conf&eacute;rences hypertexte</a></h2>

<p>Depuis la fin des ann&eacute;es 1980  &quot;l'hypertexte&quot; n'est plus l'affaire de quelques pionniers qui veulent se faire un nom. Les techniques de l'hypertexte ont &eacute;t&eacute;  de plus en plus mises en &#339;uvre dans la pratique depuis le milieu des ann&eacute;es 1980 -  avant tout dans la documentation en ligne. L'hypertexte une mati&egrave;re reconnue pour des conf&eacute;rences sp&eacute;cialis&eacute;es. Les premi&egrave;res conf&eacute;rences hypertexte importantes furent:</p>

<ul>
<li>1. Hypertext-ACM-Workshop, 1987, Universit&eacute; de Caroline du Nord &agrave; Chapel Hill</li>
<li>AI (Artificial Intelligence) and Hypertext, 1988</li>
<li>Hypertext I, Aberdeen 1989</li>
<li>Hypertext '89, Pittsburgh, PA</li>
<li>Hypertext II, New York 1990</li>
<li>ECHT (premi&egrave;re conf&eacute;rence hypertexte europ&eacute;enne, Paris 1990</li>
<li>Hypertexte/ Congr&egrave;s Hyperm&eacute;dia, B&acirc;le 1990</li>
</ul>





<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="present">Le pr&eacute;sent et ses motivations plus profondes pour l'hypertexte</a></h2>

<p>Les id&eacute;es de Tim Berner-Lee qui donn&egrave;rent naissance au d&eacute;but des ann&eacute;es 1990 au  World Wide Web, ne sont donc pas issues du n&eacute;ant. L'hypertexte a une tradition. Car l'hypertexte est une cons&eacute;quence du monde de repr&eacute;sentation qui s'est form&eacute; au cours du 20&egrave;me si&egrave;cle et qui a fait irruption dans tous les domaines de la vie quotidienne des entreprises industrielles. La vie moderne y est marqu&eacute;e par la fragmentation. La vie professionnelle, la vie de famille, la vie associative exigent qu'un seul et m&ecirc;me homme y joue plusieurs r&ocirc;les et n'ont pour ainsi dire aucun point commun. La qu&ecirc;te de nourriture se fait la plupart du temps ailleurs que l&agrave; o&ugrave; on d&eacute;guste les fruits. M&ecirc;me pour la d&eacute;tente et la consommation sont apparues des zones qui sont fr&eacute;quent&eacute;es dans ce but. L'homme moderne a appris &agrave; s&eacute;rier les choses dans sa vie et dans sa t&ecirc;te. C'est exactement le principe de la fragmentation en unit&eacute;s qui est aussi &agrave; la base de l'hypertexte. Et l'hypertexte peut exprimer le souhait d'au moins relier &agrave; nouveau logiquement ces unit&eacute;s fragment&eacute;es et de rendre visible et ex&eacute;cutables leurs relations.</p>

<p>On ne peut poser de pont qu'entre des rives s&eacute;par&eacute;es l'une de l'autre. D&eacute;j&agrave; Friedrich Nietzsche reconnaissait dans l'homme cette capacit&eacute; qu'il a de supporter les contradictions qui sont en lui. L'homme a choisi la fragmentation pour continuer &agrave; se d&eacute;velopper, Mais de la m&ecirc;me fa&ccedil;on subsiste chez lui le d&eacute;sir d'unit&eacute;. Certains essaient en faisant un retour aux formes de vie simples et traditionnelles. Et d'autres justement en suivant cette id&eacute;e du r&eacute;seau. Ils tissent la toile (&quot;Weaving the Web&quot;!).</p>





<table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr><td colspan="2" bgcolor="#EEEEEE" class="doc">
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a>
</td></tr>
<tr><td bgcolor="#EEEEEE" class="doc" align="right"><a href="comprendre.htm"><img src="../../src/suivant.gif" width="10" height="10" border="0" hspace="10" alt="page suivante"></a></td>
<td bgcolor="#FFFFFF"><img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information"> <a href="comprendre.htm"><b>Hypertexte et compr&eacute;hension humaine</b></a>
</td></tr>
<tr>
<td bgcolor="#EEEEEE" class="doc" align="right"><a href="terminologie.htm"><img src="../../src/precedent.gif" width="10" height="10" border="0" hspace="10" alt="page pr&eacute;c&eacute;dente"></a></td>
<td bgcolor="#FFFFFF" width="100%"><img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information"> <a href="terminologie.htm"><b>Terminologie propre &agrave; l'hypertexte</b></a>
</td>
</tr>
<tr><td colspan="2" bgcolor="#EEEEEE" class="doc">&#160;</td></tr>
</table><table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr>
<td bgcolor="#FFEEDD" class="nav"><a class="an" name="bottom"><img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"></a> <a href="../../index.htm"><b>SELFHTML</b></a>/<a href="../../navigation/index.htm" target="_parent">Aides &agrave; la navigation</a> <img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="../index.htm"><b>Introduction</b></a> <img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="index.htm"><b>Hypertexte</b></a></td>
</tr>
</table>

<p>&copy; 2001 Stefan M&uuml;nz / &copy; 2003 Traduction <img src="../../src/courriel.gif" width="15" height="10" border="0" alt="Adresse &eacute;lectronique">&nbsp;<a href="mailto:13405@free.fr">Serge Fran&ccedil;ois, 13405@free.fr</a><br><img src="../../src/courriel.gif" width="15" height="10" border="0" alt="Adresse &eacute;lectronique">&nbsp;<a href="mailto:selfhtml@selfhtml.com.fr">selfhtml@selfhtml.com.fr</a></p>



</body>
</html>
