<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>SELFHTML: Introduction / Hypertexte / Terminologie propre &agrave; l'hypertexte</title>
<link rel="stylesheet" type="text/css" href="../../src/selfhtml.css">
<meta name="description"    content="Quels expressions sp&eacute;cialis&eacute;es et  mots &agrave; succ&egrave;s trouve-t on dans l'hypertexte et qu'est-ce qu'ils signifient.">
<meta name="keywords"       content="SELFHTML, Hypertexte, Hypertext, Nodes, Units, n:m-Relation, coh&eacute;sion, Fish-Eye-Views, Information Retrieval, recherche documentaire,  lost in hyperspace, guided tour, Backtracking, History, Sharks, Holy Scrollers">
<meta name="author"         content="Stefan M&uuml;nz, selfhtml@teamone.de">
<meta http-equiv="content-type" content="text/html; charset=ISO-8859-1">
<meta name="DC.Publisher"   content="Serge Fran&ccedil;ois, selfhtml@selfhtml.com.fr">
<meta name="DC.Date"        content="2003-01-27T08:00+00:00">
<meta name="DC.Identifier"  content="http://selfhtml.selfhtml.com.fr/introduction/hypertexte/terminologie.htm">
<meta name="DC.Language"    content="fr">
<meta name="DC.Rights"      content="../../editorial/copyright.htm">
<meta name="DC.Date.Create" content="2003-01-27T08:00+00:00">
<meta name="SELF.Version"   content="1">
<meta name="SELF.Pagetype"  content="Information">
<meta name="SELF.Path"      content="SELFHTML == ../../index.htm // Introduction == ../index.htm // Hypertexte == index.htm">
<!-- Matomo -->
<script type="text/javascript">
  var _paq = window._paq = window._paq || [];
  /* tracker methods like "setCustomDimension" should be called before "trackPageView" */
  _paq.push(['trackPageView']);
  _paq.push(['enableLinkTracking']);
  (function() {
    var u="//matomo.boitasite.com/";
    _paq.push(['setTrackerUrl', u+'matomo.php']);
    _paq.push(['setSiteId', '1']);
    var d=document, g=d.createElement('script'), s=d.getElementsByTagName('script')[0];
    g.type='text/javascript'; g.async=true; g.src=u+'matomo.js'; s.parentNode.insertBefore(g,s);
  })();
</script>
<!-- End Matomo Code -->
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#AA5522" vlink="#772200" alink="#000000">

<table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr>
<td bgcolor="#FFEEDD" class="nav"><a class="an" name="top"><img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"></a> <a href="../../index.htm"><b>SELFHTML</b></a>/<a href="../../navigation/index.htm" target="_parent">Aides &agrave; la navigation</a> <img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="../index.htm"><b>Introduction</b></a> <img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="index.htm"><b>Hypertexte</b></a></td>
</tr>
</table><table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr>
<td bgcolor="#EEEEEE" class="doc" width="110"><img src="../../src/logo.gif" width="106" height="109" border="0" alt="SELFHTML"></td>
<td bgcolor="#EEEEEE" class="doc" valign="bottom" width="100%"><h2>Terminologie propre &agrave; l'hypertexte</h2>
<tr>
<td bgcolor="#EEEEEE" class="doc" valign="top" align="center">
<img src="../../src/docx.gif" width="30" height="20" vspace="6" border="0" alt="Page d'information: vue d'ensemble">
</td>
<td bgcolor="#FFFFFF" valign="top" nowrap>
<p>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#unites"><b>Nodes, Units, Items (n&#339;uds, unit&eacute;s, articles), unit&eacute;s d'information</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#cohesion"><b>n:m-Relation, harmonie de la coh&eacute;sion</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#visualisations_web"><b>Web-views (Visualisations Web)</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#fish_eye_views"><b>fish-eye views (visualisations &#339;il de poisson)</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#information_retrieval"><b>Information Retrieval (recherche documentaire)</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#lost_in_hyperspace"><b>Orientation, Navigation, &quot;Lost in Hyperspace&quot; (perdu dans l'hyperespace)</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#guided_tours"><b>Chemins, Trails (pistes), Guided Tours (visite guid&eacute;e)</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#backtracking"><b>Backtracking (retour en arri&egrave;re), Historie (historique), signets</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#browsing_authoring"><b>Browsing (navigation), Authoring (cr&eacute;ation)</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#sharks_scrollers"><b>Sharks (requins), Holy Scrollers (saints d&eacute;fileurs), fichier, m&eacute;taphore livresque</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#ham"><b>Hypertext Abstract Machines (Machines hypertexte abstraites)</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#www"><b>World Wide Web</b></a><br>
</p>
</td>
</tr><tr><td colspan="2" bgcolor="#EEEEEE" class="doc">&#160;<a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;</td></tr>
</table>



<h2 class="Sh2"><a class="an" name="unites">Nodes, Units, Items (n&#339;uds, unit&eacute;s, articles), unit&eacute;s d'information</a></h2>

<p>Les hypertextes sont con&ccedil;us de telle fa&ccedil;on qu'ils ne sont pas pr&eacute;vus pour &ecirc;tre lus de fa&ccedil;on s&eacute;quentielle. Mais qu'est-ce qui doit remplacer la lecture s&eacute;quentielle? R&eacute;ponse: des unit&eacute;s de texte qui forment un tout en soi et qui, chacune, proposent une petite poign&eacute;e d'information. En reliant intelligemment les unes aux autres ces unit&eacute;s de texte se forme alors cet espace d'informations que l'on d&eacute;signe comme hypertexte.</p>

<p>Pour ces unit&eacute;s de texte on a par le pass&eacute; trouv&eacute; de nombreux termes. En voici quelques uns:</p>

<ul>
<li><b>node</b> (n&#339;ud)(pour le mod&egrave;le de donn&eacute;es <img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#ham"><b>HAM</b></a>)</li>
<li><b>unit</b> (unit&eacute;) ou <b>item</b> (article)</li>
<li><b>document</b> (pour le logiciel <i>Intermedia</i>)</li>
<li><b>card</b> (&eacute;cran)(pour les logiciels <i>NoteCards</i> et <i>HyperCard</i>)</li>
<li><b>information blocks</b>(blocs d'information)</li>
<li><b>frame</b> (cadre) (pour le logiciel <i>KMS</i>)</li>
<li><b>statement</b> (communiqu&eacute;)(pour le logiciel <i>Augment</i>)</li>
<li><b>message</b> (message)(pour le logiciel <i>KnowledgePRO</i>)</li>
<li><b>article</b> (pour le logiciel <i>HyperTies</i>)</li>
<li><b>hyper-molecule</b> (pour le logiciel <i>HyperCOSTOC</i>)</li>
<li><b>guideline</b> (ligne directrice)(pour les logiciels <i>Guide</i> et <i>NaviTextSAM</i>)</li>
</ul>

<p>Certains des produits logiciels nomm&eacute;s sont historiques et ne se trouvent plus sur le march&eacute;. Au vu de cette liste on remarque que tous ces logiciels connaissent quelque chose d'analogue aux unit&eacute;s d'information. Seul dans le <img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="../internet/www.htm"><b>World Wide Web</b></a> quelque chose d'analogue fait d&eacute;faut, et m&ecirc;me en  <img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="../technologies/html.htm"><b>HTML</b></a> il n'y a rien par quoi on puisse d&eacute;finir une unit&eacute; d'information. Il y a de bonnes raisons &agrave; cette r&eacute;serve. La d&eacute;finition d'unit&eacute;s d'information peut conduire en effet facilement &agrave; des contraintes touchant leur contenu. Un &quot;card&quot; (&eacute;cran) ou un &quot;message&quot; (message) n'est dans le fond pas un r&eacute;cipient vide mais un r&eacute;cipient qui exprime d&eacute;j&agrave; dans son titre mais aussi la plupart du temps par sa transcription technique certaines repr&eacute;sentations de ce qu'il contient. On voulait sur le Web renoncer &agrave; ces avantages. En r&egrave;gle g&eacute;n&eacute;rale, un fichier HTML est une unit&eacute; d'information judicieuse. Parfois, ce sont aussi des partiea d'un fichier HTML o&ugrave; l'on peut sauter par une ancre. Cela peut &ecirc;tre aussi tout un projet fini en soi, dont on a une bonne vue d'ensemble qui comporte plusieurs fichiers que l'on peut consid&eacute;rer comme unit&eacute; d'information. Pour les contenus cr&eacute;&eacute;s de fa&ccedil;on dynamique, les limites d'une unit&eacute; sont encore diff&eacute;rentes. Sur le Web, m&ecirc;me le texte qui ne donne pas du tout l'impression d'&ecirc;tre de l' &quot;hypertexte&quot; est possible. M&ecirc;me la documentation que vous &ecirc;tes en train de lire a en partie plut&ocirc;t des suites classiques de caract&egrave;res &agrave; lire s&eacute;quentiellement que ce qu'on attend de l'hypertexte typique. Pourtant il y a aussi sans aucun doute dans cette documentation et sur le Web en g&eacute;n&eacute;ral des sujets distincts bien reconnaissables. Il n'y a tout simplement aucun sch&eacute;ma dans lequel ce genre de sujets doivent se laisser cataloguer.</p>




<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="cohesion">n:m-Relation (relation n:m), harmonie de la coh&eacute;sion</a></h2>

<p>Il doit suffire &agrave; une unit&eacute; hypertexte d'&ecirc;tre une cible de lien sens&eacute;e quand elle est appel&eacute;e de contextes tout &agrave; fait diff&eacute;rents. Si l'utilisateur, &agrave; un endroit quelconque, clique sur un lien menant &agrave; cette unit&eacute; de texte, l'unit&eacute; de texte doit &ecirc;tre structur&eacute;e de telle fa&ccedil;on que dans tous les cas elle satisfasse au changement de pens&eacute;e que l'utilisateur a &quot;os&eacute;&quot; avoir avec ce lien. &Eacute;tant donn&eacute; que le contexte &agrave; savoir la relation avec l'information &agrave; partir de laquelle l'utilisateur a cliqu&eacute; peut &ecirc;tre tr&egrave;s diff&eacute;rent, cette unit&eacute; de texte doit &ecirc;tre ainsi con&ccedil;ue qu'elle satisfasse &agrave; tous les contextes imaginables. Elle ne peut le faire qu'en s'enfermant en quelque sorte pour se concentrer radicalement sur ses propres assertions. Cet enfermement sur soi est d&eacute;sign&eacute; comme &quot;harmonie de la coh&eacute;sion&quot;. La constellation que de nombreuses autres unit&eacute;s de texte puissent mener par un lien &agrave; une seule et m&ecirc;me unit&eacute; de texte s'appelle la relation n:m-Relation (n = nombreux, m = une cible quelconque mais une cible d&eacute;termin&eacute;e).</p>

<p>Avec le terme d' &quot;unit&eacute; d'information&quot;, <img src="../../src/docf.gif" width="15" height="10" border="0" alt="D&eacute;monstration - nouvelle fen&ecirc;tre">&nbsp;<a href="../../sources/kuhlen.htm" target="_blank"><b>Kuhlen</b></a> essaie d'instaurer un terme scientifique de l'information discut&eacute; pour l' &quot;unit&eacute;&quot; d'un hypertexte. Ce faisant il d&eacute;veloppe aussi la probl&eacute;matique de l'harmonie de la coh&eacute;sion, car:</p>

<p><cite>&quot;La connaissance ou plut&ocirc;t l'information actuelle est toujours incorpor&eacute;e dans un contexte plus important s&eacute;mantique et / ou dialectique&quot;</cite> (<img src="../../src/docf.gif" width="15" height="10" border="0" alt="D&eacute;monstration - nouvelle fen&ecirc;tre">&nbsp;<a href="../../sources/kuhlen.htm" target="_blank"><b>Kuhlen</b></a>, page 81). il n'existe pas d' &quot;&eacute;l&eacute;ment autonome d'information&quot;. Comment est-il alors possible de proposer de l'information dans des unit&eacute;s hypertexte qui doivent satisfaire &agrave; la condition d'&ecirc;tre un tout coh&eacute;rent? <cite>&quot;Bien que tout l'art r&eacute;side &agrave; fixer des unit&eacute;s d'information de telle sorte qu'elles se suffisent `elles-m&ecirc;mes pour &ecirc;tre comprises elles doivent en m&ecirc;me temps par un lien mener &agrave; leur contexte d'information&quot;</cite> (<img src="../../src/docf.gif" width="15" height="10" border="0" alt="D&eacute;monstration - nouvelle fen&ecirc;tre">&nbsp;<a href="../../sources/kuhlen.htm" target="_blank"><b>Kuhlen</b></a>, page 81).</p>

<p>Une unit&eacute; hypertexte doit en cons&eacute;quence former un tout et en m&ecirc;me temps mener explicitement par un lien &agrave; une information parente ou hi&eacute;rarchiquement sup&eacute;rieure pour montrer au lecteur/utilisateur le contexte de cette information. Cela peut prendre la forme de liens crois&eacute;s ex&eacute;cutables, de liens au niveau sup&eacute;rieur ou de liens &agrave; des aides de navigation particuli&egrave;res.</p>





<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="visualisations_web">Web-views (Visualisations Web)</a></h2>

<p>&Agrave; la diff&eacute;rence d'un livre, on ne peut pas voir imm&eacute;diatement d'un hypertexte sauvegard&eacute; &eacute;lectroniquement, quel volume il repr&eacute;sente. Le lecteur/utilisateur a pourtant la t&acirc;che facilit&eacute;e pour la navigation dans l'offre d'information, s'il peut se faire une repr&eacute;sentation pratique de l'offre d'information, s'il peut se repr&eacute;senter donc un &quot;espace&quot; d'information avec telle ou telle taille et complexit&eacute;. Cela r&eacute;duit le sentiment d'  <img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#lost_in_hyperspace"><b>&quot;&ecirc;tre perdu dans l'hyperespace&quot;) </b></a>.</p>

<p>Les Visualisations Web sont des vues globale sur un hypertexte qui visent &agrave; visualiser l'espace d'information propos&eacute;. Une Visualisation Web doit pouvoir montrer &agrave; l'utilisateur qui navigue l'hypertexte complet comme une esp&egrave;ce de plan d'une ville et pouvoir afficher dans la mesure du possible, dans chaque situation o&ugrave; il se sera mis, un &quot;Vous &ecirc;tes ici!&quot;. Pour cela il faut en tout &eacute;tat de cause des possibilit&eacute;s de repr&eacute;sentation graphiques bien au point. Qu'on s'imagine seulement un hypertexte avec des milliers d'unit&eacute;s de texte et davantage encore de liaisons. La visualisation d'un tel r&eacute;seau pose probl&egrave;me et on peut se demander s'il y a un gain pour l'orientation du navigateur. Dans la pratique, les visualisations Web locales ont plus de sens; elles repr&eacute;sentent la partie actuelle du document dans son contexte, ou les Visualisations Web non-locales qui pr&eacute;sentent avant l'ex&eacute;cution d'un lien &agrave; une autre partie du document, si on le souhaite, cette partie du document sous forme de r&eacute;capitulatif.</p>





<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="fish_eye_views">fish-eye views (visualisations &#339;il de poisson)</a></h2>

<p>une visualisation &#339;il de poisson est une offre d'avoir une information plus d&eacute;taill&eacute;e sur un th&egrave;me abord&eacute;. La possibilit&eacute; d'approfondir aussi loin qu'on le d&eacute;sire un th&egrave;me au choix sans d&eacute;lai, est encore du domaines des visions de l'hypertexte. Pas besoin de feuilleter longtemps, de chercher sur un autre rayon, de courir dans une autre biblioth&egrave;que, mais un simple clic de souris ou une touche qu'on appuie. La disponibilit&eacute; de l'information au moment de la concentration et de l'int&eacute;r&ecirc;t spontan&eacute;. Cela doit fonder la &quot;plus-value informationnelle&quot; (<img src="../../src/docf.gif" width="15" height="10" border="0" alt="D&eacute;monstration - nouvelle fen&ecirc;tre">&nbsp;<a href="../../sources/kuhlen.htm" target="_blank"><b>Kuhlen</b></a>) de l'hypertexte par rapport aux sources d'information traditionnelles.</p>

<p>La condition pr&eacute;alable en est des r&eacute;seaux hypertexte de taille gigantesque. <img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="histoire.htm#nelson"><b>Ted Nelson</b></a> passe pour un pr&eacute;curseur dans la conception de tels r&eacute;seaux. Avec son projet  <b>Xanadu</b> il a voulu cr&eacute;er un tel r&eacute;seau. L'&eacute;mergence d'un tel projet lui a &eacute;t&eacute; refus&eacute;e. &Agrave; la place, nous avons aujourd'hui avec le World Wide Web un r&eacute;seau dont la croissance met dans l'ombre m&ecirc;me les r&ecirc;ves les plus t&eacute;m&eacute;raires des visionnaires de l'hypertexte. Pourtant c'est justement la prolif&eacute;ration incontr&ocirc;l&eacute;e de ce r&eacute;seau qui rend difficile la r&eacute;alisation de visualisations &#339;il de poisson. &Eacute;tant donn&eacute; qu'ici aussi la qualit&eacute; de l'information est si variable, un syst&egrave;me de visualisations &#339;il de poisson organis&eacute; est r&eacute;alisable dans des parties du WWW, par exemple entre certains fournisseurs d'information orient&eacute;s vers le domaine scientifique.</p>





<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="information_retrieval">Information Retrieval (recherche documentaire)</a></h2>

<p>La Information Retrieval (recherche documentaire) est l'art et la mani&egrave;re avec lesquels un utilisateur arrive en fin de compte &agrave; des informations concr&egrave;tes dans des grandes quantit&eacute;s de donn&eacute;es.</p>

<p>Un projet hypertexte au point, atteint par son &eacute;tendue facilement des ouvrages en plusieurs volumes. Un tel hypertexte sera plus utilis&eacute; pour rechercher une information cibl&eacute;e que pour bouquiner tranquillement. Dans des bases de donn&eacute;es classiques celui qui cherche l'information y parvient par des requ&ecirc;tes correspondantes. C'est lui qui doit formuler ces requ&ecirc;tes, par exemple  &quot;montre moi tous les clients qui habitent Monaco, sont c&eacute;libataires et gagnent plus de 5&nbsp;000&nbsp;&euro; par mois &quot;. Pour ce faire, il doit pourtant savoir auparavant ce qu'il cherche. Dans des quantit&eacute;s d'informations orient&eacute;es sur le texte, la formulation d'une requ&ecirc;te est plus compliqu&eacute;e que dans des donn&eacute;es structur&eacute;es. Les recherches de mot cl&eacute; dans une base de donn&eacute;es en texte ne peuvent jamais donner - tout au moins sans mise en &#339;uvre d'intelligence artificielle - de r&eacute;sultats des recherches aussi riches d'informations et aussi exacts que des requ&ecirc;tes dans une base de donn&eacute;es orient&eacute;e sur des champs.</p>

<p>Dans des quantit&eacute;s d'informations orient&eacute;es sur le texte, l'acc&egrave;s &agrave; l'information doit pour cette raison &ecirc;tre organis&eacute; pour &ecirc;tre id&eacute;al sur plusieurs voies. La recherche de mots cl&eacute;s soutenue par programme doit &ecirc;tre possible de la m&ecirc;me fa&ccedil;on que l'acc&egrave;s par un syst&egrave;me de liens bien sous-divis&eacute;s.</p>





<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="lost_in_hyperspace">Orientation, Navigation, &quot;Lost in Hyperspace&quot; (perdu dans l'hyperespace)</a></h2>

<p>Si on examine un hypertexte &quot;vu d'avion&quot; il s'y trouve des <img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut">&nbsp;<a href="#cohesion"><b>relations n:m</b></a>. Du point de vue du lecteur d'un hypertexte pourtant, il n'y a pas de relations n:m. Dans une situation donn&eacute;e, il y a tout au plus une relation 1:m, &agrave; savoir plusieurs liens qui partent de l'unit&eacute; de texte actuelle. Ces liens repr&eacute;sentent - avec les fonctions hypertexte toujours disponibles comme les <img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#backtracking"><b>Backtracking (retour en arri&egrave;re) et  signets</b></a> - l'arsenal des possibilit&eacute;s d'orientation que l'utilisateur a &agrave; sa disposition pour voyager judicieusement dans une offre d'information.</p>

<p>Ce qui peut vu d'avion avoir l'air d'une libert&eacute; de mouvements dans un r&eacute;seau fascinant est du point de vue de l'utilisateur concret de ce r&eacute;seau la t&acirc;che de se retrouver dans ce r&eacute;seau dont il n'a pas une vision imm&eacute;diate, de s'y orienter. Se mouvoir dans un r&eacute;seau hypertexte dont on n'a qu'une vue partielle signifie y <b>naviguer</b>. L'emprunt au monde du voyage en haute mer est choisi intentionnellement et a pouss&eacute; le fournisseur de navigateur Netscape &agrave; baptiser au d&eacute;but son c&eacute;l&egrave;bre programme le <i>Netscape Navigator</i>.</p>

<p>Celui qui navigue s'oriente aux liens qui lui sont propos&eacute;s. Si les liens ne sont pas intelligents et ne dressent pas une relation contextuelle, celui qui navigue est menac&eacute; de perdre son orientation et de tomber dans cet &eacute;tat que l'on d&eacute;signe dans la litt&eacute;rature hypertexte comme <b>Lost in Hyperspace</b> - perdu dans l'hyperespace.</p>





<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="guided_tours">Chemins, Trails (pistes), Guided Tours (visites guid&eacute;es)</a></h2>

<p>La plupart des utilisateurs de l'hypertexte ne sont pas encore des  &quot;navigateurs&quot; exp&eacute;riment&eacute;s. Ils sont habitu&eacute;s &agrave; prendre des informations dans des livres et ils souhaitent avoir en plus des sauts hypertexte ind&eacute;l&eacute;biles la possibilit&eacute; de parcourir l'offre d'information par une suite d'&eacute;tapes pr&eacute;d&eacute;finies. Ce genre de cha&icirc;nes d'unit&eacute;s d'un hypertexte reli&eacute;es entre elles est d&eacute;sign&eacute; par <b>chemin</b> - en anglais <i>trail</i> (piste)- ou aussi comme <b>visites guid&eacute;es</b> - en anglais <i>guided tours</i>.</p>

<p>La pr&eacute;sente documentation vous propose sur les pages comme celle-ci par exemple &agrave; la fin de la page des sauts aux pages suivante et pr&eacute;c&eacute;dente. Maintenant, il n'en va pas toujours ainsi que le th&egrave;me qui se trouve apr&egrave;s le th&egrave;me actuel lui soit tr&egrave;s proche quant au contenu. Il s'agit davantage d'une proposition qui doit encourager &agrave; voyager plus loin m&ecirc;me dans des situations critiques - &agrave; savoir des situations du genre: &quot;Je ne sais vraiment pas du tout ce qui m'int&eacute;resse maintenant&quot; (le sentiment typique du <img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut">&nbsp;<a href="#lost_in_hyperspace"><b>Lost in Hyperspace</b></a>).</p>





<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="backtracking">Backtracking (retour en arri&egrave;re), Historie (historique), signets</a></h2>

<p><b>Backtracking</b> signifie refaire en arri&egrave;re le chemin parcouru pour la lecture. L'historique est ce qui est n&eacute;cessaire pour le faire: le protocole des unit&eacute;s hypertexte visit&eacute;es jusqu'&agrave; un moment donn&eacute;.</p>

<p><b>Les  signets</b> - en anglais <i>bookmarks</i> - sont des rep&egrave;res que le lecteur pose pour des unit&eacute;s de texte particuli&egrave;rement int&eacute;ressantes pour lui ou pour des unit&eacute;s de texte centrales auxquelles il peut sauter &agrave; tout moment.</p>

<p>En hypertexte m&ecirc;me de telles fonctions ne sont pas r&eacute;alisables, tout au plus adressables (ainsi l'auteur d'une page Web peut-il demander par exemple avec <img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="../technologies/javascript.htm"><b>JavaScript</b></a> les pages Web visit&eacute;es par l'utilisateur). D'abord pourtant, il faut que le logiciel de navigation utilis&eacute; par l'utilisateur mette ces fonctions &agrave; sa disposition, &eacute;tant donn&eacute; qu'il s'agit dans les deux cas de donn&eacute;es de navigation sp&eacute;cifiques &agrave; la session ou bien de points marquants de la navigation sp&eacute;cifiques &agrave; l'utilisateur.</p>

<p>Pour quelques produits logiciels la dur&eacute;e de vie de signets et de l'historique est limit&eacute;e &agrave; une session, c'est &agrave; dire que les donn&eacute;es ne sont conserv&eacute;es que dans la m&eacute;moire de travail et sont perdues quand le programme de navigation est ferm&eacute; ou bien elles peuvent &ecirc;tre durablement sauvegard&eacute;es sous forme de fichier. La plupart des navigateurs modernes permettent &agrave; l'utilisateur de r&eacute;gler eux m&ecirc;me jusqu'o&ugrave; l'historique doit pouvoir remonter.</p>





<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="browsing_authoring">Browsing (navigation), Authoring (cr&eacute;ation)</a></h2>

<p><b>Browsing</b> signifie navigation &ccedil;a et l&agrave; et m&ecirc;me avec une plus-value informative ou cr&eacute;ative. C'est ce que souhaitent pour le lecteur les tenants de l'hypertexte enthousiastes . Pourtant aussi longtemps qu'il n'y aura pas d'hyper ordinateur les liens que le lecteur doit d&eacute;couvrir seront pos&eacute;s par les auteurs.</p>

<p><b>Authoring</b> est la tentative &agrave; vrai dire impossible de munir un hypertexte de toute l'intelligence qui seule doit communiquer au lecteur la plus-value par rapport au texte s&eacute;quentiel. &Agrave; vrai dire il faudrait que des auteurs hyper intelligents &eacute;crivent pour des lecteurs normalement intelligents. Pourtant il n'y a pas que des auteurs normalement intelligents qui &eacute;crivent de l'hypertexte - non, m&ecirc;me les lecteurs eux-m&ecirc;mes continuent &agrave; &eacute;crire des hypertexte. Car la poursuite de l'&eacute;criture par l'utilisateur fait elle aussi partie de l' Authoring dans certains syst&egrave;mes hypertexte. La s&eacute;paration entre l'auteur et le lecteur dans le domaine de l'hypertexte est, th&eacute;oriquement du moins, coulante et en partie lev&eacute;e car les contraintes propres aux m&eacute;dias imprim&eacute;s telles que le tirage, les co&ucirc;ts pour une r&eacute;&eacute;dition etc... sautent pour beaucoup.</p>

<p>Dans les syst&egrave;mes hypertexte on distingue g&eacute;n&eacute;ralement entre les navigateurs simples (acc&egrave;s en lecture seule) et les syst&egrave;mes qui permettent l'&eacute;dition ou la poursuite de l'&eacute;criture. Une poursuite de l'&eacute;criture de tout et par tous n'est cependant possible dans la pratique que dans des cercles restreints d'utilisateurs, pour &eacute;viter une entorse juridique aux droits de propri&eacute;t&eacute; intellectuelle et pour pr&eacute;server la qualit&eacute;. Sur le Web une distinction est clairement faite  - bien que son p&egrave;re fondateur s'y f&ucirc;t longtemps oppos&eacute; - entre les fournisseurs et les lecteurs de pages Web. Par des chemins d&eacute;tourn&eacute;s techniques comme l'interface <img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="../technologies/cgiperl.htm"><b>CGI</b></a> il est en effet possible de r&eacute;aliser des projets Web qui croissent de fa&ccedil;on interactive et auxquels plusieurs personnes peuvent travailler en ligne. Un forum de discussion est par exemple une application de ce genre et des forums de discussion avec beaucoup d'articles de haut niveau font bien partie aussi des formes modernes les plus palpitantes de l'hypertexte.</p>





<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="sharks_scrollers">Sharks (requins), Holy Scrollers (saints d&eacute;fileurs), fichier, m&eacute;taphore livresque</a></h2>

<p>Dans le monde sp&eacute;cialis&eacute; de l'hypertexte un d&eacute;bat s'est ouvert entre ceux qui veulent interdire le d&eacute;filement (faire monter ou descendre le texte) et ceux qui veulent l'autoriser. Les <b>Sharks</b> (<i>requins</i>) sont ceux qui plaident pour qu'une unit&eacute; de texte doive &ecirc;tre per&ccedil;ue d'un coup d'&#339;il; Les <b>Holy Scrollers</b> (<i>saints d&eacute;fileurs</i>) sont ceux qui ne veulent pas imposer &agrave; la taille d'une unit&eacute; de texte, les limites d'un &eacute;cran. Les requins tendent &agrave; cr&eacute;er des hypertextes comme des syst&egrave;me de fichier. L'&eacute;l&eacute;ment de base y est la fiche avec sa taille invariable. Les saint d&eacute;fileurs par contre privil&eacute;gient la m&eacute;taphore livresque pour la cr&eacute;ation d'hypertextes. Les &eacute;l&eacute;ments de base y sont des portions de texte de longueur variable selon les circonstances.</p>

<p>Aujourd'hui des syst&egrave;mes qui n'imposent plus de limites de taille &agrave; une unit&eacute; de texte se sont largement impos&eacute;s. M&ecirc;me les pages Web peuvent avoir la taille que l'on veut leur donner. Pourtant, justement sur le WWW et &agrave; l'aide de techniques comme les <img src="../../src/chap.gif" width="15" height="13" border="0" alt="Chapitre: vue d'ensemble">&nbsp;<a href="../../html/frames/index.htm"><b>cadres</b></a> souvent une proposition d'information tient sur un &eacute;cran car la perception du contexte global de l'information a des avantages incontestables.</p>





<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="ham">Hypertext Abstract Machines (Machines hypertexte abstraites)</a></h2>

<p><cite>Dans de nombreux domaines de la programmation, il s'est souvent av&eacute;r&eacute; que la meilleure m&eacute;thode d'impl&eacute;mentation &eacute;tait de r&eacute;aliser avec des moyens techniques logiciels une machine abstraite ou virtuelle... pour une classe de programmes d'application, sur laquelle le logiciel proprement-dit peut ensuite travailler</cite> (<img src="../../src/docf.gif" width="15" height="10" border="0" alt="D&eacute;monstration - nouvelle fen&ecirc;tre">&nbsp;<a href="../../sources/schnupp.htm" target="_blank"><b>Schnupp</b></a>, page 85).</p>

<p>Un exemple &agrave; l'appui sont les bases de donn&eacute;es comme <i>dBase</i>, <i>FoxPro</i> parmi d'autres, qui prennent la place de logiciels sp&eacute;cialis&eacute;s distincts, par exemple pour la gestion des clients, la gestion des stocks d'une biblioth&egrave;que etc. La m&ecirc;me chose vaut pour l'hypertexte: on peut programmer l'hypertexte d&eacute;finitivement ou bien on programme un logiciel ind&eacute;pendant, abstrait qui soutient l'impl&eacute;mentation d'hypertextes en mettant &agrave; sa disposition les moyens et fonctions appropri&eacute;es. Comme syst&egrave;me professionnel de ce genre  Schnupp cite par exemple le produit <i>HAM</i> (Hypertext Abstract Machine) ou <i>HyperBase</i>.</p>

<p>Le concept cependant va encore plus loin dans la standardisation d'un format de donn&eacute;es hypertexte qui ne soit pas li&eacute; &agrave; un logiciel d&eacute;termin&eacute;. Le format jusqu'alors le plus ambitieux de ce genre est  SGML (Structured Generalized Markup Language), aujourd'hui r&eacute;pandu davantage dans sa descendance plus mod&eacute;r&eacute;e<img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="../technologies/xml.htm"><b>XML</b></a>. Une sous-classe de SGML et r&eacute;cemment aussi de XML est le <img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="../technologies/html.htm"><b>HTML</b></a>, le format de donn&eacute;es pour pour l'hypertexte sur le World Wide Web. Ici, il ne s'agit plus exactement d'une machine hypertexte abstraite au sens strict du terme, mais d'une forme abstraite d'hypertexte - ce n'est pas seulement ind&eacute;pendant de toute application mais aussi ind&eacute;pendant de toute plate-forme.</p>





<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="www">World Wide Web</a></h2>

<p>L'hypertexte sur le Web d&eacute;passe sur deux points les r&eacute;alisations hypertexte li&eacute;es &agrave; des produits logiciels dans l'<img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="histoire.htm"><b>histoire de l'hypertexte </b></a> :</p>

<ul>
<li>L'hypertexte sur le Web mise sur un langage de description hypertexte ind&eacute;pendant de tout logiciel, &agrave; savoir sur HTML (Hypertext Markup Language).</li>
<li>L'hypertexte sur le Web mise sur un r&eacute;seau bien &eacute;tabli d'ordinateurs qui existe d&eacute;j&agrave; &agrave; l'&eacute;chelle du monde, l'Internet.</li>
</ul>

<p>&Agrave; vrai dire le projet Xanadu de Ted Nelson vise un apport similaire global &eacute;tendu de la m&ecirc;me fa&ccedil;on, mai il fut d&eacute;pass&eacute; pourtant par le d&eacute;veloppement du Web. Le Web est une plate-forme maintenue la plus g&eacute;n&eacute;rale possible pour un hypertexte mondial en ce sens qu'il ne fixe que des &eacute;l&eacute;ments formels tels les formats de date, les adresses et les protocoles de communication logiciels.</p>

<p>La r&eacute;alit&eacute; du Web aujourd'hui est il est vrai un peu diff&eacute;rente que dans les r&ecirc;ves des fournisseurs d'information reli&eacute;s dans le monde. La commercialisation, les offres &eacute;gocentriques et les informations nulles dominent. Le &quot;v&eacute;ritable&quot; hypertexte conduit plut&ocirc;t au sentiment de pantouflage. Pourtant aussi longtemps que les &quot;v&eacute;ritables&quot; hyper-liens trouveront leur chemin sur le r&eacute;seau, une utilisation diversifi&eacute;e du Web n'est pas forc&eacute;ment dommageable. La commercialisation y compris la lutte de la concurrence peut aussi contribuer &agrave; ce que des aspects posant probl&egrave;me sur le plan financier comme de plus hautes largeurs de bande pour la transmission de donn&eacute;es soient r&eacute;solus plus facilement dans le futur.</p>





<table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr><td colspan="2" bgcolor="#EEEEEE" class="doc">
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a>
</td></tr>
<tr><td bgcolor="#EEEEEE" class="doc" align="right"><a href="histoire.htm"><img src="../../src/suivant.gif" width="10" height="10" border="0" hspace="10" alt="page suivante"></a></td>
<td bgcolor="#FFFFFF"><img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information"> <a href="histoire.htm"><b>Histoire de l'hypertexte</b></a>
</td></tr>
<tr>
<td bgcolor="#EEEEEE" class="doc" align="right"><a href="definitions.htm"><img src="../../src/precedent.gif" width="10" height="10" border="0" hspace="10" alt="page pr&eacute;c&eacute;dente"></a></td>
<td bgcolor="#FFFFFF" width="100%"><img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information"> <a href="definitions.htm"><b>D&eacute;finitions sur l' &quot;hypertexte&quot;</b></a>
</td>
</tr>
<tr><td colspan="2" bgcolor="#EEEEEE" class="doc">&#160;</td></tr>
</table><table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr>
<td bgcolor="#FFEEDD" class="nav"><a class="an" name="bottom"><img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"></a> <a href="../../index.htm"><b>SELFHTML</b></a>/<a href="../../navigation/index.htm" target="_parent">Aides &agrave; la navigation</a> <img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="../index.htm"><b>Introduction</b></a> <img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="index.htm"><b>Hypertexte</b></a></td>
</tr>
</table>

<p>&copy; 2001 Stefan M&uuml;nz / &copy; 2003 Traduction <img src="../../src/courriel.gif" width="15" height="10" border="0" alt="Adresse &eacute;lectronique">&nbsp;<a href="mailto:13405@free.fr">Serge Fran&ccedil;ois, 13405@free.fr</a><br><img src="../../src/courriel.gif" width="15" height="10" border="0" alt="Adresse &eacute;lectronique">&nbsp;<a href="mailto:selfhtml@selfhtml.com.fr">selfhtml@selfhtml.com.fr</a></p>



</body>
</html>
