<html>
<head>
<title>Texte &agrave; plusieurs colonnes (Netscape)</title>
<!-- Matomo -->
<script type="text/javascript">
  var _paq = window._paq = window._paq || [];
  /* tracker methods like "setCustomDimension" should be called before "trackPageView" */
  _paq.push(['trackPageView']);
  _paq.push(['enableLinkTracking']);
  (function() {
    var u="//matomo.boitasite.com/";
    _paq.push(['setTrackerUrl', u+'matomo.php']);
    _paq.push(['setSiteId', '1']);
    var d=document, g=d.createElement('script'), s=d.getElementsByTagName('script')[0];
    g.type='text/javascript'; g.async=true; g.src=u+'matomo.js'; s.parentNode.insertBefore(g,s);
  })();
</script>
<!-- End Matomo Code -->
</head>
<body>

<multicol cols="3" gutter="10">

<p>La lecture du texte suivant peut vous faire perdre la fascination que vous &eacute;prouvez pour la magie! ne lire ces explications qu'apr&egrave;s avoir vu le tour!</p>

<h3>D.C. devine les graffitis &agrave; l'avance</h3>

<p>Le tour lors duquel DC et Claudia Schiffer se sont connus: lors de la
premi&egrave;re &agrave; Berlin, elle &eacute;tait la volontaire (bien qu'elle vint avec une demie heure de retard).</p>

<p>DC am&egrave;ne un mur &agrave; roulettes sur la sc&egrave;ne. Il explique qu'il peut pr&eacute;voir les graffitis. Il montre une enveloppe qui est pendue &agrave; un r&eacute;verb&egrave;re. Il se laisse nommer par les spectateurs divers noms et chiffres qu'il fait &quot;taguer&quot; sur le mur par une spectatrice. Finalement il fait ranger les a&eacute;rosols par la spectatrice (Il faut de l'ordre). Il pr&eacute;sente l'enveloppe &agrave; la spectatrice. L&agrave; se trouve un mouchoir sur lequel se trouve exactement, mise
&agrave; part une diff&eacute;rence amusante, ce qui se trouve sur le mur.</p>

<p>Il n'y a pas de voyant et les diff&eacute;rents spectateurs ont &eacute;t&eacute; choisis d'une fa&ccedil;on qui me semble digne de foi. Une comparaison exacte du mur avec le mouchoir montre des diff&eacute;rences minimes qui excluent l'usage d'un carbone (par ailleurs existe la diff&eacute;rence amusante). Explication: Pendant que la spectatrice range les a&eacute;rosols, le mouchoir qui a &eacute;t&eacute; &eacute;crit par un complice arrive d'une
fa&ccedil;on quelconque dans l'enveloppe ferm&eacute;e sacro-sainte et situ&eacute;e en hauteur. Cela se passe au moment o&ugrave; DC tient l'enveloppe contre le mur pour attraper le coupe papier qui se trouve en haut dans le mur.</p>

<p>Le mouchoir est ensuite sorti de derri&egrave;re l'enveloppe. Ce qui peut se faire par exemple &agrave; l'aide d'une fente de fa&ccedil;on que m&ecirc;me une v&eacute;ritable spectatrice ne remarque rien. Sur la vid&eacute;o, on peut d'ailleurs voir qu'il cache la man&#339;uvre en partie avec son corps. Le mouchoir &quot;leurre&quot; reste dans l'enveloppe.</p>

<p>Une version diff&eacute;rente de ce tour a &eacute;t&eacute; montr&eacute;e dans l'&eacute;mission de Upn Swutsch. L&agrave; il s'agissait d'une caisse qui &eacute;tait ferm&eacute;e en hauteur. C'est pourquoi un assistant devait aussi venir ouvrir la caisse en se tenant derri&egrave;re elle. Ici aussi il y avait donc une possibilit&eacute; de manipulation.</p>

</multicol>

</body>
</html>
