<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>SELFHTML: Introduction / Internet et le WWW / Apparition d'Internet</title>
<link rel="stylesheet" type="text/css" href="../../src/selfhtml.css">
<meta name="description"    content="Comment est apparu et s'est d&eacute;velopp&eacute; Internet.">
<meta name="keywords"       content="SELFHTML, Internet, histoire d'Internet, ARPA-Net, TCP/IP, EuropaNet, RIPE">
<meta name="author"         content="Stefan M&uuml;nz, selfhtml@teamone.de">
<meta http-equiv="content-type" content="text/html; charset=ISO-8859-1">
<meta name="DC.Publisher"   content="Serge Fran&ccedil;ois, selfhtml@selfhtml.com.fr">
<meta name="DC.Date"        content="2003-01-27T08:00+00:00">
<meta name="DC.Identifier"  content="http://selfhtml.selfhtml.com.fr/introduction/internet/apparition.htm">
<meta name="DC.Language"    content="fr">
<meta name="DC.Rights"      content="../../editorial/copyright.htm">
<meta name="DC.Date.Create" content="2003-01-27T08:00+00:00">
<meta name="SELF.Version"   content="1">
<meta name="SELF.Pagetype"  content="Information">
<meta name="SELF.Path"      content="SELFHTML == ../../index.htm // introduction == ../index.htm // Internet et le WWW == index.htm">
<!-- Matomo -->
<script type="text/javascript">
  var _paq = window._paq = window._paq || [];
  /* tracker methods like "setCustomDimension" should be called before "trackPageView" */
  _paq.push(['trackPageView']);
  _paq.push(['enableLinkTracking']);
  (function() {
    var u="//matomo.boitasite.com/";
    _paq.push(['setTrackerUrl', u+'matomo.php']);
    _paq.push(['setSiteId', '1']);
    var d=document, g=d.createElement('script'), s=d.getElementsByTagName('script')[0];
    g.type='text/javascript'; g.async=true; g.src=u+'matomo.js'; s.parentNode.insertBefore(g,s);
  })();
</script>
<!-- End Matomo Code -->
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#AA5522" vlink="#772200" alink="#000000">

<table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr>
<td bgcolor="#FFEEDD" class="nav"><a class="an" name="top"><img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"></a> <a href="../../index.htm"><b>SELFHTML</b></a>/<a href="../../navigation/index.htm" target="_parent">Aides &agrave; la navigation</a> <img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="../index.htm"><b>Introduction</b></a> <img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="index.htm"><b>Internet et le WWW</b></a></td>
</tr>
</table><table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr>
<td bgcolor="#EEEEEE" class="doc" width="110"><img src="../../src/logo.gif" width="106" height="109" border="0" alt="SELFHTML"></td>
<td bgcolor="#EEEEEE" class="doc" valign="bottom" width="100%"><h2>Apparition d'Internet</h2>
<tr>
<td bgcolor="#EEEEEE" class="doc" valign="top" align="center">
<img src="../../src/docx.gif" width="30" height="20" vspace="6" border="0" alt="Page d'information: vue d'ensemble">
</td>
<td bgcolor="#FFFFFF" valign="top" nowrap>
<p>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#arpanet"><b>Le r&eacute;seau ARPA</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#science"><b>Installations scientifiques</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#reseaureseau"><b>Le r&eacute;seau des r&eacute;seaux</b></a><br>
</p>
</td>
</tr><tr><td colspan="2" bgcolor="#EEEEEE" class="doc">&#160;<a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;</td></tr>
</table>



<h2 class="Sh2"><a class="an" name="arpanet">Le r&eacute;seau ARPA</a></h2>

<p>Les origines de l'Internet d'aujourd'hui remontent aux ann&eacute;es 60. C'&eacute;tait l'&eacute;poque de la guerre froide entre les deux puissances mondiales U.S.A. et U.R.S.S.  De nouvelles impulsions dans le traitement des donn&eacute;es survinrent &agrave cette
&eacute;poque principalement gr&acirc;ce &agrave des initiatives militaires. Entre temps il y a bien, sur Internet, des protestations contre la th&eacute;orie selon laquelle, des int&eacute;r&ecirc;ts militaires auraient donn&eacute; naissance &agrave; Internet. C'est justifi&eacute; en ce sens qu'il n'existe pas de lien de cause &agrave; effet direct. Pourtant les id&eacute;es technologiques et les d&eacute;veloppements des r&eacute;seaux dont il est issu, venaient bien indubitablement de l'entourage militaire aux &Eacute;tats Unis et il n'est donc pas erron&eacute; de le d&eacute;crire ainsi.</p>

<p>Au d&eacute;partement de la d&eacute;fense (minist&egrave;re de la guerre  am&eacute;ricain) on r&eacute;fl&eacute;chissait comment prot&eacute;ger au mieux d'importantes donn&eacute;es militaires. M&ecirc;me en cas d'attaque nucl&eacute;aire de l'adversaire, ces donn&eacute;es ne devaient pas pouvoir &ecirc;tre d&eacute;truites. Comme solution, on pensa &agrave un r&eacute;seau de donn&eacute;es &eacute;lectronique. Les m&ecirc;mes donn&eacute;es devaient pour cela &ecirc;tre stock&eacute;es sur
plusieurs ordinateurs tr&egrave;s &eacute;loign&eacute;s les uns des autres. Pour des nouvelles donn&eacute;es ou pour des donn&eacute;es modifi&eacute;es, il fallait que dans un laps de temps tr&egrave;s court tous les ordinateurs reli&eacute;s soient mis &agrave jour. Pour ce faire, chaque ordinateur devait pouvoir &ecirc;tre reli&eacute &agrave n'importe quel autre de plusieurs fa&ccedil;ons diff&eacute;rentes. Ainsi le r&eacute;seau fonctionnerait aussi si un seul ordinateur ou une certaine liaison &eacute;tait d&eacute;truit lors d'une attaque. Ainsi l'US Air Force confia en 1964 &agrave; la RAND Corporation la mission de cr&eacute;er ce qu'on appelle le  &quot;r&eacute;seau d&eacute;centralis&eacute;&quot;. Ce qui devait &ecirc;tre d&eacute;velopp&eacute; l&agrave; n'est pas &agrave; proprement parler l'anc&ecirc;tre direct de l'Internet d'aujourd'hui. Apr&egrave;s de nombreux revirements, ce projet &eacute;choua et ne fut jamais r&eacute;alis&eacute;. L'id&eacute;e du &quot;r&eacute;seau d&eacute;centralis&eacute;&quot; avec sa transmission de donn&eacute;es par paquets ne quitta pourtant pas les esprits.</p>

<p>L'Advanced Research Projects Agency (ARPA), une organisation scientifique existant depuis 1958 et dont le r&eacute;sultat des recherches servait des objectifs militaires se d&eacute;cida en 1966 &agrave; mettre en r&eacute;seau les propres ordinateurs de l'ARPA. C'est l&agrave; qu'on revint &agrave; l'id&eacute;e du &quot;r&eacute;seau d&eacute;centralis&eacute;&quot;. Fin 1969 Les quatre premiers ordinateurs &eacute;taient reli&eacute;s au r&eacute;seau  ARPA. Trois ans plus tard, ils &eacute;taient d&eacute;j&agrave; 40 ordinateurs. Il s'agissait cependant &agrave; cette &eacute;poque du propre r&eacute;seau  ARPA. C'est pourquoi aussi le r&eacute;seau s'est appel&eacute; au cours des premi&egrave;res ann&eacute;es le <b>r&eacute;seau ARPA</b>. C'est lui qui devait devenir plus tard l'Internet.</p>

<p>L'histoire de l'Internet commence donc &agrave l'&eacute;poque du premier pas sur la lune et &agrave l'&eacute;poque o&ugrave les hippies voyaient arriver l'av&egrave;nement du verseau.</p>

<p>Informations sur le r&eacute;seau ARPA sur le WWW:</p>

<p>
<img src="../../src/en.gif" width="16" height="10" border="0" alt="Page en langue anglaise">&nbsp;<a target="_top" href="http://www.arpa.mil/"><b>Defense Advanced Research Projects Agency (DARPA)</b></a>
</p>





<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="science">Installations scientifiques</a></h2>

<p>Le principe d'ordinateurs reli&eacute;s entre eux n'&eacute;tait cependant pas seulement int&eacute;ressant dans le domaine militaire. On r&eacute;alisa vite que l'exploitation universitaire du r&eacute;seau ARPA serait b&eacute;n&eacute;fique. Pour les scientifiques il ne s'agissait pas tant d'avoir les m&ecirc;mes donn&eacute;es sur plusieurs ordinateurs mais plut&ocirc;t la possibilit&eacute de consulter les donn&eacute;es d'un autre ordinateur. &Eacute;tant donn&eacute l'architecture ouverte du r&eacute;seau ARPA rien ne s'opposait &agrave une telle utilisation. Les scientifiques du d&eacute;but des ann&eacute;es 70 pouvaient demander le r&eacute;sultat des recherches d'un autre institut par le r&eacute;seau ARPA ou d'autres instituts reli&eacute;s pouvaient mettre leurs donn&eacute;es &agrave disposition.</p>

<p>Le nombre des ordinateurs reli&eacute;s cr&ucirc;t. Il s'agissait de types d'ordinateurs tr&egrave;s diff&eacute;rents avec des syst&egrave;mes d'exploitation qui n'&eacute;taient pas compatibles et diff&eacute;rents acc&egrave;s au r&eacute;seau. Des gros ordinateurs de fabrication diff&eacute;rente, des ordinateurs sous Unix et plus tard &eacute;galement des
PC se pressaient &agrave l'acc&egrave;s au r&eacute;seau. Quelques uns &eacute;taient aliment&eacute;s en permanence, et &eacute;taient en relation permanente avec Internet, d'autres se reliaient par t&eacute;l&eacute;phone et modem. Pour concilier ces disparit&eacute;s il apparut n&eacute;cessaire de d&eacute;velopper un nouveau protocole de transmission pour le r&eacute;seau. Le protocole ne devait pas &ecirc;tre d&eacute;pendant du syst&egrave;me informatique, du moyen employ&eacute pour transmettre ou de la vitesse de transmission. Le protocole TCP/IP s'imposa comme r&eacute;sultat des efforts pour trouver un tel protocole. La transmission de donn&eacute;es sur le r&eacute;seau ARPA apr&egrave;s l'introduction de TCP/IP se firent d'apr&egrave;s un sch&eacute;ma unique standard.</p>

<p>Bien s&ucirc;r les &eacute;tudiants font aussi partie des installations scientifiques. Ils d&eacute;couvrirent le r&eacute;seau &agrave leur fa&ccedil;on. Une esp&egrave;ce de &quot;tableau noir&quot; &eacute;taient ce qu'ils d&eacute;siraient, une planche &agrave nouvelles comme elle est courante dans les universit&eacute;s pour les occasions de voyage en partageant les frais, les petits boulots, les possibilit&eacute;s de logement, les partenaires de voyage ou la possibilit&eacute tout simplement de discuter  ou de bavarder. Ce f&ucirc;t l'apparition du Usenet, l'art&egrave;re vitale du groupe de nouvelles actuel. Beaucoup d' &quot;Internautes&quot; inv&eacute;t&eacute;r&eacute;s tiennent le groupe de nouvelles aujourd'hui encore pour la partie la plus passionnante et la plus vivante d'Internet.</p>







<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="reseaureseau">Le r&eacute;seau des r&eacute;seaux</a></h2>

<p>Le branchement du monde universitaire sur le r&eacute;seau rendit n&eacute;cessaire la s&eacute;paration entre le domaine militaire et le domaine civil &eacute;tant donn&eacute que les militaires voulaient prot&eacute;ger leurs propres int&eacute;r&ecirc;ts. C'est pourquoi, d&eacute;but des ann&eacute;es 80 un nouveau r&eacute;seau de donn&eacute;es militaires, le Milnet &eacute;tait s&eacute;par&eacute du r&eacute;seau ARPA. Le r&eacute;seau ARPA proprement-dit &eacute;tait laiss&eacute au monde scientifique.</p>

<p>La partie civile du r&eacute;seau vit le nombre des ordinateurs branch&eacute;s monter en
fl&egrave;che dans le courant des ann&eacute;es 80. La <b>National Science Foundation (NSF)</b> am&eacute;ricaine y fut pour beaucoup. Cette organisation cr&eacute;a un syst&egrave;me de liaison qui reliait tous les centres scientifiques du pays les uns avec les autres. Des ordinateurs d'universit&eacute s&eacute;par&eacute;s ou des plus petits r&eacute;seaux d'ordinateurs pouvaient se brancher sur un centre d'ordinateurs et de cette fa&ccedil;on atterrir dans d'autres r&eacute;seaux. C'est ainsi qu'apparut litt&eacute;ralement un r&eacute;seau des r&eacute;seaux. Bient&ocirc;t s'imposa aussi alors le nom d' &quot;Internet&quot;. La d&eacute;nomination  &quot;r&eacute;seau ARPA&quot; disparut fin des ann&eacute;es 80. Le syst&egrave;me de liaison par lequel les petits r&eacute;seaux s&eacute;par&eacute;s devinrent un r&eacute;seau global re&ccedil;ut la d&eacute;signation appropri&eacute;e <b>Backbone</b> (&eacute;pine dorsale).</p>

<p>la m&ecirc;me &eacute;poque il y eut en Europe des d&eacute;veloppements semblables. Sur le vieux continent on misa cependant d'abord sur les <b>Normes ISO</b>. Du mod&egrave;le am&eacute;ricain TCP/IP qui n'&eacute;tait pas aux normes ISO on ne voulait rien savoir. 1986 vit la cr&eacute;ation de l'organisation <b>RARE (R&eacute;seaux Associ&eacute;s pour la Recherche Europ&eacute;enne)</b>. Cette organisation devait coordonner toutes les initiatives visant &agrave une mise en r&eacute;seaux d'ordinateurs qui prime sur les diff&eacute;rents syst&egrave;mes d'exploitation et ce pour l'ensemble de l'Europe. RARE lan&ccedil;a pour cela un projet du nom de <b>COSINE (Cooperation for an Open Systems Interconnection Networking in Europe)</b>.</p>

<p>Pourtant rien ne pouvait plus emp&ecirc;cher le protocole TCP/IP de gagner. Sous la pression du succ&egrave;s en Am&eacute;rique apparut finalement un r&eacute;seau de donn&eacute;es europ&eacute;en compatible avec plusieurs protocoles et qui admettait entre autres le TCP/IP. Ce r&eacute;seau fonctionna d'abord sous la d&eacute;signation d' <b>EuropaNET</b>. Diff&eacute;rents r&eacute;seaux scientifiques nationaux comme le r&eacute;seau allemand de la recherche: &quot;das Deutsche Forschungsnetz&quot; (DFN), y furent reli&eacute;s.</p>

<p>Entre-temps une conduite transatlantique assure le branchement de l'Europe au Backbone aux USA. La coordination du trafic Internet en Europe rel&egrave;ve de l'organisation <b>RIPE (R&eacute;seaux IP Europ&eacute;ens)</b>. En Europe aussi il y a depuis 1992 un syst&egrave;me de connexion: ce syst&egrave;me s'appelle <b>Ebone (Europ&auml;ischer Internet-Backbone)</b>. Sur d'autres continents il y avait et il y a des d&eacute;veloppements similaires.</p>

<p>Ce que nous entendons aujourd'hui par &quot;Internet&quot; ce n'est pas un seul r&eacute;seau homog&egrave;ne mais une liaison de beaucoup de petits r&eacute;seaux qu'ils soient limit&eacute;s &agrave un territoire ou &agrave une organisation. Ces r&eacute;seaux ont une liaison au Backbone et ainsi &agrave tout le r&eacute;seau. Les fournisseurs
d'acc&egrave;s Internet commerciaux sont reli&eacute;s aux r&eacute;seaux correspondants.</p>

<p>Quelques adresses sur le WWW qui traitent de ces th&egrave;mes:</p>

<p><img src="../../src/en.gif" width="16" height="10" border="0" alt="Page en langue anglaise">&nbsp;<a target="_top" href="http://www.nsf.gov/"><b>National Science Foundation (NSF)</b></a><br>
<img src="../../src/de.gif" width="16" height="10" border="0" alt="Page en langue allemande">&nbsp;<a target="_top" href="http://www.dfn.de/"><b>Deutsches Forschungsnetz (DFN)</b></a><br>
<img src="../../src/en.gif" width="16" height="10" border="0" alt="Page en langue anglaise">&nbsp;<a target="_top" href="http://www.ebone.com/"><b>Ebone-Net</b></a><br>
<img src="../../src/en.gif" width="16" height="10" border="0" alt="Page en langue anglaise">&nbsp;<a target="_top" href="http://www.ripe.net/"><b>R&eacute;seaux IP Europ&eacute;ens (RIPE)</b></a></p>








<table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr><td colspan="2" bgcolor="#EEEEEE" class="doc">
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a>
</td></tr>
<tr><td bgcolor="#EEEEEE" class="doc" align="right"><a href="standards.htm"><img src="../../src/suivant.gif" width="10" height="10" border="0" hspace="10" alt="page suivante"></a></td>
<td bgcolor="#FFFFFF"><img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information"> <a href="standards.htm"><b>Standards importants sur Internet</b></a>
</td></tr>
<tr>
<td bgcolor="#EEEEEE" class="doc" align="right"><a href="../../editorial/remerciements.htm"><img src="../../src/precedent.gif" width="10" height="10" border="0" hspace="10" alt="page pr&eacute;c&eacute;dente"></a></td>
<td bgcolor="#FFFFFF" width="100%"><img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information"> <a href="../../editorial/notetraducteur.htm"><b>Note du traducteur</b></a>
</td>
</tr>
<tr><td colspan="2" bgcolor="#EEEEEE" class="doc">&#160;</td></tr>
</table><table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr>
<td bgcolor="#FFEEDD" class="nav"><a class="an" name="bottom"><img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"></a> <a href="../../index.htm"><b>SELFHTML</b></a>/<a href="../../navigation/index.htm" target="_parent">Aides &agrave; la navigation</a> <img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="../index.htm"><b>Introduction</b></a> <img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="index.htm"><b>Internet et le WWW</b></a></td>
</tr>
</table>


<p>&copy; 2001 Stefan M&uuml;nz / &copy; 2003 Traduction <img src="../../src/courriel.gif" width="15" height="10" border="0" alt="Adresse &eacute;lectronique">&nbsp;<a href="mailto:13405@free.fr">Serge Fran&ccedil;ois, 13405@free.fr</a><br><img src="../../src/courriel.gif" width="15" height="10" border="0" alt="Adresse &eacute;lectronique">&nbsp;<a href="mailto:selfhtml@selfhtml.com.fr">selfhtml@selfhtml.com.fr</a></p>



</body>
</html>
