<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>SELFHTML: SELFHTML: Introduction / Internet et le WWW / Services sur Internet</title>
<link rel="stylesheet" type="text/css" href="../../src/selfhtml.css">
<meta name="description"    content="Quels sont les services sur Internet, par exemple courriel, WWW, nouvelles etc.">
<meta name="keywords"       content="SELFHTML, Internet, services sur Internet, courriel, E-Mail, WWW, Newsgroups, groupes de nouvelles, Gopher, FTP, WAIS, IRC, Telnet, SSH">
<meta name="author"         content="Stefan M&uuml;nz, selfhtml@teamone.de">
<meta http-equiv="content-type" content="text/html; charset=ISO-8859-1">
<meta name="DC.Publisher"   content="Serge Fran&ccedil;ois, selfhtml@selfhtml.com.fr">
<meta name="DC.Date"        content="2003-01-27T08:00+00:00">
<meta name="DC.Identifier"  content="http://selfhtml.selfhtml.com.fr/introduction/internet/services.htm">
<meta name="DC.Language"    content="fr">
<meta name="DC.Rights"      content="../../editorial/copyright.htm">
<meta name="DC.Date.Create" content="2003-01-27T08:00+00:00">
<meta name="SELF.Version"   content="1">
<meta name="SELF.Pagetype"  content="Information">
<meta name="SELF.Path"      content="SELFHTML == ../../index.htm // Introduction == ../index.htm // Internet et le WWW == index.htm">
<!-- Matomo -->
<script type="text/javascript">
  var _paq = window._paq = window._paq || [];
  /* tracker methods like "setCustomDimension" should be called before "trackPageView" */
  _paq.push(['trackPageView']);
  _paq.push(['enableLinkTracking']);
  (function() {
    var u="//matomo.boitasite.com/";
    _paq.push(['setTrackerUrl', u+'matomo.php']);
    _paq.push(['setSiteId', '1']);
    var d=document, g=d.createElement('script'), s=d.getElementsByTagName('script')[0];
    g.type='text/javascript'; g.async=true; g.src=u+'matomo.js'; s.parentNode.insertBefore(g,s);
  })();
</script>
<!-- End Matomo Code -->
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#AA5522" vlink="#772200" alink="#000000">

<table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr>
<td bgcolor="#FFEEDD" class="nav"><a class="an" name="top"><img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"></a> <a href="../../index.htm"><b>SELFHTML</b></a>/<a href="../../navigation/index.htm" target="_parent">Aides &agrave; la navigation</a> <img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="../index.htm"><b>Introduction</b></a> <img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="index.htm"><b>Internet et le WWW</b></a></td>
</tr>
</table><table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr>
<td bgcolor="#EEEEEE" class="doc" width="110"><img src="../../src/logo.gif" width="106" height="109" border="0" alt="SELFHTML"></td>
<td bgcolor="#EEEEEE" class="doc" valign="bottom" width="100%"><h2>Services sur Internet</h2>
<tr>
<td bgcolor="#EEEEEE" class="doc" valign="top" align="center">
<img src="../../src/docx.gif" width="30" height="20" vspace="6" border="0" alt="Page d'information: vue d'ensemble">
</td>
<td bgcolor="#FFFFFF" valign="top" nowrap>
<p>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#courriel"><b>courriel (E-Mail)</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#telnet_ssh"><b>Telnet und SSH</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#ftp"><b>File Transfer (FTP)</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#gopher"><b>Gopher</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#irc"><b>Clavardage (Chat) (IRC)</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#news"><b>Groupes de nouvelles (News)</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#www"><b>World Wide Web (WWW)</b></a><br>
</p>
</td>
</tr><tr><td colspan="2" bgcolor="#EEEEEE" class="doc">&#160;<a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;</td></tr>
</table>



<h2 class="Sh2"><a class="an" name="courriel">Courriel (E-Mail)</a></h2>

<p>Le courrier &eacute;lectronique (E-Mail) est bien le service Internet le plus utilis&eacute. E-Mail permet la transmission personnelle de messages et de fichiers d'un exp&eacute;diteur &agrave un destinataire. Celui qui veut profiter de ce service a besoin d'une adresse E-Mail propre. De telles adresses sont reconnaissables au c&eacute;l&egrave;bre <code>@</code> (signifie: en anglais &quot;at&quot;, donc &quot;chez&quot;) dans leur milieu. Les fournisseurs d'acc&egrave;s qui h&eacute;bergent votre offre Web vous installent en principe, sur simple demande, une adresse &eacute;lectronique.</p>

<p>Avant tout dans le domaine des affaires le courrier &eacute;lectronique remplace peu &agrave peu le courrier habituel (d&eacute;sign&eacute aimablement ou avec m&eacute;pris par les tenants du courriel comme &quot;courrier escargot&quot; ou &quot;snail mail&quot;).
M&ecirc;me le fax est une esp&egrave;ce menac&eacute;e par le courrier &eacute;lectronique. Les avantages sont clairs:</p>

<ul>
<li>Les courriels n'ont besoin le plus souvent que de quelques minutes de l'exp&eacute;diteur au destinataire, qu'ils soient s&eacute;par&eacute;s par quelques kilom&egrave;tres ou plusieurs milliers.</li>
<li>Les courriels sont &eacute;conomiques. Compar&eacute;s aux lettres il ne co&ucirc;tent que quelques centimes.</li>
<li>Comparativement au t&eacute;l&eacute;phone, ils pr&eacute;sentent l'avantage de laisser une trace &eacute;crite d'accords ou autres documents similaires.</li>
<li>Des programmes de courriel modernes modernes peuvent sauvegarder les courriels dans une base de donn&eacute;es de telle fa&ccedil;on que des Mails envoy&eacute;s ou re&ccedil;us
depuis plus longtemps se retrouvent facilement.</li>
<li>Le standard <img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="../../divers/typesmime.htm"><b>Mime</b></a> qui s'impose peu &agrave peu pour les courriels permet de joindre facilement des fichiers informatiques &agrave un courriel &agrave un tel point que les courriels gagnent toujours plus d'importance pour l'&eacute;change de fichiers individuels.</li>
<li>Le courriel ne contraint pas l'exp&eacute;diteur et le destinataire &agrave &ecirc;tre en ligne en m&ecirc;me temps. Ils vont chercher leurs courriels quand ils ont le temps.</li>
<li>&Agrave c&ocirc;t&eacute de la possibilit&eacute d'&eacute;changer des nouvelles et des donn&eacute;es avec certains autres participants d'Internet vous pouvez aussi prendre part &agrave des <b>listes de publipostage</b> qui vous int&eacute;ressent.</li>
</ul>

<p>Le syst&egrave;me courriel actuel doit aussi lutter encore avec quelques probl&egrave;mes.
Un courriel normal est aussi secret sur le chemin de l'exp&eacute;diteur au destinataire qu'une carte postale. Pour des informations confidentielles ou pour des donn&eacute;es sensibles le courriel n'est pas appropri&eacute. Entre temps, il y a des proc&eacute;d&eacute;s de codage comme <b>PGP (Pretty Good Privacy)</b>, qui permettent le
codage et le d&eacute;codage de courriels et des fichiers joints. La condition en est cependant qu'aussi bien l'exp&eacute;diteur que le destinataire disposent d'un logiciel compl&eacute;mentaire ad&eacute;quat et aient auparavant &eacute;chang&eacute la cl&eacute de leur code.</p>

<p>Un autre inconv&eacute;nient des courriels est &eacute;galement qu'ils ne soient pas consid&eacute;r&eacute;s comme &quot;authentiques&quot;. Il est vrai que leur validit&eacute; juridique a tendance &egrave; s'accro&icirc;tre, pourtant des documents exigeant une signature, ne peuvent pas jusqu'ici &ecirc;tre remplac&eacute;s par un courriel. C'est pourquoi il reste encore impossible jusqu'ici d'effectuer certaines d&eacute;marches administratives &quot;simplement&quot; par courriel.</p>



<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="telnet_ssh">Telnet et SSH</a></h2>

<p>Telnet est con&ccedil;u pour se servir d'un ordinateur &eacute;loign&eacute sur Internet comme si on &eacute;tait assis devant. Telnet est ainsi une solution simple pour ceux
qui travaillent &agrave domicile (t&eacute;l&eacute;travail). Cette solution est d'ailleurs
beaucoup plus ancienne que le concept de &quot;t&eacute;l&eacute;travail&quot;.</p>

<p>Telnet est con&ccedil;u avant tout pour les syst&egrave;mes d'exploitation Unix. Il
permet l'ouverture d'une session de travail du syst&egrave;me d'exploitation <b>login</b>
(s'annoncer) d'un utilisateur &agrave un ordinateur h&ocirc;te branch&eacute sur Internet sous
forme d'un <b>rlogin</b>  (remote login). L'ouverture n'est possible que
si vous connaissez le num&eacute;ro d'identification de l'utilisateur et le mot de
passe, c'est &agrave dire si vous &ecirc;tes enregistr&eacute sur l'ordinateur h&ocirc;te choisi
comme utilisateur. Apr&egrave;s vous &ecirc;tre connect&eacute vous recevez l'&eacute;cran Unix avec
l'invite et pouvez entrer des commandes du syst&egrave;me d'exploitation, d&eacute;marrer
des programmes etc... sur l'ordinateur &eacute;loign&eacute;.</p>

<p>Les utilisateurs de PC qui n'ont pas &agrave travailler directement avec
l'administration d'ordinateurs serveurs sur Internet auront peu &agrave faire
avec Telnet. Cependant, il existe aussi des <b>Telnet-Clients</b> pour des utilisateurs de PC avec syst&egrave;me d'exploitation comme MS-Windows ou Macintosh. Ces programmes permettent de travailler de son propre ordinateur sur un ordinateur h&ocirc;te &eacute;loign&eacute. Sans connaissance des commandes du syst&egrave;me d'exploitation de l'ordinateur h&ocirc;te, un tel programme est toutefois inutile.</p>

<p><b>SSH (Secure Shell)</b> est une variante de Telnet - La meilleure variante, comme on commence &agrave; le reconna&icirc;tre. La diff&eacute;rence avec Telnet est que avec SSH les donn&eacute;s sont transmises cod&eacute;es pendant le travail. Ce qui est essentiel &eacute;tant donn&eacute; que c'est pr&eacute;cis&eacute;ment lors du travail sur un ordinateur &eacute;loign&eacute; que des donn&eacute;es sensibles sont &eacute;dit&eacute;es telles des fichiers de configuration ou des mots de passe. Toutes ces donn&eacute;es sont, m&ecirc;me si c'est imperceptible pendant le travail, transmises par le biais de nombreux ordinateurs sur Internet, &agrave; l'ordinateur cible et peuvent &ecirc;tre d&eacute;tourn&eacute;es lors de ces diff&eacute;rentes &eacute;tapes par un malfaisant quelconque. Certains clients Telnet r&eacute;cents proposent entre-temps &eacute;galement le protocole SSH.</p>




<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="ftp">File Transfer (FTP)</a></h2>

<p>FTP est un service Internet sp&eacute;cialement pr&eacute;vu pour se connecter sur un
ordinateur serveur d&eacute;termin&eacute sur Internet et de l&agrave passer des fichiers
(t&eacute;l&eacute;charger) sur son propre ordinateur (<b>Download</b>) ou de transmettre ses propres fichiers &agrave l'ordinateur serveur (<b>Upload</b>). De plus le FTP propose des commandes pour ex&eacute;cuter des op&eacute;rations sur l'ordinateur &eacute;loign&eacute comme afficher le contenu de r&eacute;pertoires, changer de r&eacute;pertoire, cr&eacute;er des r&eacute;pertoires ou effacer des fichiers.</p>

<p>Lors de la connexion avec un serveur FTP, il faut distinguer deux formes de
connexion: il y a le FTP &quot;normal&quot; et le <b>FTP anonyme</b>. </p>

<p>Lors d'une connexion FTP normale vous n'avez acc&egrave;s au serveur qu'en donnant
un num&eacute;ro d'identification d'utilisateur et un mot de passe. Il faut que
l'administrateur du serveur FTP vous ait enregistr&eacute avec ces donn&eacute;es d'acc&egrave;s comme utilisateur autoris&eacute sur le serveur.</p>

<p>Pour le FTP anonyme il s'agit de domaines ouverts au publics sur des ordinateurs serveurs. L&agrave vous n'avez pas besoin de licence d'acc&egrave;s. Vous vous connectez simplement avec comme num&eacute;ro d'identification de l'utilisateur <var>anonymous</var> , et en donnant comme mot de passe votre adresse E-Mail. Il y a quantit&eacute de serveur publics FTP sur Internet qui proposent un large choix de fichiers &agrave t&eacute;l&eacute;charger. L&agrave vous pouvez recevoir des logiciels, des textes
d'aide, des collections de graphiques etc....</p>

<p>Pour des serveurs FTP publics anonymes il y a des r&egrave;gles &agrave observer.
&Eacute;tant donn&eacute que lors d'une visite sur de tels serveurs vous n'&ecirc;tes qu'invit&eacute, vous devez vous comporter aussi en cons&eacute;quence. Ne restez pas plus longtemps que n&eacute;cessaire. Ne chargez pas inutilement trop de fichiers. Lisez d'abord les fichiers Lisezmoi (fichiers Readme), qu'il y a dans presque tous les r&eacute;pertoires et qui expliquent le contenu du r&eacute;pertoire.</p>

<p>Si en fin de compte vous visitez encore et toujours des serveurs FTP ouverts au public pour en t&eacute;l&eacute;charger des fichiers, vous pouvez aussi le faire avec des navigateurs WWW modernes comme Netscape ou l' Explorer Internet Microsoft.  De tels navigateurs affichent la liste des fichiers des serveurs FTP comme des liens pouvant &ecirc;tre cliqu&eacute;s. Selon le type de fichier vous pouvez alors le t&eacute;l&eacute;charger ou l'afficher directement dans la fen&ecirc;tre du navigateur.</p>

<p>Pour des travaux plus ambitieux, avant tout si vous voulez g&eacute;rer les fichiers de votre propre projet WWW il vous faut un programme FTP. Il y a de tels programmes pour tous les syst&egrave;mes d'exploitation et quelques syst&egrave;mes d'exploitation comme tous les d&eacute;riv&eacute;s Unix ou OS/2 ont d&eacute;j&agrave un programme FTP int&eacute;gr&eacute.</p>







<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="gopher">Gopher</a></h2>

<p>Gopher passe aujourd'hui pour le pr&eacute;d&eacute;cesseur du World Wide Web. Le
nom vient de &quot;go for&quot; et exprime ce qu'est le but le plus important de ce service: rendre plus facile l'investigation dans des grandes quantit&eacute;s d'information.</p>

<p>Gopher une interface utilisateur bas&eacute;e sur des menus pour trouver des informations mais aussi pour se servir d'autres services Internet comme FTP ou Telnet. On ne peut pas voir suite &agrave une entr&eacute;e dans un menu Gopher o&ugrave se trouvent les fichiers ou les programmes qui y sont li&eacute;s. Des utilisateurs avec des ordinateurs orient&eacute;s texte et clavier peuvent choisir avec des touches de lettres ou de chiffres, des &eacute;l&eacute;ments de menus affich&eacute;s &agrave l'&eacute;cran par le
Gopher. Pour des interfaces utilisateur graphiques les menus peuvent &ecirc;tre
cliqu&eacute;s avec la souris. &Agrave ce point de vue Gopher est analogue au World Wide
Web car avec ce service non plus vous n'avez pas besoin de conna&icirc;tre des commandes internes pour naviguer dans la somme des informations.</p>

<p>L'inconv&eacute;nient de Gopher par rapport au WWW est qu'il n'existe pas de standard comme HTML. Il y a les menus du Gopher et les appels de fichiers qui y sont li&eacute;s. Certes, un bon programme Gopher peut afficher diff&eacute;rents formats de fichiers, cependant il n'y a aucun moyen de former des pages &agrave l'&eacute;cran et de cr&eacute;er ainsi des pr&eacute;sentations personnelles d'informations.</p>

<p>Des navigateurs WWW modernes comme Netscape supportent aussi Gopher. Ce qui signifie qu'avec un tel navigateur vous pouvez aussi appeler des adresses Gopher. Les menus Gopher apparaissent dans le navigateur comme des listes avec des liens en HTML.</p>




<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="irc">Clavardage (Chat) (IRC)</a></h2>

<p>Celui qui se sent seul ou qui veut simplement &ecirc;tre &agrave la mode va <b>clavarder</b> (chatter)sur Internet (discuter, bavarder). &Agrave l'&eacute;cran appara&icirc;t une fen&ecirc;tre coup&eacute;e en deux. Dans une partie sont &eacute;crites comme par magie toutes sortes de phrases partielles ou compl&egrave;tes, de commentaires et d'autres choses encore. Ce sont des apports de participants qui sont au m&ecirc;me moment connect&eacute;s au m&ecirc;me endroit. Dans l'autre fen&ecirc;tre vous pouvez entrer vous m&ecirc;me quelque chose. De cette fa&ccedil;on vous pouvez prendre part &agrave la discussion. Entre temps il y a aussi des interfaces graphiques dans lesquels chaque participant peut se choisir une figure qui appara&icirc;tra ensuite comme participant dans une sc&egrave;ne.</p>

<p>Ils sont rares ceux qui y figurent sous leur vrai nom mais pas ceux qui pr&eacute;tendent &ecirc;tre quelque chose de tout &agrave fait diff&eacute;rent que ce qu'il sont vraiment. Des hommes se font passer pour des femmes pour voir l'effet que &ccedil;a fait de se faire draguer. Des adultes jouent aux ados pour pouvoir &agrave; nouveau se comporter comme s'ils avaient leur crise de pubert&eacute. &Ccedil;a et l&agrave se b&acirc;tissent des discussions int&eacute;ressantes mais souvent les prestations du Chat ont le niveau du jardin d'enfants. Par le clavardage se cr&eacute;ent pourtant aussi des contacts &agrave; prendre au s&eacute;rieux, des amiti&eacute;s et des relations.</p>

<p>IRC est un des services Internet qui pourraient revenir cher. Car il faut
rester connect&eacute pendant toute la dur&eacute;e de la participation et certains ne
remarquent pas comme le temps passe en bavardant (&ccedil;a n'est pas diff&eacute;rent de la
vie r&eacute;elle). Il y en a peu qui surfent toute une nuit sur le WWW, nombreux par
contre ceux qui bavardent toute une nuit. Beaucoup de drogu&eacute;s &agrave un degr&eacute
&eacute;lev&eacute d'Internet se trouvent avant tout dans les domaines du clavardage.</p>






<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="news">Groupes de nouvelles (News)</a></h2>

<p>Un groupe de nouvelles est comparable &agrave un tableau noir auquel vous pouvez poster des nouvelles que tous les visiteurs peuvent lire. Chaque groupe de nouvelles traite un th&egrave;me. Entre temps il y a plus de 20000 groupes de nouvelles sur Internet. Il n'y a pratiquement rien pour quoi il n'y aurait pas de groupe de nouvelles. Peu importe que vous vous int&eacute;ressiez &agrave la configuration de votre ordinateur &agrave l'origami ou aux enfants disparus - il existe pour tout un ou plusieurs groupes de nouvelles. Il y a chaque jour des dizaines de milliers de nouvelles post&eacute;s &agrave des groupes de nouvelles. Des questions sont pos&eacute;es et des r&eacute;ponses sont donn&eacute;es il y est d&eacute;battu et plaisant&eacute. Les groupes de nouvelles (Newsgroups) passent en g&eacute;n&eacute;ral pour la partie la plus folle d'Internet. Ils sont aussi la b&ecirc;te noire pour certains car il y a aussi de nombreux groupes de nouvelles au contenu pornographique ou extr&eacute;miste.</p>

<p>le syst&egrave;me des groupes de nouvelles est r&eacute;parti sur diff&eacute;rents r&eacute;seaux. Le plus grand et le plus connu est <b>Usenet</b>. Vous y trouvez un groupe
de nouvelles avec des adresses telles que <var>alt.music.pinkfloyd</var> ou <var>de.soc.weltanschauung</var>. Les abr&eacute;viations les plus importantes dans de telles adresses sont:</p>

<ul>
<li><var>alt</var> = alternatif, colori&eacute, fou, us&eacute</li>
<li><var>biz</var> = commercial sans &ecirc;tre de la publicit&eacute</li>
<li><var>comp</var> = ordinateur</li>
<li><var>de</var> =  en allemand</li>
<li><var>misc</var> = divers</li>
<li><var>news</var> = groupe de nouvelles sur le th&egrave;me groupe de nouvelles</li>
<li><var>rec</var> = loisirs, violon d'Ingres et art</li>
<li><var>sci</var> = sciences</li>
<li><var>soc</var> = social, culturel, politique</li>
<li><var>talk</var> = bavardage et discussion</li>
</ul>

<p>Pour lire les groupes de nouvelles et pouvoir y prendre part vous avez besoin d'un programme <b>lecteur de nouvelles</b>(Newsreader). Les navigateurs modernes comme Netscape (&agrave partir de V3.0) ou l' der Explorer Internet MS (&agrave partir de V4.0) ont un programme de nouvelles int&eacute;gr&eacute de telle sorte qu vous n'avez plus besoin d'un programme s&eacute;par&eacute. Pour pouvoir recevoir des groupes de nouvelles, il vous faut mentionner un <b>serveur de nouvelles</b> (News-Server) dans les r&eacute;glages du programme utilis&eacute. Demandez &agrave; votre fournisseur d'acc&egrave;s qui vous permet d'acc&eacute;der &agrave; Internet s'il propose &eacute;galement un serveur de groupes de nouvelles, et avec quelles donn&eacute;es vous pouvez y prendre part!</p>

<p>Il est conseill&eacute d'abord de lire tous les groupes de nouvelles disponibles Cela peut durer un moment mais vous avez ensuite une liste tri&eacute;e de tous les groupes et vous en obtenez une vue d'ensemble. Vous pouvez <b>vous abonner</b> aux groupes de nouvelles qui vous int&eacute;ressent.</p>

<p>Les nouvelles dans les groupes de nouvelles sont organis&eacute;es hi&eacute;rarchiquement. Quelqu'un poste une nouvelle avec un nouveau <b>sujet</b> (ou th&egrave;me). Un autre r&eacute;pond en se r&eacute;f&eacute;rant au m&ecirc;me th&egrave;me. Un troisi&egrave;me r&eacute;pond de la m&ecirc;me fa&ccedil;on et un quatri&egrave;me r&eacute;pond au troisi&egrave;me. De cette fa&ccedil;on se cr&eacute;e une arborescence de nouvelles sur un th&egrave;me commenc&eacute une fois. Cette arborescence est aussi appel&eacute;e <b>discussion</b> (thread). Vous pouvez vous m&ecirc;me commencer une nouvelle discussion ou bien r&eacute;pondre &agrave une nouvelle et intervenir ainsi sur la discussion concern&eacute;e.</p>






<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="www">World Wide Web (WWW)</a></h2>

<p>Le World Wide Web (WWW) est le service le plus r&eacute;cent d'Internet. Le Web se particularise par le fait qu'il permet aussi &agrave des utilisateurs inexp&eacute;riment&eacute;s de se mouvoir dans les offres d'informations. Celui qui appelle
un serveur FTP avec un programme FTP doit s'y retrouver dans des structures de r&eacute;pertoires compliqu&eacute;es et inconnues et s'orienter gr&acirc;ce aux noms de fichiers. il peut t&eacute;l&eacute;charger des fichiers int&eacute;ressants sur son ordinateur pour les ouvrir plus tard. Sur le WWW par contre les informations apparaissent &agrave l'&eacute;cran tout de suite apr&egrave;s leur appel. Si vous &ecirc;tes en route sur le Web avec un navigateur WWW, vous n'avez pas besoin de vous soucier des noms de fichiers ou de commandes difficiles &agrave entrer. La navigation confortable &agrave l'aide de cliquements de souris peut provoquer un sentiment de contentement qui justifie aussi pourquoi l'expression &quot;surfer&quot; sur le r&eacute;seau s'est impos&eacute;e.</p>







<table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr><td colspan="2" bgcolor="#EEEEEE" class="doc">
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a>
</td></tr>
<tr><td bgcolor="#EEEEEE" class="doc" align="right"><a href="www.htm"><img src="../../src/suivant.gif" width="10" height="10" border="0" hspace="10" alt="page suivante"></a></td>
<td bgcolor="#FFFFFF"><img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information"> <a href="www.htm"><b>Apparition du World Wide Web</b></a>
</td></tr>
<tr>
<td bgcolor="#EEEEEE" class="doc" align="right"><a href="standards.htm"><img src="../../src/precedent.gif" width="10" height="10" border="0" hspace="10" alt="page pr&eacute;c&eacute;dente"></a></td>
<td bgcolor="#FFFFFF" width="100%"><img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information"> <a href="standards.htm"><b>Standards importants sur Internet</b></a>
</td>
</tr>
<tr><td colspan="2" bgcolor="#EEEEEE" class="doc">&#160;</td></tr>
</table><table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr>
<td bgcolor="#FFEEDD" class="nav"><a class="an" name="bottom"><img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"></a> <a href="../../index.htm"><b>SELFHTML</b></a>/<a href="../../navigation/index.htm" target="_parent">Aides &agrave; la navigation</a> <img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="../index.htm"><b>Introduction</b></a> <img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="index.htm"><b>Internet et le WWW</b></a></td>
</tr>
</table>

<p>&copy; 2001 Stefan M&uuml;nz / &copy; 2003 Traduction <img src="../../src/courriel.gif" width="15" height="10" border="0" alt="Adresse &eacute;lectronique">&nbsp;<a href="mailto:13405@free.fr">Serge Fran&ccedil;ois, 13405@free.fr</a><br><img src="../../src/courriel.gif" width="15" height="10" border="0" alt="Adresse &eacute;lectronique">&nbsp;<a href="mailto:selfhtml@selfhtml.com.fr">selfhtml@selfhtml.com.fr</a></p>



</body>
</html>
