<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>SELFHTML: Introduction / Internet et le WWW / Standards importants sur Internet</title>
<link rel="stylesheet" type="text/css" href="../../src/selfhtml.css">
<meta name="description"    content="Comment Internet est apparu et s'est d&eacute;velopp&eacute;.">
<meta name="keywords"       content="SELFHTML, Internet, Standards, TCP/IP, adressage IP, ordinateur h&ocirc;te, transmission par paquets, r&eacute;seaux de la classe A, r&eacute;seaux de la classe B, r&eacute;seaux de la classe A, num&eacute;ros de r&eacute;seaux, DNS, Domain Name Service, Toplevel-Domain, ICANN, IETF, IANA, W3C">
<meta name="author"         content="Stefan M&uuml;nz, selfhtml@teamone.de">
<meta http-equiv="content-type" content="text/html; charset=ISO-8859-1">
<meta name="DC.Publisher"   content="Serge Fran&ccedil;ois, selfhtml@selfhtml.com.fr">
<meta name="DC.Date"        content="2003-01-27T08:00+00:00">
<meta name="DC.Identifier"  content="http://selfhtml.selfhtml.com.fr/introduction/internet/apparition.htm">
<meta name="DC.Language"    content="fr">
<meta name="DC.Rights"      content="../../editorial/copyright.htm">
<meta name="DC.Date.Create" content="2003-01-27T08:00+00:00">
<meta name="SELF.Version"   content="1">
<meta name="SELF.Pagetype"  content="Information">
<meta name="SELF.Path"      content="SELFHTML == ../../index.htm // introduction == ../index.htm // Internet et le WWW == index.htm">
<!-- Matomo -->
<script type="text/javascript">
  var _paq = window._paq = window._paq || [];
  /* tracker methods like "setCustomDimension" should be called before "trackPageView" */
  _paq.push(['trackPageView']);
  _paq.push(['enableLinkTracking']);
  (function() {
    var u="//matomo.boitasite.com/";
    _paq.push(['setTrackerUrl', u+'matomo.php']);
    _paq.push(['setSiteId', '1']);
    var d=document, g=d.createElement('script'), s=d.getElementsByTagName('script')[0];
    g.type='text/javascript'; g.async=true; g.src=u+'matomo.js'; s.parentNode.insertBefore(g,s);
  })();
</script>
<!-- End Matomo Code -->
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#AA5522" vlink="#772200" alink="#000000">

<table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr>
<td bgcolor="#FFEEDD" class="nav"><a class="an" name="top"><img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"></a> <a href="../../index.htm"><b>SELFHTML</b></a>/<a href="../../navigation/index.htm" target="_parent">Aides &agrave; la navigation</a> <img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="../index.htm"><b>Introduction</b></a> <img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="index.htm"><b>Internet et le WWW</b></a></td>
</tr>
</table><table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr>
<td bgcolor="#EEEEEE" class="doc" width="110"><img src="../../src/logo.gif" width="106" height="109" border="0" alt="SELFHTML"></td>
<td bgcolor="#EEEEEE" class="doc" valign="bottom" width="100%"><h2>Standards importants sur Internet</h2>
<tr>
<td bgcolor="#EEEEEE" class="doc" valign="top" align="center">
<img src="../../src/docx.gif" width="30" height="20" vspace="6" border="0" alt="Page d'information: vue d'ensemble">
</td>
<td bgcolor="#FFFFFF" valign="top" nowrap>
<p>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#tcpip"><b>Le protocole TCP/IP</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#adressage_ip"><b>Adressage IP</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#client_server"><b>Technologie Client- Serveur</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#dns"><b>DNS - Domain Name Service</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#routing"><b>Routing et Gateways</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#autoorganisation"><b>Auto-organisation sur Internet</b></a><br>
</p>
</td>
</tr><tr><td colspan="2" bgcolor="#EEEEEE" class="doc">&#160;<a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;</td></tr>
</table>



<h2 class="Sh2"><a class="an" name="tcpip">Le protocole TCP/IP</a></h2>

<p>TCP/IP est le plus petit des termes d&eacute;signant la totalit&eacute; du trafic
sur Internet. Ce n'est qu'avec ce protocole qu'historiquement parlant un r&eacute;seau
limit&eacute; devint le r&eacute;seau des r&eacute;seaux. Peu importe si vous appelez des pages WWW, si vous envoyez du courrier &eacute;lectronique, t&eacute;l&eacute;chargez des fichiers avec FTP ou travaillez gr&acirc;ce &agrave; Telnet sur un ordinateur &eacute;loign&eacute;: les donn&eacute;es sont toujours adress&eacute;es et transmises de la m&ecirc;me fa&ccedil;on. TCP signifie <b>Transmission Control Protocol</b> (Protocole
pour le contr&ocirc;le de la transmission), IP signifie <b>Internet Protocol</b>.</p>

<p>Que vous envoyiez du courrier &eacute;lectronique ou que vous appeliez un fichier
HTML sur le WWW, Les donn&eacute;es sont mises en petits paquets pour la transmission
sur le r&eacute;seau. Chaque paquet contient la mention de l'adresse &agrave; laquelle il
doit &ecirc;tre envoy&eacute; et de son num&eacute;ro dans l'envoi.</p>

<p>L'adressage est assur&eacute; par le IP. Pour ce faire il y a un sch&eacute;ma
d'adressage qu'on appelle l' <img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#adressage_ip"><b>adressage IP</b></a>.</p>

<p>le TCP s'assure que les paquets de donn&eacute;es arrivent vraiment chez le
destinataire et dans le bon ordre. Le TCP utilise des num&eacute;ros de s&eacute;quence pour
les diff&eacute;rents paquets d'un envoi. Ce n'est que lorsque tous les paquets d'un
envoi sont arriv&eacute;s complets chez leur destinataire que la transmission est
consid&eacute;r&eacute;e comme &eacute;tant termin&eacute;e.</p>

<p>Chaque ordinateur participant &agrave; Internet est d&eacute;clar&eacute; sur le r&eacute;seau avec une adresse IP. Des ordinateurs branch&eacute;s &agrave; Internet sont d&eacute;sign&eacute;s comme <b>Hosts</b> ou <b>ordinateur h&ocirc;te</b>. Quand vous surfez sur le WWW avec votre ordinateur, ou allez chercher votre courrier &eacute;lectronique, vous &ecirc;tes d&eacute;clar&eacute;s sur Internet avec une adresse IP. Votre fournisseur d'acc&egrave;s par l'ordinateur duquel vous acc&eacute;dez, peut installer pour vous des adresses IP invariables. Des grands fournisseurs d'acc&egrave;s par exemple les services en ligne comme CompuServe ou AOL, attribuent aussi, ind&eacute;pendamment de l'identit&eacute;, des adresses IP dynamiques &agrave; chaque acc&egrave;s &agrave; Internet. Pour qu'un ordinateur puisse prendre part &agrave; Internet il doit &ecirc;tre muni d'un logiciel qui reconna&icirc;t le protocole TCP/IP. Sous Windows MS c'est par exemple le fichier <b>winsock.dll</b> dans le r&eacute;pertoire Windows.</p>







<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="adressage_ip">Adressage IP</a></h2>

<p>Une adresse IP typique serait par exemple sous sa forme d&eacute;cimale: <var>149.174.211.5</var> - quatre nombres donc s&eacute;par&eacute;s par des points. Les points ont pour fonction de s'adresser &agrave; des r&eacute;seaux hi&eacute;rarchiquement sup&eacute;rieurs ou inf&eacute;rieurs. Comme dans un num&eacute;ro de t&eacute;l&eacute;phone du r&eacute;seau t&eacute;l&eacute;phonique mondial, on distingue
l'indicatif de pays, l'indicatif de r&eacute;gion et le num&eacute;ro d'abonn&eacute; et
quelquefois aussi le num&eacute;ro de poste, il y a aussi sur Internet un indicatif - le <b>num&eacute;ro de r&eacute;seau</b>, et un num&eacute;ro de poste - le <b>num&eacute;ro
d'h&ocirc;te</b>.</p>

<p>La premi&egrave;re partie d'une adresse IP est le num&eacute;ro de r&eacute;seau, et la
deuxi&egrave;me est le num&eacute;ro d'h&ocirc;te. L&agrave; o&ugrave; est la limite entre le num&eacute;ro de r&eacute;seau et le num&eacute;ro d'h&ocirc;te est stipul&eacute; par un sch&eacute;ma de classification pour types de r&eacute;seau. Le tableau suivant explicite ce sch&eacute;ma. Dans les colonnes pour l'adressage IP et dans l'exemple typique, le num&eacute;ro de r&eacute;seau (l'indicatif) est repr&eacute;sent&eacute; en caract&egrave;res gras. Le reste de l'adresse IP est le num&eacute;ro d'h&ocirc;te d'un ordinateur &agrave; l'int&eacute;rieur de ce r&eacute;seau.</p>

<table cellpadding="0" cellspacing="0" border="0"
bgcolor="#C0C0C0"><tr><td>
<table cellpadding="3" cellspacing="1" border="0"
>
<tr>
<th bgcolor="#EEEEEE" class="doc" align="left">type de r&eacute;seau</th>
<th bgcolor="#EEEEEE" class="doc" align="left">sch&eacute;ma</th>
<th bgcolor="#EEEEEE" class="doc" align="left">adresse IP typique</th>
</tr>
<tr>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">r&eacute;seau de classe A</td>
<td class="code" bgcolor="#FFFFE0"><code><b>xxx</b>.xxx.xxx.xxx</code></td>
<td class="code" bgcolor="#FFFFE0"><code><b>103</b>.234.123.87</code></td>
</tr>
<tr>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">r&eacute;seau de classe B</td>
<td class="code" bgcolor="#FFFFE0"><code><b>xxx.xxx</b>.xxx.xxx</code></td>
<td class="code" bgcolor="#FFFFE0"><code><b>151.170</b>.102.15</code></td>
</tr>
<tr>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">r&eacute;seau de classe C</td>
<td class="code" bgcolor="#FFFFE0"><code><b>xxx.xxx.xxx</b>.xxx</code></td>
<td class="code" bgcolor="#FFFFE0"><code><b>196.23.155</b>.113</code></td>
</tr>
</table>
</td></tr></table>

<p>L'&eacute;chelon hi&eacute;rarchique le plus &eacute;lev&eacute; est form&eacute; par les <b>r&eacute;seaux de classe A</b>. Pour cette classe seul le premier chiffre de l'adresse IP y repr&eacute;sente le num&eacute;ro du r&eacute;seau, tous les autres chiffres &eacute;tant des num&eacute;ros d'h&ocirc;tes dans le r&eacute;seau. Pour les num&eacute;ros de r&eacute;seaux de tels r&eacute;seaux, les chiffres peuvent &ecirc;tre compris entre 1 et 126, ce qui veut dire que dans le monde entier il ne peut y avoir que 126 r&eacute;seaux de la classe A. Une adresse IP d'un r&eacute;seau de la classe A peut donc &ecirc;tre reconnue par le fait que le premier chiffre est compris entre 1 et 126. Le r&eacute;seau militaire am&eacute;ricain est par exemple un tel r&eacute;seau de la classe A. &Agrave; l'int&eacute;rieur d'un r&eacute;seau de la classe A, les fournisseurs d'acc&egrave;s correspondants peuvent attribuer librement &agrave; leurs abonn&eacute;s les deuxi&egrave;me, troisi&egrave;me et quatri&egrave;me chiffres des diff&eacute;rentes
adresse IP. Comme ces trois chiffres peuvent &ecirc;tre compris entre 0 et 255, un
fournisseur d'acc&egrave;s de la classe A peut donc attribuer jusqu'&agrave; 16,7 millions
d'adresses IP &agrave; des ordinateurs h&ocirc;tes &agrave; l'int&eacute;rieur de son r&eacute;seau.</p>

<p>L'&eacute;chelon hi&eacute;rarchique suivant est form&eacute; par les <b>r&eacute;seaux de classe B</b>. Le num&eacute;ro de ces r&eacute;seaux est form&eacute; par les deux premiers chiffres de l'adresse IP. Pour le premier chiffre les r&eacute;seaux de la classe B peuvent avoir une valeur comprise entre 128 et 192. Une adresse IP appartenant &agrave; un r&eacute;seau de la classe B peut donc &ecirc;tre reconnue par le fait que le premier chiffre est compris entre 128 et 192. Pour le deuxi&egrave;me chiffre, la valeur peut &ecirc;tre comprise entre 0 et 255. C'est donc environ 16000 r&eacute;seaux de cette classe qui sont possibles. &eacute;tant donn&eacute; que les deuxi&egrave;me et troisi&egrave;me chiffres dans de tels r&eacute;seaux ont une valeur comprise entre 0 et 255. Il peut y avoir dans chaque r&eacute;seau de la classe B jusqu'&agrave; environ 65.000 ordinateurs h&ocirc;tes. Les r&eacute;seaux de la classe B sont attribu&eacute;s avant tout &agrave; des grandes firmes, des universit&eacute;s et des services en ligne.</p>

<p>L'&eacute;chelon hi&eacute;rarchique le plus bas est repr&eacute;sent&eacute; par les <b>r&eacute;seaux de classe C</b>. Le premier chiffre d'une adresse IP d'un tel r&eacute;seau est compris entre 192 et 223. Les deuxi&egrave;me et troisi&egrave;me chiffres font partie &eacute;galement du num&eacute;ro du r&eacute;seau. Plus de deux millions de tels r&eacute;seaux peuvent ainsi &ecirc;tre adress&eacute;s. Avant tout de petites et de moyennes entreprises avec liaison Internet directe ainsi que des fournisseurs d'acc&egrave;s plus modestes disposent d'une telle adresse. &Eacute;tant donn&eacute; qu'il ne reste qu'un chiffre dont la valeur peut &ecirc;tre comprise entre 0 et 255, seuls 255 ordinateurs h&ocirc;tes peuvent &ecirc;tre branch&eacute;s sur un r&eacute;seau de la classe C. Un num&eacute;ro de cette classe est r&eacute;serv&eacute;, il ne reste donc plus que 254 ordinateurs h&ocirc;tes possibles.</p>

<p>Par l'attribution d'adresses IP dynamique par branchement, les exploitants de r&eacute;seau peuvent  maintenir les possibilit&eacute;s effectives de branchement sur Internet &agrave; un niveau sensiblement plus &eacute;lev&eacute; que si chaque ordinateur recevait une adresse immuable qu'il soit en ligne ou non. Est-ce que ce sch&eacute;ma d'adressage r&eacute;pondra encore aux exigences du futur? Certains commencent &agrave; en douter. Il existe d&eacute;j&agrave; des id&eacute;es pour une nouvelle structuration de l'adressage de r&eacute;seaux et d'ordinateurs h&ocirc;tes.</p>






<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="client_server">Technologie Client- Serveur</a></h2>

<img src="inet.jpg" width="389" height="381" alt="" border="0" align="left" hspace="10" vspace="5"><p>Pour
les diff&eacute;rents services Internet comme World Wide Web, Gopher, courriel, FTP etc... un logiciel serveur appropri&eacute; doit &ecirc;tre install&eacute; sur un ordinateur
h&ocirc;te qui veut proposer ces services &agrave; d'autres ordinateurs. Un ordinateur
h&ocirc;te ne peut proposer un service Internet que si un logiciel serveur appropri&eacute;
est actif sur l'ordinateur et si l'ordinateur est en ligne, et qu'aucun logiciel de protection (mur pare-feu) n'emp&ecirc;che ou ne restreint les acc&egrave;s venant de l'ext&eacute;rieur.</p>

<p>Les <b>Serveurs</b> sont des programmes qui attendent en permanence qu'une demande arrive concernant leurs services. Ainsi par exemple un serveur WWW attend-il des demandes d'appel de pages WWW qui y sont sauvegard&eacute;es.</p>

<p>Les <b>Clients</b>  sont par contre des programmes logiciels qui r&eacute;clament
des donn&eacute;es du serveur - c'est le cas typique-. Votre navigateur WWW par
exemple est un Client. Si par exemple vous cliquez sur un lien qui conduit &agrave;
une adresse HTTP, le navigateur, donc le Client WWW lance une demande au Serveur
correspondant pour l'ordinateur h&ocirc;te &eacute;loign&eacute;. Le Serveur &eacute;value la demande et envoie les donn&eacute;es d&eacute;sir&eacute;es. Pour r&eacute;gler la communication entre Clients et Serveurs il y des protocoles correspondants. C'est par exemple le protocole HTTP qui r&egrave;gle la communication Client Serveur sur le WWW. Un tel protocole tourne en amont du protocole TCP/IP.</p>

<p>Normalement, le Client r&eacute;clame des donn&eacute;es et le Serveur envoie les
donn&eacute;es. Pourtant, il y a aussi des &quot;exceptions&quot;. Ainsi un Client ne
peut-il pas seulement r&eacute;clamer des donn&eacute;es, mais aussi en envoyer au Serveur:
par exemple quand vous transmettez un fichier sur l'ordinateur Serveur par FTP,
quand vous envoyez un courrier &eacute;lectronique ou encore quand vous remplissez et
exp&eacute;diez un formulaire sur le WWW. Dans ces cas-l&agrave; on parle aussi de <b>Client-Push</b> (&quot;le Client impose des donn&eacute;es au Serveur&quot;).</p>

<p>Il y a une autre exception: c'est quand le Serveur devient actif le premier
et envoie quelque chose au Client sans qu'il l'ait demand&eacute;. C'est ce qu'on
appelle le <b>Server-Push</b> (&quot;le Serveur impose des donn&eacute;es au Client
&quot;). Des nouvelles technologies veulent &eacute;riger cette exception en r&egrave;gle:
ce qu'on appelle les <b>technologies</b> <b>push</b>. Ces technologies doivent permettre &agrave; un Client de recevoir r&eacute;guli&egrave;rement des donn&eacute;es sans avoir &agrave; les r&eacute;clamer. Gr&acirc;ce &agrave; elles, des services radio comme les actualit&eacute;s etc... sont r&eacute;alisables. Netscape et l' Explorer Internet Microsoft (tous deux &agrave; partir de la version 4.0) ont des interfaces correspondantes pour avoir
recours &agrave; de tels services. C'est pourtant une chance qu'elle ne s'imposent pas. Internet n'est justement pas la t&eacute;l&eacute;vision mais un m&eacute;dia qui vit de l'activit&eacute; de l'utilisateur et non pas de son app&eacute;tit de consommation.<br clear="all"></p>







<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="dns">DNS - Domain Name Service</a></h2>

<p>Les ordinateurs sont plus &agrave; l'aise avec des chiffres, les hommes en r&egrave;gle
g&eacute;n&eacute;rale avec des noms. C'est pourquoi on a invent&eacute; un syst&egrave;me qui traduit les adresses IP num&eacute;riques pour l'utilisateur final en adresses alphab&eacute;tiques.</p>

<p>Ce syst&egrave;me est construit de fa&ccedil;on analogue &agrave; celui des adresses IP (hi&eacute;rarchie). Une adresse alphab&eacute;tique dans ce syst&egrave;me fait partie d'un <b>Top-Level-Domain</b>. Les diff&eacute;rentes parties de telles adresses alphab&eacute;tiques sont, comme pour les adresses IP s&eacute;par&eacute;es par des points. Un exemple pour une telle adresse alphab&eacute;tique est ( <var>yahoo.com</var>, <var>mozilla.org</var> ou <var>teamone.de</var>.</p>

<p>Les Top-Level-domains se trouvent &agrave; la fin d'un nom de domaine. Il s'agit d'abr&eacute;viations plus ou moins &eacute;loquentes. Les abr&eacute;viations qui
d&eacute;signent ces Top-Level-Domains, sont soit un indicatif de pays soit un indicatif
de type. quelques exemples:<br>
<var>de</var> = Allemagne<br>
<var>at</var> = Autriche<br>
<var>ch</var> = Suisse<br>
<var>fr</var> = France<br>
<var>it</var> = Italien<br>
<var>my</var> = Malaisie<br>
<var>com</var> = titulaires &agrave; orientation commerciale<br>
<var>org</var> = Organisation<br>
<var>net</var> = r&eacute;seau g&eacute;n&eacute;ral<br>
<var>edu</var> = grandes &eacute;coles am&eacute;ricaines<br>
<var>gov</var> = administrations am&eacute;ricaines<br>
<var>mil</var> = installations militaires am&eacute;ricaines</p>

<p>&Agrave; cette heure (cl&ocirc;ture de la r&eacute;daction du pr&eacute;sent document) sont apparus de nouveaux Top-Level-Domains. Sont pr&eacute;vus:</p>

<p><var>biz</var> = entreprises<br>
<var>pro</var> = corporations auxquelles la publicit&eacute; est interdite (avocats, conseillers fiscaux, m&eacute;decins etc.)<br>
<var>name</var> = personnes priv&eacute;es<br>
<var>info</var> = services d'information de toutes sortes<br>
<var>museum</var> = mus&eacute;es<br>
<var>aero</var> = compagnies a&eacute;riennes, a&eacute;roports agences de voyage etc.<br>
<var>coop</var> = associations, clubs, organisations</p>

<p>&Agrave; la cl&ocirc;ture de la r&eacute;daction du pr&eacute;sent document <var>info</var> et <var>biz</var> sont d&eacute;j&agrave; disponibles, <var>name</var> doit &ecirc;tre le prochain.</p>

<p>Chacun de ces Top-Level-Domains repr&eacute;sente un domaine administratif
pour lesquels existe aussi une administration de tutelle qui est responsable de
l'attribution de nom pour les Sub-Level-Domains de leur domaine administratif.
Si par exemple vous voulez demander un nom de domaine tel que <var>Mafirme.fr</var>, il faut en faire la demande &agrave; la <b>Fran&ccedil;aise de Nommage</b>. Des fournisseurs d'acc&egrave;s &agrave; vocation commerciale peuvent le faire pour vous, si vous faites appel &agrave; eux pour un service correspondant. Vous ne pourrez pourtant obtenir le nom que vous d&eacute;sirez que s'il n'a pas encore &eacute;t&eacute; attribu&eacute;. Des petits rus&eacute;s ont eu pour cette raison l'id&eacute;e de se r&eacute;server pour eux les milliers de noms de domaines  pour les revendre ensuite aux int&eacute;ress&eacute;s. Entre-temps il y a d&eacute;j&agrave; , malheureusement toute une s&eacute;rie de sombres histoires et de proc&egrave;s. Quand par exemple, deux firmes du m&ecirc;me nom qui n'ont par ailleurs rien &agrave; voir l'une avec l'autre veulent faire r&eacute;server le m&ecirc;me nom de domaine, Seule l'une d'entre elles peut obtenir satisfaction . En raison de ce "rationnement" des noms disponibles, des noms d'adresse plus longs tels que  <var>ce-jour-je-vais-au-cinema.fr</var> ont acquis entre-temps une certaine popularit&eacute;.</p>

<p>Des titulaires de noms de domaine peuvent encore attribuer des Sub-Level-Domains. Ainsi par exemple existe un domaine appel&eacute; <var>page.net</var>. Les exploitants de ce domaine ont encore attribu&eacute; des Sub-Level-Domains de ce domaine d'o&ugrave; sont sortis des adresse domaine telles que <var>java.page.net</var> ou <var>javascript.page.net</var>.</p>






<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="routing">Routing et Gateways</a></h2>

<p>Sur Internet en tant que r&eacute;seau des r&eacute;seaux, il n'est d'abord possible
qu'&agrave; l'int&eacute;rieur du propre sous-r&eacute;seau d'envoyer directement des donn&eacute;es d'une adresse IP &agrave; une autre. Dans tous les autres cas quand les donn&eacute;es doivent &ecirc;tre envoy&eacute;es &agrave; un autre num&eacute;ro de r&eacute;seau, des ordinateurs entrent en action qui r&egrave;glent le trafic entre r&eacute;seaux. Ces ordinateurs sont appel&eacute;s <b>Gateways</b>. Ces ordinateurs acheminent les donn&eacute;es d'ordinateurs h&ocirc;tes de leur sous r&eacute;seau &agrave; des Gateways d'autres sous-r&eacute;seaux et prennent en charge les donn&eacute;es arrivant de Gateways d'autres sous-r&eacute;seaux pour les acheminer vers les ordinateurs h&ocirc;tes de leur propre r&eacute;seau. Sans Gateways il n'y aurait pas du tout d'Internet.</p>

<p>On appelle <b>Routing</b>  l'acheminement des donn&eacute;es entre des sous-r&eacute;seaux. La description des possibilit&eacute;s de routage &agrave; partir de son
propre r&eacute;seau vers les autres r&eacute;seaux est inscrite dans des <b>tableaux de
routage</b> sur les ordinateurs Gateway.</p>

<p>Dans les missions d'un Gateway s'inscrit aussi celle de trouver un itin&eacute;raire de rechange quand la route habituelle ne fonctionne pas par exemple en cas de panne de la ligne concern&eacute;e ou de &quot;bouchon de donn&eacute;es&quot;. Les Gateways s'envoient continuellement des paquets test pour v&eacute;rifier le fonctionnement de la connexion et pour trouver des itin&eacute;raires peu encombr&eacute;s pour le transfert de donn&eacute;es.</p>

<p>Donc, quand sur Internet un transfert de donn&eacute;es a lieu il n'est pas
&eacute;vident du tout de savoir d'avance quel chemin les donn&eacute;es prennent. M&ecirc;me les paquets d'un m&ecirc;me envoi peuvent prendre des chemins absolument diff&eacute;rents. Si par exemple vous appelez d'Allemagne une page WWW qui se trouve aux USA, il
est fort possible que la moiti&eacute; de la page traverse l'Atlantique et l'autre
moiti&eacute; le Pacifique avant que votre navigateur WWW ne puisse les afficher. Ni
vous ni votre navigateur ne le remarquez.</p>






<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="autoorganisation">Auto-organisation sur Internet</a></h2>

<p>Si on consid&egrave;re le nombre de participants sur Internet les frais de fonctionnement du r&eacute;seau sont relativement peu &eacute;lev&eacute;s. La plupart des
utilisateurs finaux ne savent m&ecirc;me pas qu'il existe de telles instances.</p>

<p>Une institution qui l&eacute;gif&egrave;re un peu comme il en existe dans le domaine
constitutionnel d'un &eacute;tat n'existe pas sur Internet en tant qu'association
mondiale. La tentative d'instaurer l'<b>ICANN</b> comme instance supr&ecirc;me pour la d&eacute;livrance de domaine et d'IP, a fait couler beaucoup d'encre mais les craintes qu'elles fassent na&icirc;tre une dictature centralis&eacute;e d'Internet se sont av&eacute;r&eacute;es jusqu'alors infond&eacute;es. Beaucoup de domaines sur Internet reposent de fait sur l'auto-organisation. Pour les services tels que le courriel pr&eacute;vaut un accord tacite pr&eacute;voyant que chaque Gateway rattach&eacute; achemine tous les courriers m&ecirc;me si ni l'exp&eacute;diteur ni le destinataire ne font partie de son propre sous-r&eacute;seau. Les co&ucirc;ts sont bien support&eacute;s par l'exploitant du r&eacute;seau mais comme tous ont int&eacute;r&ecirc;t &agrave; ce que le r&eacute;seau fonctionne &agrave; l'&eacute;chelon mondial, chacun est pr&ecirc;t &agrave; supporter les frais qui en r&eacute;sultent.</p>

<p>La capacit&eacute; de fonctionnement d'Internet se fonde sur l'acceptation par les
int&eacute;ress&eacute;s de ne pas faire la chasse aux centimes! Internet a cr&eacute;&eacute; la g&eacute;n&eacute;rosit&eacute; et l'&eacute;troitesse d'esprit est le grand ennemi de l'id&eacute;e Internet.</p>

<p>Le Usenet, c'est la plus grande partie des groupes de nouvelles, s'organise
m&ecirc;me compl&egrave;tement lui-m&ecirc;me, ce qui fait volontiers citer ce syst&egrave;me
par ses partisans inconditionnels comme &eacute;tant un exemple existant r&eacute;ellement de libert&eacute; des seigneurs. La &quot;gestion&quot; sur Usenet se passe dans des groupes de nouvelles sp&eacute;ciaux (ceux qui commencent avec <var>news.</var> . L&agrave; par exemple peuvent &ecirc;tre faites des propositions pour cr&eacute;er de nouveaux groupes et apr&egrave;s d&eacute;lib&eacute;ration, il est d&eacute;cid&eacute; si un groupe doit &ecirc;tre cr&eacute;&eacute; ou supprim&eacute;.</p>

<p>Il existe des instances officielles pour l'attribution d'adresses de r&eacute;seaux
ou des adresses alphab&eacute;tiques (DNS). Pour l'attribution de l'adresse IP dans un
r&eacute;seau c'est l'exploitant du r&eacute;seau qui est comp&eacute;tent. &Agrave; cela s'ajoutent des organisations qui s'occupent des standards sur l'Internet.</p>

<p>Les co&ucirc;ts pour la transmission de donn&eacute;es sur Internet sont support&eacute;s par les exploitants de sous-r&eacute;seaux. Ces co&ucirc;ts sont r&eacute;percut&eacute;s en aval aux fournisseurs d'acc&egrave;s &agrave; l'int&eacute;rieur du sous-r&eacute;seau jusqu'&agrave; l'utilisateur final qui, par le fournisseur d'acc&egrave;s, a acc&egrave;s &agrave; Internet ou utilise les services Internet comme la publication de ses propres pages WWW.</p>

<p>La liste suivante contient quelques liens aux organisations nationales ou
internationales les plus importantes sur Internet:</p>

<p><img src="../../src/fr.gif" width="16" height="10" border="0" alt="Page en langue fran&ccedil;aise">&nbsp;<a target="_top" href="http://www.francaisedenommage.fr/"><b>Fran&ccedil;aise de nommage (DE-NIC)</b></a><br>
Organisme d'attribution des noms de domaine assujettis au Top-Level-Domain <var>.fr</var></p>

<p><img src="../../src/en.gif" width="16" height="10" border="0" alt="Page en langue anglaise">&nbsp;<a target="_top" href="http://www.internic.net/"><b>International Network Information Center (InterNIC)</b></a><br>
Projet en collaboration entre AT&amp;T, General Atomics und Network Solutions, Inc. AT&amp;T. Organisme international d'attribution de noms de domaine.</p>

<p><img src="../../src/en.gif" width="16" height="10" border="0" alt="Page en langue anglaise">&nbsp;<a target="_top" href="http://www.icann.org/"><b>The Internet Corporation
for Assigned Names and Numbers (ICANN)</b></a><br>
Projet de collaboration entre AT&amp;T, General Atomics et Network Solutions, Inc. AT&amp;T.
office international d'attribution de noms de domaines.</p>

<p><img src="../../src/en.gif" width="16" height="10" border="0" alt="Page en langue anglaise">&nbsp;<a target="_top" href="http://www.iab.org/"><b>Internet Architecture Board (IAB)</b></a><br>
Organisation pour la documentation sur la structure du r&eacute;seau et les processus
fondamentaux sur Internet.</p>

<p><img src="../../src/en.gif" width="16" height="10" border="0" alt="Page en langue anglaise">&nbsp;<a target="_top" href="http://www.iana.org/"><b>Internet Assigned Numbers Authority (IANA)</b></a><br>
Organisme central pour les protocoles Internet</p>

<p><img src="../../src/en.gif" width="16" height="10" border="0" alt="Page en langue anglaise">&nbsp;<a target="_top" href="http://www.ietf.org/"><b>Internet Engineering Task Force (IETF)</b></a><br>
Communaut&eacute; internationale d'actifs commerciaux ou non sur Internet avec le but de proposer des standards techniques sur Internet.</p>

<p><img src="../../src/en.gif" width="16" height="10" border="0" alt="Page en langue anglaise">&nbsp;<a target="_top" href="http://www.isoc.org/"><b>Internet Society</b></a><br>
Organisation internationale pour la coop&eacute;ration et la coordination de technologies et d'application sur Internet.</p>

<p><img src="../../src/en.gif" width="16" height="10" border="0" alt="Page en langue anglaise">&nbsp;<a target="_top" href="http://www.w3.org/"><b>W3-Konsortium</b></a><br>
Organisation qui coordonne sp&eacute;cialement le d&eacute;veloppement de standards
techniques du World Wide Web comme HTML ou le protocole HTTP.</p>

<p>Avant tout ces organisations l&agrave; qui s'occupent du d&eacute;veloppement technique
sur Internet sont assaillies par des grandes firmes de logiciels comme Microsoft, Netscape
ou Sun, &eacute;tant donn&eacute; que ces firmes ont int&eacute;r&ecirc;t &agrave; obtenir pour leurs produits logiciels et leurs propres standards pour les technologies de Serveur, langages de programmation etc... le statut de standard mondial Internet. L'avenir devra nous
dire s'il est possible et &agrave; quel point d'imposer des nouveaux standards
ind&eacute;pendants de tout constructeur qui aient le succ&egrave;s de HTML et HTTP, &eacute;tant donn&eacute; l'apparition de ce march&eacute; potentiel de plusieurs milliards. &Agrave; l'heure actuelle, les perspectives sont plut&ocirc;t bonnes. La plupart des groupes informatiques ont compris que des standards ind&eacute;pendants de tout constructeur leur apportaient en fin de compte &eacute;galement davantage. Et la pression d'utilisateurs avertis augmente aussi qui n'avaient plus envie au bout de quelques ann&eacute;es de devoir acheter un nouveau logiciel sp&eacute;cifique (propri&eacute;taire)qui au bout de quelques ann&eacute;es est &agrave; nouveau &quot;obsol&egrave;te&quot; et dispara&icirc;t du march&eacute;.</p>











<table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr><td colspan="2" bgcolor="#EEEEEE" class="doc">
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a>
</td></tr>
<tr><td bgcolor="#EEEEEE" class="doc" align="right"><a href="services.htm"><img src="../../src/suivant.gif" width="10" height="10" border="0" hspace="10" alt="page suivante"></a></td>
<td bgcolor="#FFFFFF"><img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information"> <a href="services.htm"><b>Services sur Internet</b></a>
</td></tr>
<tr>
<td bgcolor="#EEEEEE" class="doc" align="right"><a href="apparition.htm"><img src="../../src/precedent.gif" width="10" height="10" border="0" hspace="10" alt="page pr&eacute;c&eacute;dente"></a></td>
<td bgcolor="#FFFFFF" width="100%"><img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information"> <a href="apparition.htm"><b>Apparition d'Internet</b></a>
</td>
</tr>
<tr><td colspan="2" bgcolor="#EEEEEE" class="doc">&#160;</td></tr>
</table><table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr>
<td bgcolor="#FFEEDD" class="nav"><a class="an" name="bottom"><img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"></a> <a href="../../index.htm"><b>SELFHTML</b></a>/<a href="../../navigation/index.htm" target="_parent">Aides &agrave; la navigation</a> <img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="../index.htm"><b>Introduction</b></a> <img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="index.htm"><b>Internet et le WWW</b></a></td>
</tr>
</table>

<p>&copy; 2001 Stefan M&uuml;nz / &copy; 2003 Traduction <img src="../../src/courriel.gif" width="15" height="10" border="0" alt="Adresse &eacute;lectronique">&nbsp;<a href="mailto:13405@free.fr">Serge Fran&ccedil;ois, 13405@free.fr</a><br><img src="../../src/courriel.gif" width="15" height="10" border="0" alt="Adresse &eacute;lectronique">&nbsp;<a href="mailto:selfhtml@selfhtml.com.fr">selfhtml@selfhtml.com.fr</a></p>



</body>
</html>
