<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>SELFHTML: Introduction / Internet et le WWW / Apparition du World Wide Web</title>
<link rel="stylesheet" type="text/css" href="../../src/selfhtml.css">
<meta name="description"    content="Comment est apparu le World Wide Web et comment s'est-il d&eacute;velopp&eacute;.">
<meta name="keywords"       content="SELFHTML, Internet, Histoire de l'Internet, WWW, Web, World Wide Web">
<meta name="author"         content="Stefan M&uuml;nz, selfhtml@teamone.de">
<meta http-equiv="content-type" content="text/html; charset=ISO-8859-1">
<meta name="DC.Publisher"   content="Serge Fran&ccedil;ois, selfhtml@selfhtml.com.fr">
<meta name="DC.Date"        content="2003-01-27T08:00+00:00">
<meta name="DC.Identifier"  content="http://selfhtml.selfhtml.com.fr/introduction/internet/www.htm">
<meta name="DC.Language"    content="fr">
<meta name="DC.Rights"      content="../../editorial/copyright.htm">
<meta name="DC.Date.Create" content="2003-01-27T08:00+00:00">
<meta name="SELF.Version"   content="1">
<meta name="SELF.Pagetype"  content="Information">
<meta name="SELF.Path"      content="SELFHTML == ../../index.htm // Einf&uuml;hrung == ../index.htm // Internet und WWW == index.htm">
<!-- Matomo -->
<script type="text/javascript">
  var _paq = window._paq = window._paq || [];
  /* tracker methods like "setCustomDimension" should be called before "trackPageView" */
  _paq.push(['trackPageView']);
  _paq.push(['enableLinkTracking']);
  (function() {
    var u="//matomo.boitasite.com/";
    _paq.push(['setTrackerUrl', u+'matomo.php']);
    _paq.push(['setSiteId', '1']);
    var d=document, g=d.createElement('script'), s=d.getElementsByTagName('script')[0];
    g.type='text/javascript'; g.async=true; g.src=u+'matomo.js'; s.parentNode.insertBefore(g,s);
  })();
</script>
<!-- End Matomo Code -->
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#AA5522" vlink="#772200" alink="#000000">

<table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr>
<td bgcolor="#FFEEDD" class="nav"><a class="an" name="top"><img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"></a> <a href="../../index.htm"><b>SELFHTML</b></a>/<a href="../../navigation/index.htm" target="_parent">Aides &agrave; la navigation</a> <img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="../index.htm"><b>Introducrion</b></a> <img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="index.htm"><b>Internet et le WWW</b></a></td>
</tr>
</table><table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr>
<td bgcolor="#EEEEEE" class="doc" width="110"><img src="../../src/logo.gif" width="106" height="109" border="0" alt="SELFHTML"></td>
<td bgcolor="#EEEEEE" class="doc" valign="bottom" width="100%"><h2>Apparition du World Wide Web</h2>
<tr>
<td bgcolor="#EEEEEE" class="doc" valign="top" align="center">
<img src="../../src/docx.gif" width="30" height="20" vspace="6" border="0" alt="Page d'information: vue d'ensemble">
</td>
<td bgcolor="#FFFFFF" valign="top" nowrap>
<p>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#debuts"><b>Tim Berners-Lee et les d&eacute;buts</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#essor"><b>Marc Andreessen, Netscape et l'essor</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#w3c"><b>Le travail du consortium W3</b></a><br>
</p>
</td>
</tr><tr><td colspan="2" bgcolor="#EEEEEE" class="doc">&#160;<a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;</td></tr>
</table>




<h2 class="Sh2"><a class="an" name="debuts">Tim Berners-Lee et les d&eacute;buts</a></h2>

<p><img src="tim.jpg" width="82" height="123" border="0" hspace="5" vspace="3" alt="Tim Berners Lee" align="left">Le britannique de naissance <b>Tim Berners-Lee</b>, informaticien au centre d'&eacute;nergie et de la recherche de Gen&egrave;ve dans les ann&eacute;es 80er jusque dans les ann&eacute;es 90, d&eacute;crit dans son livre &quot;Weaving the Web&quot;, comment l&agrave; au CERN dans les ann&eacute;es 80 il utilisait un programme &eacute;crit par lui-m&ecirc;me comme utilitaire de productivit&eacute;. Le programme, &eacute;crit par Berners-Lee en Pascal tournait sur un syst&egrave;me informatique &eacute;quip&eacute; s'un programme d'exploitation &quot;Norsk Data SYNTRAN III&quot;. les disquettes 8-pouces sur lesquelles la source &eacute;tait sauvegard&eacute;e furent &eacute;gar&eacute;es un beau jour.</p>

<p>L'utilitaire n'avait certainement pas grand chose &agrave; voir avec les logiciels d'aujourd'hui. Il n'y avait pas d'interface graphique et les syst&egrave;mes avec invite de commande dominaient, le texte vert sur fond noir dominait sur les &eacute;crans. C'est donc sur un tel syst&egrave;me que Tim faisait tourner son programme. Il appela le programme <b>Enquire</b>, ce qui veut dire en fran&ccedil;ais quelque chose comme &quot;se renseigner&quot;.</p>

<p>&quot;Enquire&quot; &eacute;tait un programme <img src="../../src/chap.gif" width="15" height="13" border="0" alt="Chapitre: vue d'ensemble">&nbsp;<a href="../hypertexte/index.htm"><b>Hypertexte</b></a> . On pouvait y &eacute;diter des fichiers texte qui - &eacute;tant vraisemblablement marqu&eacute;s par des s&eacute;quences quelconques de caract&egrave;res - &eacute;taient sous-divis&eacute;s en &quot;nodes&quot; (n&#156;uds). Un n&#156;ud pouvait &ecirc;tre tout ce que l'on s'imagine comme pouvant &ecirc;tre des donn&eacute;es - des adresse, des notes prises pendant une discussion, des id&eacute;es spontan&eacute;es, des &eacute;v&eacute;nements v&eacute;cus, des r&eacute;sultats de travail. Pour chaque n&#156;ud figurait une liste avec des liens &agrave; d'autres n&#156;uds. On pouvait suivre toute sorte de relation crois&eacute;e que l'on trouvait ou connaissait. Des liens &agrave; des cibles &agrave; l'int&eacute;rieur d'un fichier &eacute;taient repr&eacute;sent&eacute;s automatiquement comme bidirectionnel par le programme  Enquire - ce qui veut dire que si le lien n'&eacute;tait pos&eacute; que de A &agrave; B, on trouvait en B dans la liste un lien de retour sur A.</p>

<p>Fin 1988 Berners-Lee se d&eacute;cida, de d&eacute;velopper en am&eacute;liorant &quot;Enquire&quot; un syst&egrave;me  sur plusieurs ordinateurs . Pour le CERN, il devait dans ce but, d&eacute;poser un projet correspondant en y d&eacute;taillant son intention. C'&eacute;tait l'&eacute;poque o&ugrave; Berners-Lee noua des contacts avec divers sp&eacute;cialistes pour trouver des moyens techniques pour la r&eacute;alisation de ses id&eacute;es. Ben Segal, un coll&egrave;gue de Berners-Lee, qui s'y connaissait dans les bases d'Internet persuada le d&eacute;veloppeur de l'hypertexte des possibilit&eacute;s uniques du r&eacute;seau des r&eacute;seaux. En 1989 il soumit sa proposition au CERN. De nombreux mois pass&egrave;rent pourtant et  Berners-Lee ne recevait aucune r&eacute;action &agrave; sa proposition. Robert Cailliau, une vieille connaissance, s'enflamma pour l'id&eacute;e du britannique et s'investit pour continuer &agrave; imposer le projet au CERN. &Agrave; cette &eacute;poque, c'&eacute;tait en 1990 - le projet re&ccedil;ut son nom d&eacute;finitif: <b>World Wide Web</b>. &Agrave; l'automne de l'ann&eacute;es 1990,  Berners-Lee &eacute;crivit de sa propre main les premi&egrave;res versions des trois piliers de son concept:</p>
<ol>
<li>La sp&eacute;cification pour la communication entre des clients Web et des serveurs Web- ce qu'on appelle le <b>protocole HTTP</b> (<i>HTTP = Hypertext Transfer Protocol</i>)</li>
<li>la sp&eacute;cification pour l'adressage de fichiers et de sources de donn&eacute;es de son choix sur le Web et le reste de l'Internet - le sch&eacute;ma de ce qu'on appelle l' <b>URIs</b> (<i><i>URI = Universal Resource Identifier, descripteur universel de ressources</i></i>).</li>
<li>la sp&eacute;cification pour un langage de marquage pour les documents Web que Berners-Lee appela <b>HTML</b>  (<i>HTML = Hypertext Markup Language,  langage de marquage hypertexte</i>).</li>
</ol>

<p>Berners-Lee &eacute;crivit &eacute;galement le premier logiciel de serveur Web. L'ordinateur sur lequel il fut install&eacute; pouvait &ecirc;tre atteint sous le nom <var>info.cern.ch</var>. C'est l&agrave; que Berners-Lee &agrave; No&euml;l 1990 mit &agrave; disposition les premi&egrave;res pages Web du monde. Ses id&eacute;es diff&eacute;raient sensiblement &agrave; l'origine de ce qu'est devenu le Web. Ainsi   Berners-Lee insistait toujours pour que les pages Web puissent &ecirc;tre &eacute;dit&eacute;es en ligne, de fa&ccedil;on &agrave; ce que les visiteurs de pages Web puissent continuer &agrave; &eacute;crire des textes dans la mesure o&ugrave; celui qui proposait ces pages en ait accord&eacute; les droits publics d'&eacute;criture pour ses fichiers. Cependant, les navigateurs Web qui finirent par s'imposer &eacute;taient de simples  logiciels de lecture.</p>

<p>Le Web ne se d&eacute;veloppa pas forc&eacute;ment tout seul au d&eacute;but. Berners-Lee et les partisans de son projet &eacute;taient infatigables au travail pour faire conna&icirc;tre le Web et &agrave; l'imposer. &Agrave; une conf&eacute;rence internationale sur l'hypertexte en 1991, ils pr&eacute;sent&egrave;rent le projet. Des contacts avec des pour diff&eacute;rents syst&egrave;mes furent nou&eacute;s et ce n'est qu'ainsi qu'apparurent les premiers navigateurs Web. Car seul l'acc&egrave;s &agrave; de tels navigateurs permettait aux autres hommes disposant de l'acc&egrave;s  &agrave; Internet s'appeler des pages Web. Nicola Pellow, une jeune collaboratrice et math&eacute;maticienne au CERN &eacute;crivit le premier navigateur &agrave; peu pr&egrave;s utilisable en mode texte. En 1992 apparurent &eacute;galement les premiers navigateurs pour interface utilisateur graphique nomm&eacute;s respectivement <b>Erwise</b> et <b>Viola</b>. En m&ecirc;me temps, le nombre de serveurs Web gr&acirc;ce auxquels les pages Web &eacute;taient propos&eacute;es grimpait. Au d&eacute;part, ce furent essentiellement des institutions scientifiques.</p>



<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="essor">Marc Andreessen, Netscape et l'essor</a></h2>

<p><img src="marc.jpg" width="60" height="100" border="0" alt="Marc Andreessen" hspace="5" vspace="3" align="left">Pour les &eacute;tudiants en programmation, le d&eacute;fi d'&eacute;crire des navigateurs pour le Web &eacute;tait toujours plus int&eacute;ressant. Un jeune homme du nom de <b>Marc Andreessen</b> se distingua particuli&egrave;rement. Il d&eacute;veloppa un navigateur Web pour interface utilisateur graphique baptis&eacute;e  <b>Mosaic</b>. Tim Berners-Lee, qui connaissait lui-m&ecirc;me Marc Andreessen, le d&eacute;crit comme quelqu'un qui non plus comme tous les d&eacute;veloppeurs de navigateurs avant lui voulait d&eacute;velopper un logiciel pour le Web, mais au contraire comme quelqu'un qui avait l'ambition de rendre d'abord et avant tout le Web accessible et cela avec son navigateur.</p>

<p>Andreessen et son &eacute;quipe de programmeurs engag&eacute;s n'avaient pas grand chose en commun avec les id&eacute;es philosophiques de  Berners-Lee. Ils pens&egrave;rent depuis le d&eacute;but en termes &eacute;conomiques. Lors du d&eacute;veloppement du navigateur Mosaic, les programmeurs invent&egrave;rent de nouvelles propri&eacute;t&eacute;s qu'ils implant&egrave;rent dans le navigateur Web, sans que ces propri&eacute;t&eacute;s fussent standardis&eacute;es. Mais m&ecirc;me si Berners-Lee au fil des lignes de son livre laisse entendre clairement quelle pi&egrave;tre opinion il a d'Andreessen  - c'est gr&acirc;ce au navigateur mosaic que l'avalanche se mit en mouvement. Mais bient&ocirc;t pourtant, le projet Mosaic devint trop &eacute;triqu&eacute; pour l'ambitieux Marc Andreessen. Il voulait plus, il voulait un navigateur qui conquerrait le monde. Andreessen quitta finalement le projet  Mosaic et devint cofondateur d'une nouvelle firme pour logiciels Web: <b>Netscape</b>. Celui qui d&eacute;fend aujourd'hui le &quot;bon&quot; navigateur Netscape contre le  &quot;m&eacute;chant&quot; navigateur Microsoft, ne sait pas du tout la plupart du temps qu'&agrave; ses d&eacute;buts  Netscape avait sans fard, exactement la m&ecirc;me soif de monopole et de conqu&ecirc;te du march&eacute; que Microsoft.</p>

<p>Le concept de Netscape dans un premier temps monta en fl&egrave;che. Une toute nouvelle corporation vit le jour: les <b>concepteurs Web</b>. Dans les ann&eacute;es 1995 et 1996, ils planchaient en r&ecirc;vant devant leurs premi&egrave;res pages Web qui, gr&acirc;ce &agrave; Netscape pouvaient contenir des arri&egrave;re-plans de couleur et des polices de couleur, des papiers peints, des pr&eacute;sentations de tableaux, des fen&ecirc;tres d'&eacute;cran &agrave; plusieurs divisions (cadres) et des plugiciels  Multim&eacute;dia. Des milliers d'utilisateurs priv&eacute;s commenc&egrave;rent &agrave; faire leur page d'accueil. Peu &agrave; peu toutes les firmes, organisations, gouvernement et administrations &agrave; travers le monde se press&egrave;rent au portillon avec leurs propres offres sur le Web. Les taux de croissance &eacute;taient semblables &agrave; ceux d'une explosion. L'heure &eacute;tait aussi venue pour ces strat&egrave;ges en mercatique dont le v&#156;u serait de faire du monde entier un tableau d'affichage. Avec ferveur et des capitaux, ils se pr&eacute;cipit&egrave;rent sur ce nouveau m&eacute;dium en plein essor sans avoir la moindre id&eacute;e de ce dont il s'agissait vraiment. Rien d'&eacute;tonnant &agrave; ce que de nombreuses tentatives pour rouler le Web dans la farine &eacute;chou&egrave;rent lamentablement pour finalement assurer une ambiance de lendemain de f&ecirc;te &agrave; la bourse ou sur le march&eacute; de la publicit&eacute;.</p>

<p>Dans les ann&eacute;es 1995 et 1996 le navigateur Netscape atteignait pour un temps parmi les utilisateurs une part de march&eacute; de 90%. Le groupe Microsoft dormait dans un premier temps du sommeil du juste et et se repaissait des chiffres d'affaires de ses syst&egrave;mes d'exploitation MS DOS et MS Windows et de son traitement de texte MS Word. Au milieu des ann&eacute;es 90, alors que l'essor en ligne touchait des couches toujours plus larges de la population des pays occidentaux, on misa d'abord chez Microsoft sur un service en ligne propre et sp&eacute;cifique &agrave; Microsoft du nom de MSN. Internet et le Web selon Bill Gates, ne seraient pas dignes de Microsoft. Quand cependant, on vit comme Netscape, en l'espace de quelque mois avait modifi&eacute; le paysage informatique, comme la firme Netscape avait effectu&eacute; un d&eacute;part en bourse de r&ecirc;ve encore jamais vu jusqu'alors et que l'implantation de ses navigateurs se r&eacute;pandait comme un virus informatique, on commen&ccedil;a l&agrave; &agrave; r&eacute;agir fi&eacute;vreusement. Avec une d&eacute;bauche de main d'&#156;uvre on rattrapa le g&acirc;chis. En un peu plus d'un an apparurent les quatre premi&egrave;res versions de L'explorer Internet MS , et Microsoft avec la version 4 du printemps 1997 r&eacute;ussit une perc&eacute;e technologique analogue &agrave; celle de Netscape au printemps 1997 avec les versions 1.1 et 2.0 de son navigateur. Microsoft &eacute;tait loin de trembler en ce qui concerne la bataille avec Netscape. Ainsi d&eacute;claraient-ils que leur navigateur faisait tout simplement partie int&eacute;grante de leur syst&egrave;me d'exploitation MS Windows et profitait de cette fili&egrave;re de distribution existante pour une large divulgation de l'Explorer Internet. Maintenant il est difficile d'y r&eacute;torquer quoique ce soit, &eacute;tant donn&eacute; que le logiciel client Internet fait depuis toujours partie du syst&egrave;me d'exploitation, &eacute;galement justement dans le monde Unix. les desseins de Microsoft &eacute;taient cependant vraiment trop clairs et furent &agrave; l'origine d' une vague de haine contre le groupe de Redmont dans la communaut&eacute; Internet.</p>



<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="w3c">Le travail du consortium W3</a></h2>

<p><img src="w3c.gif" width="72" height="48" border="0" alt="Logo des W3-Konsortiums" hspace="5" vspace="3" align="left">La guerre des navigateurs fait rage encore aujourd'hui - tout au moins partout o&ugrave; l'on discute. Dans les fichiers de protocole (fichiers log) des serveurs Web, les jeux sont faits depuis longtemps. Microsoft s'est assur&eacute; aujourd'hui sur le march&eacute; des navigateurs peu &agrave; peu une position de 80 &agrave; 90% comme dans le domaine des syst&egrave;mes d'exploitation. Pourtant, il y a aussi de bonnes nouvelles: la conscience pour les bases techniques du Web a m&ucirc;ri et les id&eacute;es de Tim Berners-Lee sont entre-temps repr&eacute;sent&eacute;es par un consortium &agrave; plusieurs t&ecirc;tes: le <b>consortium W3 (W3C)</b>. Ce consortium est devenu en d&eacute;pit des navigateurs utilis&eacute;s par millions, le facteur le plus puissant pour le d&eacute;veloppement du Web. La moindre raison n'en est pas qu'il n'est pas qu'il n'est pas dirig&eacute; contre les int&eacute;r&ecirc;ts du march&eacute; des fabricants de logiciels mais que ses membres sont recrut&eacute;s en grande partie aupr&egrave;s de ces m&ecirc;mes firmes.</p>

<p>Fin 1994 se r&eacute;unit un premier comit&eacute; consultatif pour cr&eacute;er les base d'une institution devant assurer les bases techniques et les standards sur Internet. Le CERN fut d&eacute;pass&eacute; par cette mission, qui n'entrait pas dans le cadre de sa vocation premi&egrave;re.</p>

<p>En &eacute;t&eacute; 1995 des firmes renomm&eacute;es rejoignirent le consortium. Simultan&eacute;ment la pr&eacute;sence europ&eacute;enne du consortium ouvrait ses portes. Les membres du consortium W3 sont des firmes, ou des organisations pas de personnes priv&eacute;es. Elles signent un contrat de 3 ans et paient des cotisations qui financent l'organe. En contrepartie, ils ont acc&egrave;s aux informations non publiques et peuvent contribuer au d&eacute;veloppement des standards assur&eacute;s par le W3C tels que HTML, CSS, XML etc..</p>

<p>Le travail du W3C se divise en ce qu'on appelle  <b>Activit&eacute;s</b> (<i>Activities</i>). Il existe plusieurs douzaines de ces activit&eacute;s. Ainsi, il y a des activit&eacute;s pour HTML, XML, CSS etc. Pour chaque activit&eacute;, il y a des <b>groupes de travail</b> (<i>Working Groups</i>) et des <b>groupes d'int&eacute;r&ecirc;t</b> (<i>Interest Groups</i>). Alors que les groupes d'int&eacute;r&ecirc;t ont plus un r&ocirc;le d'influence, les groupes de travail s'occupent du travail proprement-dit sur le contenu. Les deux sortes de groupes sont compos&eacute;s de membres du W3C. Dans les groupes de travail, se trouvent donc aussi beaucoup de repr&eacute;sentants de fabricants de logiciels. Le noyau central ind&eacute;pendant du W3C surveille les activit&eacute;s.</p>

<p>Pour le d&eacute;veloppement de standards il existe l'expos&eacute; sur la cr&eacute;ation et la publication de r&eacute;f&eacute;rence technique de la <img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="../aide/docs.htm"><b>documentation</b></a> zu sur le standard correspondant.</p>

<p>Sur la  <img src="../../src/en.gif" width="16" height="10" border="0" alt="Page en langue anglaise">&nbsp;<a target="_top" href="http://www.w3.org/"><b>page d'accueil du consortium W3</b></a> il vous est possible de suivre toutes les activit&eacute;s de l'organisation. Entre-temps il existe aussi un <img src="../../src/fr.gif" width="16" height="10" border="0" alt="Page en langue allemande">&nbsp;<a target="_top" href="http://www.w3.org/Consortium/Translation/French/"><b>bureau fran&ccedil;ais du consortium W3</b></a>, qui rend compte du travail du consortium W3. Pour tous ceux qui ont &agrave; faire professionnellement avec la cr&eacute;ation Web, des visites r&eacute;guli&egrave;res aur les pages Web du consortium W3  sont devenues une obligation.</p>



<table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr><td colspan="2" bgcolor="#EEEEEE" class="doc">
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a>
</td></tr>
<tr><td bgcolor="#EEEEEE" class="doc" align="right"><a href="../technologies/html.htm"><img src="../../src/suivant.gif" width="10" height="10" border="0" hspace="10" alt="page suivante"></a></td>
<td bgcolor="#FFFFFF"><img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information"> <a href="../technologies/html.htm"><b>HTML</b></a>
</td></tr>
<tr>
<td bgcolor="#EEEEEE" class="doc" align="right"><a href="services.htm"><img src="../../src/precedent.gif" width="10" height="10" border="0" hspace="10" alt="page pr&eacute;c&eacute;dente"></a></td>
<td bgcolor="#FFFFFF" width="100%"><img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information"> <a href="services.htm"><b>Services sur Internet</b></a>
</td>
</tr>
<tr><td colspan="2" bgcolor="#EEEEEE" class="doc">&#160;</td></tr>
</table><table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr>
<td bgcolor="#FFEEDD" class="nav"><a class="an" name="bottom"><img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"></a> <a href="../../index.htm"><b>SELFHTML</b></a>/<a href="../../navigation/index.htm" target="_parent">Aides &agrave; la navigation</a> <img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="../index.htm"><b>Introduction</b></a> <img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="index.htm"><b>Internet et le WWW</b></a></td>
</tr>
</table>


<p>&copy; 2001 Stefan M&uuml;nz / &copy; 2003 Traduction</a> <img src="../../src/courriel.gif" width="15" height="10" border="0" alt="Adresse &eacute;lectronique">&nbsp;<a href="mailto:13405@free.fr">Serge Fran&ccedil;ois, 13405@free.fr</a></nobr> <br><img src="../../src/courriel.gif" width="15" height="10" border="0" alt="Adresse &eacute;lectronique">&nbsp;<a href="mailto:selfhtml@selfhtml.com.fr">selfhtml@selhtml@.com.fr


</body>
</html>
