<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>SELFHTML: HTML/XHTML / Cadres / Cadres pour faciliter la mise en page</title>
<link rel="stylesheet" type="text/css" href="../../src/selfhtml.css">
<meta name="description"    content="Ce qu'il faut savoir pour employer des cadres dans un projet.">
<meta name="keywords"       content="SELFHTML, HTML, XHTML, Frames, Framesets, cadres, jeu de cadres, effets de vitrines">
<meta name="author"         content="Stefan M&uuml;nz, selfhtml@teamone.de">
<meta http-equiv="content-type" content="text/html; charset=ISO-8859-1">
<meta name="DC.Publisher"   content="Serge Fran&ccedil;ois, selfhtml@selfhtml.com.fr">
<meta name="DC.Date"        content="2003-01-27T08:00+00:00">
<meta name="DC.Identifier"  content="http://selfhtml.selfhtml.com.fr/html/frames/misesenpage.htm">
<meta name="DC.Language"    content="fr">
<meta name="DC.Rights"      content="../../editorial/copyright.htm">
<meta name="DC.Date.Create" content="2003-01-27T08:00+00:00">
<meta name="SELF.Version"   content="1">
<meta name="SELF.Pagetype"  content="Information">
<meta name="SELF.Path"      content="SELFHTML == ../../index.htm // HTML/XHTML == ../index.htm // Cadres == index.htm">
<link rel="stylesheet" type="text/css" href="../../src/selfhtml.css">
<!-- Matomo -->
<script type="text/javascript">
  var _paq = window._paq = window._paq || [];
  /* tracker methods like "setCustomDimension" should be called before "trackPageView" */
  _paq.push(['trackPageView']);
  _paq.push(['enableLinkTracking']);
  (function() {
    var u="//matomo.boitasite.com/";
    _paq.push(['setTrackerUrl', u+'matomo.php']);
    _paq.push(['setSiteId', '1']);
    var d=document, g=d.createElement('script'), s=d.getElementsByTagName('script')[0];
    g.type='text/javascript'; g.async=true; g.src=u+'matomo.js'; s.parentNode.insertBefore(g,s);
  })();
</script>
<!-- End Matomo Code -->
</head>

<body bgcolor="#FFFFFF" text="#000000" link="#AA5522" vlink="#772200" alink="#000000">

<table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr><td bgcolor="#FFEEDD" class="nav"><a class="an" name="top"><img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"></a> <a href="../../index.htm"><b>SELFHTML</b></a>/<a href="../../navigation/index.htm" target="_parent">Aides &agrave; la navigation</a> <img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="../index.htm"><b>HTML/XHML</b></a> <img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="index.htm"><b>Cadres</b></a></td>
</tr></table>

<table cellpadding="4" cellspacing="0" border="0" width="100%">

<tr>
<td bgcolor="#EEEEEE" class="doc" width="110"><img src="../../src/logo.gif" width="106" height="109" border="0" alt="SELFHTML"></td>
<td bgcolor="#EEEEEE" class="doc" valign="bottom" width="100%"><h2>Cadres pour faciliter la mise en page</h2></td>
</tr>

<tr>
<td bgcolor="#EEEEEE" class="doc" valign="top" align="center">
<img src="../../src/docx.gif" width="30" height="20" vspace="6" border="0" alt="Page d'information: vue d'ensemble">
</td>

<td bgcolor="#FFFFFF" valign="top" nowrap>
<p>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#possibilites_emploi"><b>Possibilit&eacute;s d'application judicieuse pour les cadres</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#vitrine"><b>Effets de vitrine d&eacute;loyaux</b></a><br>
</p>
</td>
</tr>

<tr><td colspan="2" bgcolor="#EEEEEE" class="doc">&#160;<a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&nbsp;</td></tr>
</table>




<h2 class="Sh2"><a class="an" name="possibilites_emploi">Possibilit&eacute;s d'application judicieuse pour les cadres</a></h2>


<p>Les cadres - r&eacute;partition de l'information sur plusieurs fen&ecirc;tres
ind&eacute;pendantes l'une de l'autre - sont un outil fascinant mais aussi un outil
avec lequel on peut commettre beaucoup de b&eacute;vues. La r&egrave;gle g&eacute;n&eacute;rale est la suivante: Toute utilisation de cadres doit &ecirc;tre justifi&eacute;e. Ce qui signifie: l'utilisation de la technique des cadres doit appara&icirc;tre judicieuse et avantageuse &agrave; l'utilisateur. Celui qui utilise des cadres &agrave; des fins purement personnelles doit s'attendre &agrave; &ecirc;tre consid&eacute;r&eacute; comme un novice HTML passionn&eacute; de technique plut&ocirc;t que comme un concepteur Web confirm&eacute;.</p>

<p>La raison en est que les cadres ont des inconv&eacute;nients incontestables:</p>
<ul>
<li><b>probl&egrave;mes pour les navigateurs ne supportant pas les cadres:</b><br>
Les cadres ne sont pas affich&eacute;s par tous les navigateurs WWW. &Eacute;tant donn&eacute; que la structure globale d'un projet bas&eacute; sur les cadres diff&egrave;re tr&egrave;s   sensiblement de la structure d'un projet traditionnel, un fournisseur de cadres ne peut proposer aucune alternative &agrave; ces utilisateurs qui ne peuvent afficher les cadres ou bien une alternative &agrave; deux voies qui est tr&egrave;s compliqu&eacute;e &agrave; r&eacute;aliser et &agrave; entretenir.</li>
<li><b>cadres et r&eacute;solution d'&eacute;cran</b><br>
Pour les &eacute;crans plus petits par exemple pour les notebooks (ordinateur portatif),  plus de deux fen&ecirc;tres cadres sont d&eacute;j&agrave; beaucoup demander pour l'&#339;il et la clart&eacute;.</li>
<li><b>temps de chargement</b><br>
Les cadres exigent une communication HTTP plus importante entre le navigateur et le serveur. Sur le WWW cela peut, quand les circonstances sont d&eacute;favorables amener facilement des temps de chargement plus longs.</li>
<li><b>liaisons probl&eacute;matiques &agrave; des sous pages</b><br>
Il est th&eacute;oriquement possible, bien que ce ne soit pas la plupart du temps
dans l'esprit du fournisseur, que d'autres utilisateurs mettent un signet ou
posent un lien sur un fichier HTML qui fasse partie d'un jeu de cadres. C'est  irritant dans de nombreux cas. Ainsi par exemple on emp&ecirc;che d'autres   fournisseurs d'informations de mettre un lien &agrave; une page d&eacute;termin&eacute;e dans un autre projet dans un contexte d'information donn&eacute;.</li>
</ul>

<p>Dans les cas suivants, la mise en oeuvre de cadres est &agrave; pr&eacute;coniser pour  l'utilisateur:</p>
<ul>
<li><b>pour changer rapidement entre plusieurs unit&eacute;s d'information</b><br>
  Dans ce cas le cadre contient un index important avec des liens aux
  diff&eacute;rentes pages d'information pouvant &ecirc;tre cliqu&eacute;s ; ces pages sont alors affich&eacute;es dans un autre cadre fixe. L' &quot;index du contenu&quot; reste alors affich&eacute; &agrave; tout moment et l'utilisateur peut &agrave; chaque instant y choisir un nouveau lien. Cela &eacute;vite &agrave; l'utilisateur le retour incessant des pages d'information &agrave; l'index.<br>
<i>Exemple:</i> Un fournisseur d'appartements de vacances peut faire une liste de liens des appartements qu'il a &agrave; louer et afficher dans un autre  cadre fixe l'appartement choisi.</li>
<li><b>pour l'affichage permanent de liens de direction &agrave; l'&eacute;chelle du projet</b><br>
Pour des projets importants dans lesquels l'impression d'&ecirc;tre &quot;perdu
dans l'hyperespace&quot; menace l'utilisateur, il est judicieux de proposer dans un  cadre s&eacute;par&eacute; des liens de direction toujours valables, par exemple &agrave; la page d'accueil, au niveau logique imm&eacute;diatement sup&eacute;rieur, &agrave; l'index des mots cl&eacute;s ou dans la base de donn&eacute;es de recherche. Pour les petits projets constitu&eacute;s seulement d'une poign&eacute;e de pages, cette technique semble alors exag&eacute;r&eacute;e et donne &agrave; l'utilisateur une id&eacute;e fausse de la taille du projet . Quand l'utilisateur dans un tel cas se rendra compte apr&egrave;s   quelques cliquements de souris, qu'il a d&eacute;j&agrave; tout vu, il n'en sera que plus d&eacute;&ccedil;u.<br>
<i>exemple:</i> Un journal qui propose sur le WWW une grande archive avec des
  articles plus anciens, pourrait &agrave; l'aide de la technique des cadres proposer
  des liens permanents &agrave; un index d'acc&egrave;s tri&eacute; par th&egrave;me, &agrave; un index des mots cl&eacute;s, et &agrave; une base de donn&eacute;es de recherche en texte clair pour les diff&eacute;rents articles.</li>
<li><b>pour afficher simultan&eacute;ment des informations &agrave; comparer</b><br>
L'hypertexte ne consiste pas seulement &agrave; mettre &agrave; la disposition de
  l'utilisateur de nouvelles informations sur un simple cliquement de souris, mais aussi d'offrir la possibilit&eacute; &agrave; l'utilisateur de collationner lui m&ecirc;me les informations de fa&ccedil;on &agrave; pouvoir mieux les comparer entre elles et &agrave; ce qu'il puisse en tirer des conclusions ou prendre des d&eacute;cisions. Pour cela la technique des cadres est particuli&egrave;rement bien appropri&eacute;e &eacute;tant donn&eacute; qu'elle permet d'afficher simultan&eacute;ment sur simple d&eacute;sir de l'utilisateur des informations distinctes sauvegard&eacute;es s&eacute;par&eacute;ment &agrave; des endroits diff&eacute;rents .<br>
<i>exemple:</i> Une union de conseil au consommateur pourrait dans un jeu de quatre cadres proposer dans deux d'entre elles deux index de liens aux tests de produits construits de la m&ecirc;me fa&ccedil;on. Dans le troisi&egrave;me cadre le test du produit que l'utilisateur a choisi dans les liens du premier cadre serait affich&eacute;, dans le quatri&egrave;me cadre le test du produit que l'utilisateur a choisi dans les liens du deuxi&egrave;me cadre serait affich&eacute;. Par ce moyen, l'utilisateur peut comparer directement entre eux les produits test&eacute;s qu'il choisit. La condition en est bien s&ucirc;r que tous les tests de produits aient une construction homog&egrave;ne et un sch&eacute;ma d'estimation unitaire pour permettre des comparaisons directes.</li>
<li><b>pour une structure de pages particuli&egrave;rement artistique</b><br>
Dans ce cas l'utilisateur doit reconna&icirc;tre au premier coup d'&#339;il que
  la technique des cadres veut soutenir une certaine expression artistique.</li>
</ul>

<p>Lors de l'utilisation de cadres il y a, plus encore que pour les &quot;simples&quot; pages, un risque d'outrance dans la pr&eacute;sentation. Il vous faut absolument faire attention, lorsque vous utilisez des cadres, &agrave; ce que les couleurs des contenus des diff&eacute;rents cadres s'harmonisent toutes les unes avec les autres. Cela vaut &eacute;galement pour d'autres propri&eacute;t&eacute;s visuelles telles que les polices, les tailles de police etc. Un cadre de navigation ne doit pas avoir d&eacute;sesp&eacute;r&eacute;ment un &quot;autre&quot; aspect qu'un cadre affichant un contenu pour que chaque utilisateur puisse remarquer qu'il s'agit de cadres. Les contrastes entre les cadres ne doivent pas heurter les r&egrave;gles d'une pr&eacute;sentation globale homog&egrave;ne.</p>




<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&nbsp;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="vitrine">Effets de vitrine d&eacute;loyaux</a></h2>

<p>&Agrave; l'aide de cadres il est aussi possible de repr&eacute;senter d'autres pages Web dans le cadre de son propre projet Web. Ce n'est pourtant pas sans probl&egrave;me et dans la plupart des cas d&eacute;loyal. Car de cette fa&ccedil;on des pages Web sont d&eacute;chues &agrave; l'&eacute;talage dans le propre projet. Ce n'est pas un geste &eacute;l&eacute;gant &agrave; l'&eacute;gard des autres fournisseurs de pages car il laisse croire &agrave; l'utilisateur que le  projet en question est un &quot;m&eacute;ga-projet&quot;. C'est &eacute;galement juridiquement dangereux &eacute;tant donn&eacute; que vous pouvez facilement &ecirc;tre alors poursuivi pour plagiat si vous vous &quot;appropriez&quot; des contenus &eacute;trangers.</p>

<p>En outre il peut aussi arriver que dans un cadre une page d'un fournisseur de pages quelconque qui de son c&ocirc;t&eacute; se sert de cadres soit affich&eacute;e. On parvient alors &agrave; un effet fractal irritant de cadres sur l'&eacute;cran de l'utilisateur.</p>

<p>Si vous posez des liens &agrave; d'autres pages WWW dans votre projet employant les cadres, vous devez choisir entre les possibilit&eacute;s suivantes:</p>
<ul>
<li><b>r&eacute;tablir l'&eacute;tat des fen&ecirc;tres d'origine</b><br>
Posez le lien de fa&ccedil;on &agrave; ce que l'utilisateur quitte votre jeu de cadres d&eacute;fini et retrouve son &eacute;cran dans l'&eacute;tat o&ugrave; il &eacute;tait avant l'appel de votre projet. Vous le faites en pla&ccedil;ant des liens du genre<br>
<code>&lt;a href=&quot;http://...&quot; target=&quot;_parent&quot;&gt;texte du lien&lt;/a&gt;</code></li>
<li><b>proposer un double lien</b><br>
Ainsi vous laissez l'utilisateur d&eacute;cider comment il veut avoir la page
&eacute;trang&egrave;re affich&eacute;e. Notez les deux liens qui ont la m&ecirc;me cible directement l'un sous l'autre ou &agrave; c&ocirc;t&eacute; de l'autre comme par exemple<br>
<code>&lt;a href=&quot;http://...&quot; target=&quot;bas_droite&quot;&gt;Afficher la page &eacute;trang&egrave;re dans le cadre en bas &agrave; droite&lt;/a&gt;&lt;br&gt;</code><br>
<code>&lt;a href=&quot;http://...&quot; target=&quot;_parent&quot;&gt;Afficher la page &eacute;trang&egrave;re en plein &eacute;cran&lt;/a&gt;</code></li>
<li><b>faire remarquer &agrave; l'utilisateur qu'il peut modifier les cadres</b><br>
Si vous ne voulez proposer aucune des deux autres possibilit&eacute;s, vous devez au
  moins autoriser le re-dimensionnement des cadres par l'utilisateur et
  lui faire remarquer explicitement qu'il dispose de cette possibilit&eacute;. Pour
  autoriser la modification de la taille du cadre par l'utilisateur,
  renoncez simplement &agrave; l'attribut <code>&quot;noresize&quot;</code> dans le rep&egrave;re <code>&lt;frame&gt;</code>.
</ul>

<p>&Agrave; l'aide de JavaScript il est possible d' <img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="../../javascript/exemples/affichage_page.htm"><b>emp&ecirc;cher
l'affichage de ses propres pages en jeu de cadres</b></a>.</p>








<table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr><td colspan="2" bgcolor="#EEEEEE" class="doc">
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a>
</td></tr>

<tr><td bgcolor="#EEEEEE" class="doc" align="right"><a href="../multimedia/objets.htm"><img src="../../src/suivant.gif" width="10" height="10" border="0" hspace="10" alt="page suivante"></a></td>
<td bgcolor="#FFFFFF"><img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information"> <a href="../multimedia/objets.htm"><b>Incorporer des objets</b></a>
</td></tr>

<tr>
<td bgcolor="#EEEEEE" class="doc" align="right"><a href="incorporees.htm"><img src="../../src/precedent.gif" width="10" height="10" border="0" hspace="10" alt="page pr&eacute;c&eacute;dente"></a></td>
<td bgcolor="#FFFFFF" width="100%"><img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information"> <a href="incorporees.htm"><b>Cadres incorpor&eacute;s</b></a>
</td>

</tr>
<tr><td colspan="2" bgcolor="#EEEEEE" class="doc">&nbsp;</td></tr>
</table>

<table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr><td bgcolor="#FFEEDD" class="nav"><a class="an" name="bottom"><img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"></a> <a href="../../index.htm"><b>SELFHTML</b></a>/<a href="../../navigation/index.htm" target="_parent">Aides &agrave; la navigation</a> <img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="../index.htm"><b>HTML/XHML</b></a> <img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="index.htm"><b>Cadres</b></a></td>
</tr></table>

<p>&copy; 2001 Stefan M&uuml;nz / &copy; 2003 Traduction <img src="../../src/courriel.gif" width="15" height="10" border="0" alt="Adresse &eacute;lectronique">&nbsp;<a href="mailto:13405@free.fr">Serge Fran&ccedil;ois, 13405@free.fr</a><br><img src="../../src/courriel.gif" width="15" height="10" border="0" alt="Adresse &eacute;lectronique">&nbsp;<a href="mailto:selfhtml@selfhtml.com.fr">selfhtml@selfhtml.com.fr</a></p>

</body>
</html>
