<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>SELFHTML: XML/DTD / D&eacute;finitions de type de document (DTD) / G&eacute;n&eacute;ralit&eacute;s sur les DTD</title>
<link rel="stylesheet" type="text/css" href="../../src/selfhtml.css">
<meta name="description"    content="Quel est l'objectif des d&eacute;finitions de type de document en XML.">
<meta name="keywords"       content="SELFHTML, XML, DTD, DTDs, Document Type Definition, D&eacute;finitions de type de document, D&eacute;finition de type de document">
<meta name="author"         content="Stefan M&uuml;nz, selfhtml@teamone.de">
<meta http-equiv="content-type" content="text/html; charset=ISO-8859-1">
<meta name="DC.Publisher"   content="Serge Fran&ccedil;ois, selfhtml@selfhtml.com.fr">
<meta name="DC.Date"        content="2003-01-27T08:00+00:00">
<meta name="DC.Identifier"  content="http://selfhtml.selfhtml.com.fr/xml/dtd/generalites.htm">
<meta name="DC.Language"    content="fr">
<meta name="DC.Rights"      content="../../editorial/copyright.htm">
<meta name="DC.Date.Create" content="2003-01-27T08:00+00:00">
<meta name="SELF.Version"   content="1">
<meta name="SELF.Pagetype"  content="Information">
<meta name="SELF.Path"      content="SELFHTML == ../../index.htm // XML/DTD == ../index.htm // D&eacute;finitions de type de document (DTD) == index.htm">
<!-- Matomo -->
<script type="text/javascript">
  var _paq = window._paq = window._paq || [];
  /* tracker methods like "setCustomDimension" should be called before "trackPageView" */
  _paq.push(['trackPageView']);
  _paq.push(['enableLinkTracking']);
  (function() {
    var u="//matomo.boitasite.com/";
    _paq.push(['setTrackerUrl', u+'matomo.php']);
    _paq.push(['setSiteId', '1']);
    var d=document, g=d.createElement('script'), s=d.getElementsByTagName('script')[0];
    g.type='text/javascript'; g.async=true; g.src=u+'matomo.js'; s.parentNode.insertBefore(g,s);
  })();
</script>
<!-- End Matomo Code -->
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#AA5522" vlink="#772200" alink="#000000">

<table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr>
<td bgcolor="#FFEEDD" class="nav"><a class="an" name="top"><img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"></a> <a href="../../index.htm"><b>SELFHTML</b></a>/<a href="../../navigation/index.htm" target="_parent">Aides &agrave; la navigation</a> <img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="../index.htm"><b>XML/DTD</b></a> <img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="index.htm"><b>D&eacute;finitions de type de document (DTD)</b></a></td>
</tr>
</table><table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr>
<td bgcolor="#EEEEEE" class="doc" width="110"><img src="../../src/logo.gif" width="106" height="109" border="0" alt="SELFHTML"></td>
<td bgcolor="#EEEEEE" class="doc" valign="bottom" width="100%"><h2>G&eacute;n&eacute;ralit&eacute;s sur les DTD</h2>
<tr>
<td bgcolor="#EEEEEE" class="doc" valign="top" align="center">
<img src="../../src/docx.gif" width="30" height="20" vspace="6" border="0" alt="Page d'information: vue d'ensemble">
</td>
<td bgcolor="#FFFFFF" valign="top" nowrap>
<p>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#indispensable"><b>Quand une DTD est-elle n&eacute;cessaire?</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#propres_existantes"><b>Utiliser ses propres DTD ou des DTD existantes?</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#interne_externe"><b>Utiliser des DTD internes ou des DTD dans un fichier  externe?</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#lieu_sauvegarde"><b>Endroit o&ugrave; sauvegarder les DTD dans des fichiers s&eacute;par&eacute;s</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#concept_nom"><b>Concept de nom pour une DTD</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#analyse_donnees"><b>Analyse de donn&eacute;es pr&eacute;paratoire &agrave; la conception d'une DTD</b></a><br>
</p>
</td>
</tr><tr><td colspan="2" bgcolor="#EEEEEE" class="doc">&#160;<a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;</td></tr>
</table>



<h2 class="Sh2"><a class="an" name="indispensable">Quand une DTD est-elle n&eacute;cessaire?</a></h2>

<p>Vous avez toujours besoin d'une DTD quand vous d&eacute;sirez des donn&eacute;es XML qui ne soient pas seulement <img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="../regles/conception.htm#conformite"><b>conformes</b></a>, mais qui soient &eacute;galement  <img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="../regles/conception.htm#valide_complet"><b>valides</b></a>. Car &quot;valide&quot; signifie: pouvant &ecirc;tre valid&eacute;es au vu d'une DTD.</p>

<p>Il n'est pas indispensable qu'un fichier XML soit &quot;valide&quot; et qu'il poss&egrave;de une DTD correspondante. Le crit&egrave;re de validit&eacute; est en fin de compte la &quot;grande &eacute;cole&quot; de XML et l'&eacute;tat id&eacute;al. Dans de nombreux cas pratiques il n'est pas du tout n&eacute;cessaire d'avoir une DTD, par exemple quand on a juste besoin d'un format de donn&eacute;es correct qui n'est cependant pas interpr&eacute;t&eacute; par le moindre  <img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="../intro.htm#parser"><b>analyseur syntaxique</b></a>, qui teste toujours la validit&eacute; au vu d'une DTD. Si donc vous ne voulez par exemple que sauvegarder les donn&eacute;es sous une forme conforme &agrave; XML pour les traiter avec un  <img src="../../src/chap.gif" width="15" height="13" border="0" alt="Chapitre: vue d'ensemble">&nbsp;<a href="../../cgiperl/index.htm"><b>script CGI</b></a>, qui traduit le code XML et ses commandes propres en code HTML pour le navigateur, alors vous n'avez pas besoin &agrave; vrai dire de DTD et vous pouvez omettre la d&eacute;claration de type de document.</p>

<p>Cependant, la cr&eacute;ation d'une DTD est judicieuse quand le temps le permet. Car la DTD est, - m&ecirc;me quand les donn&eacute;es ne sont pas test&eacute;es quant &agrave; leur validit&eacute; pendant le processus de traitement - dans tous les cas une documentation sur les pr&eacute;visions &agrave; atteindre pour les donn&eacute;es. En particulier quand les stocks de donn&eacute;es sont conserv&eacute;s sur de longues p&eacute;riodes et manipul&eacute;es ou modifi&eacute;es par des personnes diff&eacute;rentes, une DTD est un document de base important pour les normes assurant l'exactitude et l'homog&eacute;n&eacute;it&eacute; des donn&eacute;es.</p>

<p>M&ecirc;me en regard des traitements multiples des donn&eacute;es, une DTD est pr&eacute;cieuse (&quot;publication multiple &agrave; partir d'une seule et m&ecirc;me source&quot;). Car ce n'est que lorsque toutes les pr&eacute;cautions sont prises pour que toutes les r&egrave;gles d&eacute;finies soient respect&eacute;es lors de la saisie des donn&eacute;es, que des programmes peuvent traiter ces donn&eacute;es sans risque de perte.</p>


<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="propres_existantes">Utiliser ses propres DTD ou des DTD existantes?</a></h2>

<p>En g&eacute;n&eacute;ral, il est toujours avantageux de s'en tenir &agrave; des standards d&eacute;j&agrave; existants. XML permet certes la cr&eacute;ation de ses propres DTD mais il y a toujours le danger que la roue soit &agrave; nouveau invent&eacute;e. Avant de prendre la d&eacute;cision de d&eacute;velopper une nouvelle DTD personnelle importante,  vous devez vous faire une id&eacute;e des DTD publiques accessibles d&eacute;j&agrave; existantes. Un r&eacute;capitulatif des langages XML connus d&eacute;velopp&eacute;s par le consortium W3 peut &ecirc;tre consult&eacute; dans la partie sur les <img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="../intro.htm#langages_standard"><b>Langages standard XML importants: SVG, MathML, SMIL, RDF, WML</b></a>.</p>

<p>Mais m&ecirc;me lorsque vous d&eacute;veloppez vos propres DTD, vous ne devez pas d&eacute;velopper une DTD enti&egrave;rement nouvelle avec tout ce qui s'en suit pour chaque application. Le concept des DTD pr&eacute;voit &agrave; vrai dire la possibilit&eacute; d'utiliser les DTD modulaires. Ce qui signifie que vous pouvez vous &eacute;crire des DTD pour certaines t&acirc;ches et les incorporer ensuite dans d'autres DTD. Il est ainsi possible d'&eacute;crire des DTD &quot;all&eacute;g&eacute;es&quot; qui contiendront pourtant des concepts de donn&eacute;es tr&egrave;s complexes parce qu'elles se composent d'autres DTD &eacute;l&eacute;mentaires.  Dans une entreprise, il est par exemple judicieux de r&eacute;fl&eacute;chir &agrave; ces DTD modulables. Les r&eacute;flexions &agrave; faire &agrave; ce sujet, ressemblent &agrave; celles qu'il faut faire pour la cr&eacute;ation de grandes bases de donn&eacute;es relationnelles. Il s'agit l&agrave; en fin de compte de normalisation des donn&eacute;es.<br>
Dans la partie traitant des <img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="entites.htm#modulare_dtds"><b>DTD modulaires &agrave; l'aide d'entit&eacute;s</b></a> le principe pour incorporer des DTD dans d'autres DTD est d&eacute;crit.</p>

<p>Avec les DTD connues publiques, l'avantage est que la plupart du temps existent d&eacute;j&agrave; des logiciels de traitement par exemple des scripts de transcription en HTML, Postscript ou bien MIF. Les langages XML comme SVG par exemple peuvent entre-temps &ecirc;tre trait&eacute;s par des programmes graphiques connus. Avec le d&eacute;veloppement d'une DTD ce n'est la plupart du temps pas le cas - en r&egrave;gle g&eacute;n&eacute;rale on a besoin de plus de logiciels qu'un simple <img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="../intro.htm#parser"><b>analyseur syntaxique</b></a>, qui ne fait que v&eacute;rifier les donn&eacute;es &agrave; l'exclusion de toute autre chose. Vous avez tout au moins besoin en g&eacute;n&eacute;ral de feuilles de style ou de scripts pour la <img src="../../src/chap.gif" width="15" height="13" border="0" alt="Chapitre: vue d'ensemble">&nbsp;<a href="../representation/index.htm"><b>repr&eacute;sentation de donn&eacute;es XML</b></a>. La somme de travail qui est li&eacute;e &agrave; des DTD importante est tr&egrave;s vite comparable &agrave; celle qui est li&eacute;e au d&eacute;veloppement d'une solution logicielle sur mesure.</p>


<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="interne_externe">Utiliser des DTD internes ou des DTD dans un fichier  externe?</a></h2>

<p>Il faut privil&eacute;gier les DTD internes pour des petits projets dont les donn&eacute;es ne se trouvent que dans ce seul et unique fichier. Pour des projets plus importants pour lesquels plusieurs ou de nombreux fichiers ase r&eacute;f&egrave;rent &agrave; une DTD commune, vous devez &agrave; tout prix cr&eacute;er une DTD externe.</p>



<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="lieu_sauvegarde">Endroit o&ugrave; sauvegarder les DTD dans des fichiers s&eacute;par&eacute;s</a></h2>

<p>De la m&ecirc;me fa&ccedil;on que certains pr&eacute;conisent des structures de r&eacute;pertoires simples et d'autres des structures de r&eacute;pertoires fortement imbriqu&eacute;s, ils y a les partisans qui s&eacute;parent les donn&eacute;es et les DTD et les autres qui veulent tout regrouper. On peut certainement trouver des arguments pour les deux points de vue..</p>

<p>Il est important de se poser la question si l'acc&egrave;s &agrave; la  DTD ne se fera qu'&agrave; partir de votre ordinateur ou bien d'un r&eacute;seau local, ou bien si des utilisateurs devront mentionner cette DTD dans leurs donn&eacute;es XML, par exemple par une adresse HTTP. Dans ce dernier cas la DTD doit &ecirc;tre sauvegard&eacute;e dans une arborescence de r&eacute;pertoires que le serveur Web utilise comme &quot;racine pour les documents&quot;. Les DTD sauvegard&eacute;es dans des fichiers s&eacute;par&eacute;s ont l'extension <var>.dtd</var>.</p>





<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="concept_nom">Concept de nom pour une DTD</a></h2>

<p>Pour la cr&eacute;ation d'une DTD, vous devez attribuer une quantit&eacute; de noms - pour les <img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="elements.htm"><b>&eacute;l&eacute;ments</b></a>, pour les <img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="attributs.htm"><b>attributs</b></a> et pour les <img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="entites.htm"><b>entit&eacute;s</b></a>. Abstraction faite que tous les noms attribu&eacute;s doivent satisfaire aux <img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="regles_traitement.htm#namen"><b>r&egrave;gles pour les noms</b></a>, il est de bon ton de r&eacute;fl&eacute;chir auparavant &agrave; un concept de nom . Car m&ecirc;me ai les utilisateurs qui veulent travailler avec une DTD disposent pour travailler sur leurs donn&eacute;es d'un environnement Wysiwyg, ils seront pourtant confront&eacute;s aux noms d'&eacute;l&eacute;ments et d'attributs &agrave; leur disposition.</p>

<p>Pour les DTD qui doivent &ecirc;tre utilis&eacute;es sur le plan international, il est normalement pr&eacute;f&eacute;rable de n'attribuer que des d&eacute;signations anglaises, donc par exemple <code>chapter</code> au lieu de  <code>chapitre</code> ou bien <code>name</code> au lieu de <code>nom</code>.</p>

<p>Quelquefois il y a aussi des raisons de donner dans les noms, les noms d'auteur, de service, de firme, par exemple <code>marketing-statement</code> ou bien <code>developer-statement</code>.</p>

<p>Pour des quantit&eacute;s de donn&eacute;es tr&egrave;s importantes, la longueur des noms peut aussi jouer un r&ocirc;le. Ainsi la diff&eacute;rence entre les notations <code>&lt;carteidentificationpersonnel&gt;...&lt;/carteidentificationpersonnel&gt;</code> et <code>&lt;cip&gt;...&lt;/cip&gt;</code> 50 Byte, ce qui pour 1.000.000 d'enregistrements est multipli&eacute; en cons&eacute;quence. Des noms plus longs ont cet avantage par rapport aux abr&eacute;viations d'&ecirc;tre plus compr&eacute;hensibles. Les abr&eacute;viations doivent toujours &ecirc;tre comment&eacute;es, par exemple dans la DTD sous forme de <img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="../regles/valattrrepere.htm#commentaires"><b>commentaires</b></a>.</p>

<p>L'attribution de nom doit suivre un concept homog&egrave;ne. Ce n'est par exemple pas un bon style d'utiliser des majuscules et des minuscules dans quelques &eacute;l&eacute;ments et de ne pas le faire dans d'autres, par exemple <code>Service</code>, mais <code>responsable</code>. &Eacute;tant donn&eacute; que XML diff&eacute;rencie majuscules et minuscules, l'attribution de noms doit suivre une variante d'un bout &agrave; l'autre.</p>


<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="analyse_donnees">Analyse de donn&eacute;es pr&eacute;paratoire &agrave; la conception d'une DTD</a></h2>

<p>La cr&eacute;ation d'une DTD est - bien qu'il ne s'agisse pas de &quot;programmation&quot; au sens de cr&eacute;ation de proc&eacute;dures - malgr&eacute; tout comparable &agrave; du d&eacute;veloppement de logiciels. Pour des projets logiciels qui d&eacute;passent de simples petits scripts de travail, il n'est pas raisonnable d'y programmer sans rel&acirc;che pour finir par remarquer en fin de compte qu'on y a trop peu r&eacute;fl&eacute;chi et pas assez pr&eacute;vu de possibilit&eacute;s d'extension. Il en va de m&ecirc;me pour la cr&eacute;ation d'une conception de donn&eacute;es. Normalement, les DTD sont cr&eacute;&eacute;es pour r&eacute;gir une &quot;classe de documents&quot;. C'est pourquoi la DTD doit &ecirc;tre suffisamment souple pour satisfaire aux exigences actuelles et futures de cette classe de documents.</p>

<p>La premi&egrave;re &eacute;tape doit consister &agrave; examiner et &agrave; analyser les donn&eacute;es existantes destin&eacute;es &agrave; &ecirc;tre sauvegard&eacute;es &agrave; l'avenir sous la forme XML. Comment les structures de donn&eacute;es typiques sont-elles construites?
Existe-t il par exemple dans une s&eacute;rie de manuels une suite de chapitre incontournable et qui revient sans arr&ecirc;t? Qu'est-ce qui n'est pas homog&egrave;ne mais peut le devenir? y a-t-il par exemple, des manuels dans lesquels 5 niveaux de titre sont utilis&eacute;s et d'autres qui n'en utilisent que 3?
Quels points de rep&egrave;re invariables existent? Y a-t il par exemple des sections du manuel avec une construction fixe, par exemple une description des fonctions en introduction suivie d'une description des proc&eacute;dures puis de remarques? Une analyse des donn&eacute;es existantes permet d'acc&eacute;der &agrave; la conception des donn&eacute;es.</p>

<p>Quand les donn&eacute;es existantes sont &eacute;valu&eacute;es, on doit aussi r&eacute;fl&eacute;chir de quelle mani&egrave;re ces donn&eacute;es pourront plus tard &ecirc;tre modifi&eacute;es ou &eacute;tendues. Est-il par exemple possible pour un type de manuel qui jusqu'ici ne d&eacute;crivait que du mat&eacute;riel, puisse aussi &agrave; l'avenir servir &agrave; la description de logiciels? Quelles en seraient les cons&eacute;quences pour la conception des donn&eacute;es? Quels &eacute;l&eacute;ments de donn&eacute;s doivent en pareil cas &eacute;galement &ecirc;tre pries en compte? Personne ne peut certes pr&eacute;voir compl&egrave;tement l'avenir mais une DTD devrait malgr&eacute; tout prendre en compte toutes les &eacute;ventualit&eacute;s possibles. Car si l'on attend que nombre de donn&eacute;es bas&eacute;es sur une DTD soient cr&eacute;&eacute;es, il peut &ecirc;tre difficile de restructurer cette DTD.</p>

<p>Pour le d&eacute;veloppement de logiciels, il s'est instaur&eacute; de d&eacute;crire de diff&eacute;rentes mani&egrave;res la fa&ccedil;on de fonctionner du logiciel pr&eacute;vu avant m&ecirc;me d'entreprendre la codification. Pour cela, il existe des proc&eacute;d&eacute;s tels que les descriptions de fonctions, les diagrammes de d&eacute;roulement etc... Il existe des approches g&eacute;n&eacute;rales et plus fines. Pour la cr&eacute;ation de DTD se sont d&eacute;velopp&eacute;es au fil du temps des m&eacute;thodes analogues. Le d&eacute;veloppement d'une DTD est constitu&eacute;e entre autres des phases suivantes:</p>
<ul>
<li>Les <b>objectifs du projet</b>, pour lesquels la DTD doit &ecirc;tre d&eacute;velopp&eacute;e doivent &ecirc;tre exprim&eacute;s. Ainsi par exemple, possibilit&eacute; de valider des documents, possibilit&eacute; d'une publication multiple, meilleure possibilit&eacute; de convertir etc...</li>
<li>Les <b>exigences des documents</b> qui doivent se baser sur la DTD &agrave; d&eacute;velopper doivent &ecirc;tre examin&eacute;es soigneusement. Les questions suivantes peuvent aider &agrave; y parvenir:<br>
Quelles unit&eacute;s d'information fondamentales ces documents doivent contenir?<br>
Dans quels groupes logiques ces unit&eacute;s d'information peuvent &ecirc;tre r&eacute;parties?<br>
&Agrave; quel mod&egrave;les de donn&eacute;es d&eacute;j&agrave; existants, le mod&egrave;le &agrave; cr&eacute;er est-il comparable?</li>
<li>Les <b>exigences de la DTD</b> doivent &ecirc;tre examin&eacute;es soigneusement. Les questions suivantes peuvent aider &agrave; y parvenir:<br>
Quelles structures de donn&eacute;es sont n&eacute;cessaires?<br>
Quelles donn&eacute;es sont obligatoires et quelles donn&eacute;es facultatives?<br>
Quelles structures doivent &ecirc;tre invariables et appara&icirc;tre dans le m&ecirc;me ordre?<br>
Quelles donn&eacute;es font partie du contenu des &eacute;l&eacute;ments, quelles autres des propri&eacute;t&eacute;s (attributs)?<br>
Pour de telles questions concernant la conception des donn&eacute;es, on peut faire appel &agrave; l'exp&eacute;rience et aux connaissances des d&eacute;veloppeurs de logiciels mais aussi &agrave; celles des utilisateurs du document.</li>
<li>L'<b>approche fine de la DTD</b>. En font partie:<br>
le choix des &eacute;l&eacute;ments n&eacute;cessaires &agrave; la DTD,<br>
l'&eacute;laboration des mod&egrave;les d'&eacute;l&eacute;ments et d'attributs pour la hi&eacute;rarchie du document ainsi que des diff&eacute;rents niveaux d'&eacute;l&eacute;ments,<br>
la validation du mod&egrave;le.</li>
<li>La <b>poursuite du d&eacute;veloppement et l'impl&eacute;mentation de la DTD</b>. La d&eacute;cision doit &ecirc;tre prise ici, si et comment la DTD doit &ecirc;tre modulaire (r&eacute;partie sur plusieurs DTD), tout comme la question de savoir comment apr&egrave;s avoir &eacute;t&eacute; introduite, son entretien et son d&eacute;veloppement ult&eacute;rieur se feront. Une documentation suffisante de la DTD (comparable par exemple &agrave; une recommandation du W3 pour un langage comme HTML) fait partie elle-aussi des t&acirc;ches &agrave; remplir.</li>
<li>Le <b>test de la DTD</b>. En font partie la v&eacute;rification de la DTD &agrave; l'aide de documents concrets et r&eacute;alistes, et ainsi la v&eacute;rification des objectifs vis&eacute;s.</li>
</ul>

<p>Pour des DTD plus grandes ou des syst&egrave;mes de DTD group&eacute;es, il peut &ecirc;tre indiqu&eacute; de visualiser les plans de la structure des donn&eacute;es sous une forme simple et orthodoxe. Les d&eacute;pendances hi&eacute;rarchiques entre les &eacute;l&eacute;ments de donn&eacute;es pr&eacute;vus peuvent &ecirc;tre repr&eacute;sent&eacute;s sous forme par exemple d'un  &quot;index du contenu&quot; num&eacute;rot&eacute;, les rapports relationnels entre les donn&eacute;es par des fl&egrave;ches par exemple.</p>

<p>Pour le d&eacute;veloppement de DTD les publications de <var>Eve Maler</var> et de <var>Jeanne El Andaloussi</var> sont aujourd'hui une r&eacute;f&eacute;rence (recherchez ces noms le cas &eacute;ch&eacute;ant avec un moteur de recherche ou chez un service de livres comme <img src="../../src/fr.gif" width="16" height="10" border="0" alt="Page en langue allemande">&nbsp;<a target="_top" href="http://www.amazon.fr/"><b>Amazon</b></a>!).</p>



<table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr><td colspan="2" bgcolor="#EEEEEE" class="doc">
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a>
</td></tr>
<tr><td bgcolor="#EEEEEE" class="doc" align="right"><a href="regles_traitement.htm"><img src="../../src/suivant.gif" width="10" height="10" border="0" hspace="10" alt="page suivante"></a></td>
<td bgcolor="#FFFFFF"><img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information"> <a href="regles_traitement.htm"><b>R&egrave;gles de traitement pour les DTD</b></a>
</td></tr>
<tr>
<td bgcolor="#EEEEEE" class="doc" align="right"><a href="../regles/generales.htm"><img src="../../src/precedent.gif" width="10" height="10" border="0" hspace="10" alt="page pr&eacute;c&eacute;dente"></a></td>
<td bgcolor="#FFFFFF" width="100%"><img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information"> <a href="../regles/generales.htm"><b>R&egrave;gles pour l'&eacute;dition en XML et conventions de noms de fichiers</b></a>
</td>
</tr>
<tr><td colspan="2" bgcolor="#EEEEEE" class="doc">&#160;</td></tr>
</table><table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr>
<td bgcolor="#FFEEDD" class="nav"><a class="an" name="bottom"><img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"></a> <a href="../../index.htm"><b>SELFHTML</b></a>/<a href="../../navigation/index.htm" target="_parent">Aides &agrave; la navigation</a> <img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="../index.htm"><b>XML/DTD</b></a> <img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="index.htm"><b>D&eacute;finitions de type de document (DTD)</b></a></td>
</tr>
</table>

<p>&copy; 2001 Stefan M&uuml;nz / &copy; 2003 Traduction <img src="../../src/courriel.gif" width="15" height="10" border="0" alt="Adresse &eacute;lectronique">&nbsp;<a href="mailto:13405@free.fr">Serge Fran&ccedil;ois, 13405@free.fr</a><br><img src="../../src/courriel.gif" width="15" height="10" border="0" alt="Adresse &eacute;lectronique">&nbsp;<a href="mailto:selfhtml@selfhtml.com.fr">selfhtml@selfhtml.com.fr</a></p>



</body>
</html>
