<html><head><title>text-align</title>
<!-- Matomo -->
<script type="text/javascript">
  var _paq = window._paq = window._paq || [];
  /* tracker methods like "setCustomDimension" should be called before "trackPageView" */
  _paq.push(['trackPageView']);
  _paq.push(['enableLinkTracking']);
  (function() {
    var u="//matomo.boitasite.com/";
    _paq.push(['setTrackerUrl', u+'matomo.php']);
    _paq.push(['setSiteId', '1']);
    var d=document, g=d.createElement('script'), s=d.getElementsByTagName('script')[0];
    g.type='text/javascript'; g.async=true; g.src=u+'matomo.js'; s.parentNode.insertBefore(g,s);
  })();
</script>
<!-- End Matomo Code -->
</head><body bgcolor="#FFFFFF" text="#000000">

<p style="text-align:left; margin-left:1.4cm; margin-right:1.4cm">Le paragraphe de texte que vous &ecirc;tes en train de lire a &eacute;t&eacute; align&eacute; &agrave; gauche avec <b>text-align</b>. De plus une marge de 1.4cm a &eacute;t&eacute; fix&eacute;e, juste pour l'amusement et pour que vous puissiez juger des priorit&eacute;s entre les diff&eacute;rentes mentions de style.<br>
Encore une ligne de texte<br>
Encore une ligne de texte</p>

<p style="text-align:right; margin-left:1.4cm; margin-right:1.4cm">Le paragraphe de texte que vous &ecirc;tes en train de lire a &eacute;t&eacute; align&eacute; &agrave; droite avec <b>text-align</b>. De plus une marge de 1.4cm a &eacute;t&eacute; fix&eacute;e, juste pour l'amusement et pour que vous puissiez voir comment agissent diverses mentions de style combin&eacute;es.<br>
Encore une ligne de texte<br>
Encore une ligne de texte</p>

<p style="text-align:center; margin-left:1.4cm; margin-right:1.4cm">Le paragraphe de texte que vous &ecirc;tes en train de lire a &eacute;t&eacute; centr&eacute; avec <b>text-align</b>. De plus une marge de 1.4cm a &eacute;t&eacute; fix&eacute;e, juste pour l'amusement et pour que vous puissiez voir comment agissent diverses mentions de style combin&eacute;es.<br>
Encore une ligne de texte<br>
Encore une ligne de texte</p>

<p style="text-align:justify; margin-left:1.4cm; margin-right:1.4cm">Le paragraphe de texte que vous &ecirc;tes en train de lire a &eacute;t&eacute; justifi&eacute; avec <b>text-align</b>. De plus une marge de 1.4cm a &eacute;t&eacute; fix&eacute;e, juste pour l'amusement et pour que vous puissiez voir comment agissent diverses mentions de style combin&eacute;es. &Ccedil;a a dur&eacute; longtemps avant que les premiers navigateurs soient en mesure de repr&eacute;senter du texte justifi&eacute;. Avec la version 4 des navigateurs les plus r&eacute;pandus Netscape et Microsoft c'est cependant possible. Pour que le texte justifi&eacute; apparaisse comme tel, ce paragraphe contient ce texte superflu mais justifi&eacute; si ce que vous pouvez lire l'est aussi.</p>

</body></html>
