<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>SELFHTML: Graphisme / Formats graphiques pour pages Web</title>
<link rel="stylesheet" type="text/css" href="../src/selfhtml.css">
<meta name="description"    content="Quels formats graphiques sont particuli&egrave;rement appropri&eacute;s pour les pages Web.">
<meta name="keywords"       content="SELFHTML, Graphisme, graphique en pixels, graphiques vectoriels, JPEG, JPG, GIF, PNG, Lurawave, SVG">
<meta name="author"         content="Stefan M&uuml;nz, selfhtml@teamone.de">
<meta http-equiv="content-type" content="text/html; charset=ISO-8859-1">
<meta name="DC.Publisher"   content="Serge Fran&ccedil;ois, selfhtml@selfhtml.com.fr">
<meta name="DC.Date"        content="2003-01-27T08:00+00:00">
<meta name="DC.Identifier"  content="http://selfhtml.selfhtml.com.fr/graphisme/formats.htm">
<meta name="DC.Language"    content="fr">
<meta name="DC.Rights"      content="../editorial/copyright.htm">
<meta name="DC.Date.Create" content="2003-01-27T08:00+00:00">
<meta name="SELF.Version"   content="1">
<meta name="SELF.Pagetype"  content="Information">
<meta name="SELF.Path"      content="SELFHTML == ../index.htm // Graphisme == index.htm">
<!-- Matomo -->
<script type="text/javascript">
  var _paq = window._paq = window._paq || [];
  /* tracker methods like "setCustomDimension" should be called before "trackPageView" */
  _paq.push(['trackPageView']);
  _paq.push(['enableLinkTracking']);
  (function() {
    var u="//matomo.boitasite.com/";
    _paq.push(['setTrackerUrl', u+'matomo.php']);
    _paq.push(['setSiteId', '1']);
    var d=document, g=d.createElement('script'), s=d.getElementsByTagName('script')[0];
    g.type='text/javascript'; g.async=true; g.src=u+'matomo.js'; s.parentNode.insertBefore(g,s);
  })();
</script>
<!-- End Matomo Code -->
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#AA5522" vlink="#772200" alink="#000000">


<table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr>
<td bgcolor="#FFEEDD" class="nav"><a class="an" name="top"><img src="../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"></a> <a href="../index.htm"><b>SELFHTML</b></a>/<a href="../navigation/index.htm" target="_parent">Aides &agrave; la navigation</a> <img src="../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="index.htm"><b>Graphisme</b></a></td>
</tr>
</table><table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr>
<td bgcolor="#EEEEEE" class="doc" width="110"><img src="../src/logo.gif" width="106" height="109" border="0" alt="SELFHTML"></td>
<td bgcolor="#EEEEEE" class="doc" valign="bottom" width="100%"><h2>Formats graphiques pour pages Web</h2></td>
</tr>
<tr>
<td bgcolor="#EEEEEE" class="doc" valign="top" align="center">
<img src="../src/docx.gif" width="30" height="20" vspace="6" border="0" alt="Page d'information: vue d'ensemble">
</td>
<td bgcolor="#FFFFFF" valign="top" nowrap>
<p>
<img src="../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#generalites"><b>G&eacute;n&eacute;ralit&eacute;s sur les formats graphiques pour pages Web</b></a><br>
<img src="../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#gif"><b>Le format GIF</b></a><br>
<img src="../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#jpeg"><b>Le format JPEG</b></a><br>
<img src="../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#png"><b>Le format PNG</b></a><br>
<img src="../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#lurawave"><b>Le format LuraWave</b></a><br>
<img src="../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#svg"><b>Le format SVG</b></a><br>
</p>
</td>
</tr><tr><td colspan="2" bgcolor="#EEEEEE" class="doc">&#160;<a href="#bottom"><img src="../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;</td></tr>
</table>



<h2 class="Sh2"><a class="an" name="generalites">G&eacute;n&eacute;ralit&eacute;s sur les formats graphiques pour pages Web</a></h2>


<p>Sur le Web deux formats de fichiers, pouvant &ecirc;tre affich&eacute;s &quot;en ligne&quot; c'est &agrave; dire dans leur propre fen&ecirc;tre par tous les navigateurs m&ecirc;me les moins modernes modernes se sont impos&eacute;s pour les graphiques: Les formats GIF et JPEG. Les forces des deux formats r&eacute;sident pourtant dans des domaines diff&eacute;rents. &Agrave; cela s'ajoute un nouveau format plein de promesses qui r&eacute;unit de nombreux avantages de GIF et de JPEG: le format PNG. Ce format est aussi support&eacute; par les navigateurs plus r&eacute;cents m&ecirc;me si c'est de fa&ccedil;on in&eacute;gale et souvent incompl&egrave;te. Par ailleurs existent encore d'autres solutions qui m&eacute;ritent l'attention mais qui n'ont qu'un cercle restreint d'utilisateurs, parce qu'elles n&eacute;cessitent un plugiciel  - c'est le cas par exemple du format de LuraWave. Tous ces formats ont une chose en commun: ce sont des formats orient&eacute;s pixels. Le graphique vectoriel sur le Web est encore par contre assez rare. Le format qui promet beaucoup dans cette optique, le format SVG bas&eacute; sur XML, ne se d&eacute;veloppe malheureusement qu'en h&eacute;sitant. L'espoir demeure cependant qu'il soit adopt&eacute;.</p>

<p>Dans cette partie, les formats nomm&eacute;s sont bri&egrave;vement pr&eacute;sent&eacute;s.</p>




<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;</td></tr></table>
<h2 class="Sh2"><a class="an" name="gif">Le format GIF</a></h2>

<p>Les fichiers du format GIF ont l'extension habituelle de nom de ficher <var>.gif</var> et le <img src="../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="../divers/typesmime.htm"><b>type Mime</b></a> <var>image/gif</var>. En HTML, les fichiers GIF peuvent &ecirc;tre incorpor&eacute;s &agrave; l'aide de l'&eacute;l&eacute;ment <code>img</code> (voir <img src="../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="../html/graphiques/incorporer.htm"><b>Incorporer des graphiques</b></a>).</p>

<p> GIF figure pour <var>Graphics Interchange Format</var> et a &eacute;t&eacute; introduit, il y a de nombreuses ann&eacute;es d&eacute;j&agrave; par l'annonceur en ligne CompuServe. Il se distingue par une haute compression. C'est pourquoi il s'est impos&eacute; rapidement dans le domaine en ligne o&ugrave; la transmission de donn&eacute;es co&ucirc;te du temps et de l'argent. Le standard du format GIF aujourd'hui largement r&eacute;pandu est ce qu'on appelle le &quot;format 89&quot;. Ce format propose trois possibilit&eacute;s qui rendent le format GIF particuli&egrave;rement int&eacute;ressant pour la mise en oeuvre sur le Web:</p>

<ul>
<li><b>Interlaced</b>: La possibilit&eacute; de sauvegarder un fichier &quot;interlaced&quot;. Un graphique ainsi sauvegard&eacute;, n'est pas lu et construit ligne par ligne lors de son chargement mais couche par couche . Ce qui est une aide pour le chargement de pages Web. Car ainsi, la structure de base du graphique appara&icirc;t tr&egrave;s vite &agrave; l'&eacute;cran chez l'utilisateur. Lors de la suite du processus de lecture, le graphique devient toujours plus pr&eacute;cis et sa r&eacute;solution plus fine &agrave; l'&eacute;cran.</li>
<li><b>Animation</b>: Le format GIF offre la possibilit&eacute; de sauvegarder plusieurs graphiques en un seul fichier graphique, en liaison avec les options pour le contr&ocirc;le des diff&eacute;rents graphiques. &Agrave; l'aide de cette propri&eacute;t&eacute; du format GIF, il est possible de r&eacute;aliser des <img src="../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="gifs_animes.htm"><b>graphiques GIF anim&eacute;s</b></a>.</li>
<li><b>Couleur transparente</b>: Le format GIF travaille avec des <img src="../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="techniques.htm#palettes_couleurs"><b>palettes de couleurs et couleurs index&eacute;es</b></a>, donc avec un nombre limit&eacute; de &quot;couleurs index&eacute;es&quot;. Ici s'offre la possibilit&eacute; de d&eacute;finir une de ces couleurs comme couleur &quot;transparente&quot;. &Agrave; l'affichage apparaissent alors les &eacute;l&eacute;ments qui sont plac&eacute;s sous le graphique aux endroits o&ugrave; le graphique est transparent. Les d&eacute;tails sur les possibilit&eacute;s qui y sont li&eacute;es sont expos&eacute;s dans la partie traitant de la <img src="../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="techniques.htm#transparence"><b>Transparence d'une couleur d&eacute;termin&eacute;e de la palette de couleurs</b></a>.</li>
</ul>

<p>Un inconv&eacute;nient du format GIF est qu'il peut sauvegarder au maximum 256 couleurs par fichier. Un point positif par contre est que vous pouvez les comprimer sans perte de donn&eacute;es. En raison de ses caract&eacute;ristiques, le format GIF n'est pas tr&egrave;s appropri&eacute; pour les graphiques &agrave; haute r&eacute;solution comme les photos. Le format GIF est id&eacute;al par contre pour graphiques Web typiques comme les  <img src="../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="sortes.htm#boutons"><b>boutons</b></a>, les <img src="../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="sortes.htm#dots"><b>puces</b></a>, les <img src="../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="sortes.htm#bars"><b>barres</b></a>, les <img src="../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="sortes.htm#symbole"><b>symboles</b></a> et les <img src="../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="sortes.htm#cliparts"><b>Cliparts</b></a>.</p>

<p>Malheureusement, le format GIF n'est plus compl&egrave;tement &eacute;pargn&eacute; par les &eacute;claboussures des tentatives pour faire de l'argent sur Internet. La firme Unisys, qui &agrave; l'origine d&eacute;posa un brevet pour l'algorithme LZW qu'utilise le format GIF, remua beaucoup de vent fin 1999 quand elle fit conna&icirc;tre son intention d'ester en justice contre les graphiques GIF non patent&eacute;s sur la toile. Si on consid&egrave;re le fait qu'il y a bien &agrave; peu pr&egrave;s autant de graphiques GIF sur la toile que d'habitants sur notre plan&egrave;te, ce projet n'&eacute;tait pas il est vrai, particuli&egrave;rement r&eacute;aliste. Les fournisseurs de logiciels graphiques soutenant le format GIF, doivent, il est vrai d&eacute;tenir u8ne licence et sont aussi contr&ocirc;l&eacute;s. C'est pourquoi, il y a, avant tout dans le monde des gratuiciels et divers autres lieux, des protestations et des appels &agrave; ne plus utiliser le format GIF.</p>








<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;</td></tr></table>
<h2 class="Sh2"><a class="an" name="jpeg">Le format JPEG</a></h2>

<p>Les fichiers du format JPEG GIF ont l'extension habituelle de nom de ficher   <var>.jpg</var>, <var>.jpeg</var> ou <var>.jpe</var> et le <img src="../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="../divers/typesmime.htm"><b>type Mime</b></a> <var>image/jpeg</var>. En HTML, les fichiers JPEG peuvent &ecirc;tre incorpor&eacute;s &agrave; l'aide de l'&eacute;l&eacute;ment  HTML  <code>img</code> (voir <img src="../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="../html/graphiques/incorporer.htm"><b> Incorporer des graphiques</b></a>).</p>

<p>JPEG figure pour <var>Joint Photographic Expert Group</var>, donc pas pour le nom du format graphique mais pour la nom de la corporation qui a d&eacute;velopp&eacute; le format. Le proc&eacute;d&eacute; JPEG est un algorithme de compression pour des flux de donn&eacute;es qui se base dur l'algorithme DCT (Diskrete Cosinus Transformation) en relation avec le codage de  Huffman. Le format du m&ecirc;me nom pour les graphiques est simplement une application de cet algorithme sur les graphiques en pixels. Entre-temps, l'algorithme JPEG est appliqu&eacute; &eacute;galement aux vid&eacute;os et a introduit le format vid&eacute;o appr&eacute;ci&eacute; MPEG.</p>

<p>Le format graphique JPEG comprime &eacute;galement tr&egrave;s bien et a l'avantage par rapport au format GIF qu'il peut sauvegarder par image jusqu'&agrave; 16,7 millions de couleurs. C'est pourquoi il ne travaille pas comme le format GIF avec des palettes de couleurs de couleurs d&eacute;termin&eacute;es, mais avec tout le spectre des couleurs. . L'inconv&eacute;nient en est que JPEG comprime avec perte de donn&eacute;es, c'est &agrave; dire plus le facteur de compression est grand plus la qualit&eacute; du graphique sera mauvaise.</p>

<p>Pour le format JPEG vous pouvez avec de bons programmes graphiques d&eacute;terminer vous m&ecirc;me deux param&egrave;tres:</p>
<ul>
<li><b>La r&eacute;solution DPI:</b> C'est la densit&eacute; en points (dpi = dots par pouce). Pour les fichiers JPEG, dont vous avez besoin pour l'affichage sur des pages WWW, une valeur entre 70 et 100 dpi suffit. Au cas o&ugrave; vous voulez imprimer le graphique, vou avez besoin il est vrai de beaucoup plus de dpi.</li>
<li><b>Le facteur de compression:</b> Plus le facteur de compression est &eacute;lev&eacute;, plus la qualit&eacute; de l'image est mauvaise. Plus le facteur de compression est bas, plus la taille du fichier est &eacute;lev&eacute;e .</li>
</ul>

<p>Les pertes dues &agrave; la compression pour les graphiques JPEG apparaissent avant tout dans les passages de couleurs tranch&eacute;s sur l'image, donc sur les coins et les bords des objets repr&eacute;sent&eacute;s (&quot;Les bords s'effilochent&quot;). Pour les images ayant peu de couleurs mais des contours francs, donc par exemple pour des dessins simples, des esquisses contrast&eacute;es etc... le format JPEG n'est de ce fait pas appropri&eacute;. Le format montre par contre ses ponts forts pour la sauvegarde de photos et autres graphiques dans lesquels on observe des d&eacute;grad&eacute;s fins. M&ecirc;me avec un taux de compression faible, les tailles de fichier sont bien plus petites que celles de graphiques  Bitmap. M&ecirc;me des photos remplissant l'&eacute;cran peuvent &ecirc;tre ramen&eacute;es pour une qualit&eacute; satisfaisante &agrave; une taille de fichier  qui peut &ecirc;tre consid&eacute;r&eacute;e comme acceptable sur la toile.</p>

<p>Il existe une variante des graphiques JPEG appel&eacute;e &quot;graphiques progressifs JPEG&quot;. L&agrave; de fa&ccedil;on similaire au format GIF dans sa variante &quot;interlaced&quot;, est d'abord construite &agrave; l'&eacute;cran une version compl&egrave;te mais encore impr&eacute;cise du graphique. La premi&egrave;re image pas encore tr&egrave;s pr&eacute;cise peut d&eacute;j&agrave; &ecirc;tre affich&eacute;e &agrave; l'&eacute;cran quand environ 15% du fichier graphique ont &eacute;t&eacute; transmis au navigateur appelant.</p>






<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;</td></tr></table>
<h2 class="Sh2"><a class="an" name="png">Le format PNG</a></h2>

<p>Les fichiers du format PNG ont l'extension habituelle de nom de ficher <var>.png</var> et le <img src="../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="../divers/typesmime.htm"><b>type Mime</b></a> <var>image/png</var>. En HTML, les fichiers PNG peuvent &ecirc;tre incorpor&eacute;s &agrave; l'aide de l'&eacute;l&eacute;ment   <code>img</code> (voir <img src="../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="../html/graphiques/incorporer.htm"><b> Incorporer des graphiques</b></a>), mais aussi avec les &eacute;l&eacute;ments <code>embed</code> ou <code>object</code>.</p>

<p>PNG signifie <var>Portable Network Graphic</var> (prononc&eacute;: PING). Il s'agit d'un format graphique con&ccedil;u sp&eacute;cialement pour la mise en oeuvre sur le Web et dont les normes sont comme celles de HTML, CSS, XML et autres technologies Web assur&eacute;es par le consortium W3. La recommandation (Recommendation) du consortium W3 sur PNG remonte &agrave; 1996. Le document correspondant peut &ecirc;tre trouv&eacute; sur les pages du consortium W3 sous le titre <img src="../src/en.gif" width="16" height="10" border="0" alt="Page en langue anglaise">&nbsp;<a target="_top" href="http://www.w3.org/TR/REC-png"><b>Sp&eacute;cification PNG (Portable Network Graphics)</b></a>.</p>

<p>PNG doit rassembler tous les avantages de GIF et de JPEG et se distingue par les caract&eacute;ristiques suivantes:</p>
<ul>
<li><b>Compression sans pertes:</b> PNG comprime sans perte de donn&eacute;es comme le format GIF. L'algorithme de compression mis en &#339;uvre travaille de fa&ccedil;on similaire &agrave; celle du format ZIP. Les r&eacute;p&eacute;titions de mod&egrave;les de pixels sont remplac&eacute;es par des informations Meta sur ce mod&egrave;le, ce qui m&egrave;ne &agrave; des forts taux de compression avant tout pour des graphiques comme les cliparts, les esquisses etc... Cet algorithme a par contre moins d'effet pour les photos et graphiques avec de nombreux d&eacute;grad&eacute;s de couleurs fins. C'est tout &agrave; fait similaire &agrave; la compression de donn&eacute;es en fichier ZIP o&ugrave; les fichiers binaires dont les mod&egrave;le d'octets reconnaissables est moindre se laissent moins compresser que des fichiers texte par exemple.</li>
<li><b>Intensit&eacute; de couleurs plus transparence:</b> PNG soutient 16,7 millions de couleurs comme le format JPEG, mais aussi au choix la sauvegarde avec couleurs index&eacute;es donc avec une palette de couleurs limit&eacute;e. Ainsi le format reste t-il flexible et peut &ecirc;tre employ&eacute; pour toutes les sortes de graphiques. Outre les trois valeurs de couleurs pour le rouge, le vert et le bleu, le format PNG peut en plus sauvegarder une quatri&egrave;me valeur par pixel, &agrave; savoir le canal alpha. La valeur alpha sauvegarde le le degr&eacute; de transparence du pixel. De cette fa&ccedil;on des effets de transparence sont possibles dont l'&eacute;chelonnement est beaucoup plus fin que ce qu'il est possible de faire avec le format GIF.</li>
<li><b>Fonction Interlaced:</b> comme le format GIF et le format JPEG dans sa variante &quot;progressive&quot;, PNG soutient la construction du graphique par couche (fonction Interlaced). Avec PNG, 1-2% des donn&eacute;es transmises suffisent d&eacute;j&agrave; pour pouvoir afficher une &eacute;bauche de l'image.</li>
<li><b>Informations sur la correction Gamma:</b> le format PNG permet la sauvegarde d'une s&eacute;rie d'informations compl&eacute;mentaires relatives &agrave; l'image, parmi lesquelles la valeur Gamma, qui par exemple &eacute;tait d&eacute;terminante lors de la prise de vue. Les navigateurs Web qui affichent l'image peuvent par exemple utiliser cette information pour, lors de l'affichage de l'image effectuer une correction Gamma automatique en fonction de l'&eacute;cran utilis&eacute; et du syst&egrave;me d'exploitation. Cette propri&eacute;t&eacute; peut aider &agrave; &eacute;viter que le m&ecirc;me image apparaisse souvent avec tant de diff&eacute;rences sur divers &eacute;crans et plates formes.</li>
<li><b>Informations sur la provenance de l'image et les droits:</b> Le format PNG permet de sauvegarder des champs texte sur le titre de l'image, l'auteur de l'image, la description de l'image, les droits, la date de cr&eacute;ation, le logiciel de cr&eacute;ation, la source des donn&eacute;es ainsi que des remarques juridiques et coutumi&egrave;res sur la protection.</li>
</ul>

<p>Les graphiques anim&eacute;s comme dans le format GIF ne sont il est vrai pas possibles avec le format PNG.</p>

<p>Il y a donc de nombreuses raisons qui plaident pour le format PNG. Il ne constitue pas tant une concurrence pour le format  JPEG (JPEG compresse les photos sensiblement plus que PNG - Les tailles de fichiers de photos &agrave; haute d&eacute;finition au format  PNG ne sont par particuli&egrave;rement attrayantes pour la toile), mais plut&ocirc;t une concurrence au format  GIF -Format, qui depuis la fa&ccedil;on cavali&egrave;re de se conduire de Unisys sur le plan des droits attach&eacute;s au brevet, est devenu incertain. Le plus gros probl&egrave;me de PNG n'est vraiment que le soutien h&eacute;sitant par les logiciels. Certes, Netscape soutient le format PNG depuis sa version 4.04, et m&ecirc;me l'Explorer Internet peut afficher les graphiques PNG depuis sa version 4.0. Il y a aussi toujours plus de programmes graphiques qui ma&icirc;trisent le format PNG. Pourtant il y eut ensuite pour les diff&eacute;rentes versions des navigateurs toujours des lacunes dans le soutien PNG. Le format n'&eacute;tait pas non plus compl&egrave;tement soutenu etc... C'est pourquoi - et bien s&ucirc;r aussi pour des raisons d'habitude - le format PNG a encore du mal &agrave; s'imposer face au format GIF.</p>





<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;</td></tr></table>
<h2 class="Sh2"><a class="an" name="lurawave">Le format LuraWave</a></h2>

<p>Les fichiers du format LuraWave ont l'extension habituelle de nom de ficher <var>.lwf</var> et le <img src="../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="../divers/typesmime.htm"><b>type Mime</b></a> <var>image/x-wavelet</var>. En HTML, les fichiers PNG peuvent &ecirc;tre incorpor&eacute;s &agrave; l'aide de l'&eacute;l&eacute;ment  <code>embed</code> ou <code>object</code>  (voir <img src="../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="../html/multimedia/objets.htm"><b>Incorporer des objets</b></a> et <img src="../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="../html/multimedia/netscape.htm"><b>Incorporer du multim&eacute;dia (Netscape traditionnel</b></a>).</p>

<p>LuraWave est un format de fichier de la firme LuraTech pour les graphiques en pixels. Il convient bien avant tout pour les graphiques haute d&eacute;finition, donc pour les photos et images avec des fins d&eacute;grad&eacute;s de couleurs. Pour de tels graphiques, l'algorithme de compression particulier qu'emploie le format LuraWave et qui est sup&eacute;rieur aux algorithme de JPEG et de PNG, se distingue. L'algorithme Lura qui travaille avec ce qu'on appelle la  <b>compression Wavelet</b>, garantit, si on le compare directement avec JPEG pour une r&eacute;duction de la taille du fichier identique de l'image originale, une qualit&eacute; d'image bien meilleure que le format JPEG. Outre la compression particuli&egrave;rement bonne, le format Lurawave dispose d'autres particularit&eacute;s:</p>

<ul>
<li><b>Taille r&eacute;glable:</b> En raison de l'algorithme de compression Wavelet, il est possible, comme avec un hologramme, de reconstituer l'image &agrave; partir d'une petite partie de celle-ci. Cela permet de zoomer un graphique Lurawave, donc de l'agrandir sans que le graphique ne s'en enlaidisse tout de suite en affichant que des points.</li>
<li><b>Protection par mot de passe:</b> Les graphiques LuraWave peuvent &ecirc;tre prot&eacute;g&eacute;s par mot de passe de telle fa&ccedil;on qu'une variante de moindre qualit&eacute; de l'image puisse &ecirc;tre consult&eacute;e par le public, alors qu'une variante de haute qualit&eacute; n'est affichable et susceptible d'&ecirc;tre trait&eacute;e que contre l'entr&eacute;e d'un mot de passe.</li>
</ul>

<p>Pour la cr&eacute;ation de graphiques Lurawave, le logiciel  LuraWave est indispensable. Le logiciel existe sous forme de plugiciel pour des produit connus tels que Photoshop, Cumulus ou bien Paintshop Pro. Ces programmes peuvent alors sauvegarder des graphiques en tant que fichiers lwf. Il existe aussi un utilitaire s&eacute;par&eacute; de Lurawave qui lit d'autres formats graphiques comme JPEG, BMP, TIFF etc... et qui peut ensuite les sauvegarder sous le format lwf. Les plugiciels pour les programmes professionnels et l'utilitaire s&eacute;par&eacute; sont payants, une version limit&eacute;e de l'utilitaire s&eacute;par&eacute; est gratuite. De plus les plugiciels malheureusement indispensables au navigateur sont gratuits. Les informations sur les produits et les possibilit&eacute;s de t&eacute;l&eacute;chargement sont &agrave; consulter sur les pages Web de <img src="../src/en.gif" width="16" height="10" border="0" alt="Page en langue anglaise">&nbsp;<a target="_top" href="http://www.luratech.com/"><b>LuraTech</b></a>.</p>

<p>Le format LuraWave est donc une alternative int&eacute;ressante sur le plan technique avant tout au format JPEG. L'inconv&eacute;nient en est qu'il ne s'agit pas d'un standard ouvert, qu'il d&eacute;pend d'un logiciel d&eacute;termin&eacute; et qu'il n'est pas soutenu d'origine par les navigateurs mais seulement apr&egrave;s l'installation du plugiciel.</p>





<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;</td></tr></table>
<h2 class="Sh2"><a class="an" name="svg">Le format SVG</a></h2>

<p>Les fichiers du format SVG ont l'extension habituelle de nom de ficher <var>.svg</var> ou <var>svgz</var> et le <img src="../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="../divers/typesmime.htm"><b>type Mime</b></a> <var>image/svg+xml</var>. . En HTML, les fichiers SVG peuvent &ecirc;tre incorpor&eacute;s &agrave; l'aide de l'&eacute;l&eacute;ment  HTML  <code>embed</code> ou <code>object</code> (voir <img src="../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="../html/multimedia/objets.htm"><b>Incorporer des objets </b></a> et <img src="../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="../html/multimedia/netscape.htm"><b>Incorporer du multim&eacute;dia (Netscape traditionnel)</b></a>).</p>

<p>SVG figure pour <var>Scalable Vector Graphics</var>. C'est le seul format graphique vectoriel parmi les formats pr&eacute;sent&eacute;s ici. &Agrave; l'inverse des formats classiques de ce genre, qui en r&egrave;gle g&eacute;n&eacute;rale sont li&eacute;s &agrave; des logiciels commerciaux, le format SVG est d&eacute;velopp&eacute; par le consortium W3 et exactement comme d'autres langages dont les normes y sont assur&eacute;es, donc comme HTML, CSS, XML, et aussi PNG, il est ind&eacute;pendant de la plate-forme, document&eacute; ouvertement et peut &ecirc;tre utilis&eacute; librement. Vous trouverez des informations actuelles et la sp&eacute;cification SVG sur les pages du consortium W3 par la page d'accueil <img src="../src/en.gif" width="16" height="10" border="0" alt="Page en langue anglaise">&nbsp;<a target="_top" href="http://www.w3.org/Graphics/SVG/"><b>Scalable Vector Graphics (SVG)</b></a>.</p>

<p>Les formats de graphiques vectoriels ne d&eacute;crivent pas quelles proportions de couleurs poss&egrave;de un pixel de l'image, mais ils d&eacute;crivent des objets. Il existe des objets comme des lignes droites ou courb&eacute;es selon un algorithme, des surfaces rondes ou angulaires, du texte etc... Tous ces objets ont dans l'image une certaine position et certaines dimensions, couleurs et autres propri&eacute;t&eacute;s. Les surfaces peuvent &ecirc;tre remplies uniform&eacute;ment, avec un d&eacute;grad&eacute; ou avec un mod&egrave;le bitmap, Des effets 3D et des filtres couleurs peuvent leur avoir &eacute;t&eacute; affect&eacute;s. Les objets peuvent aussi &ecirc;tre rassembl&eacute;s en groupes d'objets. Dans le fichier figurent alors seulement les descriptions des objets. Le graphique &agrave; afficher est cr&eacute;&eacute; lors de l'ex&eacute;cution &agrave; partir des donn&eacute;es descriptives.</p>

<p>Cette forme de graphique est id&eacute;ale pour la toile en ce sens que les donn&eacute;es de description d'objets graphiques vectoriels ont besoin en r&egrave;gle g&eacute;n&eacute;rale de beaucoup moins de place que des graphiques orient&eacute;s pixels. Pr&eacute;cis&eacute;ment pour des graphiques qui contiennent des symboles, des logo ou des cliparts, le format SVG serait une alternative intelligente au format GIF. Il est appropri&eacute; de fa&ccedil;on id&eacute;ale &agrave; toutes sortes de graphiques techniques, aux graphiques d'illustrations et de dessin industriel. Le format SVG se distingue par les propri&eacute;t&eacute;s particuli&egrave;res suivantes:</p>

<ul>
<li><b>bas&eacute; sur XML:</b> SVG est un langage bas&eacute; sur <img src="../src/chap.gif" width="15" height="13" border="0" alt="Chapitre: vue d'ensemble">&nbsp;<a href="../xml/index.htm"><b>XML</b></a>. Le format put ainsi &ecirc;tre valid&eacute; &agrave; tout moment par rapport &agrave; une DTD, et ce qui est tr&egrave;s important, - c'est un format en texte clair. Les contenus textes des graphiques SVG peuvent de ce fait servir de champ de recherche aux moteurs de recherche. De plus, il est possible sans aucun probl&egrave;me de cr&eacute;er des graphiques SVG de fa&ccedil;on dynamique avec des scripts, que ce soit c&ocirc;t&eacute; serveur avec des scripts <img src="../src/chap.gif" width="15" height="13" border="0" alt="Chapitre: vue d'ensemble">&nbsp;<a href="../cgiperl/index.htm"><b>CGI</b></a>, ou c&ocirc;t&eacute; client avec un langage comme  <img src="../src/chap.gif" width="15" height="13" border="0" alt="Chapitre: vue d'ensemble">&nbsp;<a href="../JavaScript/index.htm"><b>JavaScript</b></a>. &Agrave; l'aide d'un mod&egrave;le DOM (DOM) l'acc&egrave;s direct dynamique &agrave; chaque donn&eacute;e descriptive d'un fichier SVG est m&ecirc;me possible. SVG se pr&ecirc;tent merveilleusement bien pour cette raison aux graphiques interactifs pour lesquels un utilisateur entre des param&egrave;tres dans un fichier HTML &agrave; partir desquels le graphique est compos&eacute; ou bien pour les graphiques en histogrammes (colonnes) ou en secteurs (camemberts) sur les statistiques serveur.</li>
<li><b>Soutien XLink:</b> XLink est un sch&eacute;ma pour la description de liens (Hyperlinks) en XML. Ce sch&eacute;ma est &eacute;galement applicable &agrave; SVG. Il est ainsi possible de cr&eacute;er des graphiques SVG compos&eacute;s de liens (cartes cliquables). Les cibles quelconques des liens peuvent &ecirc;tre locales ou &eacute;loign&eacute;es.</li>
<li><b>Possibilit&eacute;s d'&ecirc;tre agrandis ou bascul&eacute;s</b>: Les graphiques vectoriels peuvent &ecirc;tre agrandis sans perte de donn&eacute;es. Ainsi des graphiques de petite taille peuvent-ils &ecirc;tre agrandis sans probl&egrave;me pour des mal-voyants. De m&ecirc;me peut-on appliquer une l&eacute;g&egrave;re rotation sur ces graphique (basculer).</li>
<li><b>Interface SMIL:</b> SMIL est &eacute;galement un langage dont les normes sont fix&eacute;es par le consortium W3. Il d&eacute;crit des zones de temps pour des processus multim&eacute;dia. Avec SMIL, il est possible de combiner des graphiques SVG dynamiques avec d'autres &eacute;l&eacute;ments comme le son.</li>
</ul>

<p>Les versions plus r&eacute;centes des logiciels de graphiques vectoriels connus soutiennent le format SVG, comme par exemple <var>CorelDraw</var> &agrave; partir de la version 10. D'autres, des produits commercialis&eacute;s en tant que programmes partagiciels abordables comme le programme <var>WebDraw</var> du fabricant Jasc, duquel vient aussi le programme pixel populaire <var>Paintshop Pro</var>, aident &eacute;galement &agrave; la cr&eacute;ation de graphiques SVG. Th&eacute;oriquement, un &eacute;diteur de texte quelconque suffit, il est vrai, aussi - comme pour tous les formats en texte clair de la famille XML. Celui qui est pr&ecirc;t &agrave; s'attaquer au langage SVG peut effectivement cr&eacute;er des graphiques SVG avec un &eacute;diteur de texte et un programme d'affichage SVG. Et il y a des programmes d'affichage SVG gratuits. Le plus connus est de Adobe. Le programme d'affichage Adobe peut aussi &ecirc;tre install&eacute; comme plugiciel du navigateur. De cette fa&ccedil;on des navigateurs comme Netscape ou l'Explorer Internet sont en mesure d'afficher des graphiques SVG sur la toile. Malheureusement le soutien d'origine de SVG par les navigateurs fait cependant encore d&eacute;faut. Tout ce pour quoi l'utilisateur a besoin d'un plugiciel ne se d&eacute;veloppe qu'avec h&eacute;sitation. Un soutien SVG incorpor&eacute; au navigateur comme c'est le cas pour GIF et JPEG serait, pour cette raison, souhaitable d'urgence.  Car le format SVG est vraisemblablement dans le domaine du graphique le d&eacute;veloppement le plus palpitant ayant lieu &agrave; l'heure actuelle est est appropri&eacute; comme aucun autre &agrave; une multitude de sortes de graphiques statiques ou dynamiques sur le Web.</p>





<table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr><td colspan="2" bgcolor="#EEEEEE" class="doc">
&#160;<a href="#top"><img src="../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a>
</td></tr>
<tr><td bgcolor="#EEEEEE" class="doc" align="right"><a href="sortes.htm"><img src="../src/suivant.gif" width="10" height="10" border="0" hspace="10" alt="page suivante"></a></td>
<td bgcolor="#FFFFFF"><img src="../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information"> <a href="sortes.htm"><b>Sortes de graphiques typiques sur les pages Web</b></a>
</td></tr>
<tr>
<td bgcolor="#EEEEEE" class="doc" align="right"><a href="../internationalisation/polices_telechargeables.htm"><img src="../src/precedent.gif" width="10" height="10" border="0" hspace="10" alt="page pr&eacute;c&eacute;dente"></a></td>
<td bgcolor="#FFFFFF" width="100%"><img src="../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information"> <a href="../internationalisation/polices_telechargeables.htm"><b>Polices &agrave; t&eacute;l&eacute;charger </b></a>
</td>
</tr>
<tr><td colspan="2" bgcolor="#EEEEEE" class="doc">&#160;</td></tr>
</table><table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr>
<td bgcolor="#FFEEDD" class="nav"><a class="an" name="bottom"><img src="../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"></a> <a href="../index.htm"><b>SELFHTML</b></a>/<a href="../navigation/index.htm" target="_parent">Aides &agrave; la navigation</a> <img src="../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="index.htm"><b>Graphisme</b></a></td>
</tr>
</table>

<p>&copy; 2001 Stefan M&uuml;nz / &copy; 2003 Traduction <img src="../src/courriel.gif" width="15" height="10" border="0" alt="Adresse &eacute;lectronique">&nbsp;<a href="mailto:13405@free.fr">Serge Fran&ccedil;ois, 13405@free.fr</a><br><img src="../src/courriel.gif" width="15" height="10" border="0" alt="Adresse &eacute;lectronique">&nbsp;<a href="mailto:selfhtml@selfhtml.com.fr">selfhtml@selfhtml.com.fr</a></p>



</body>
</html>
