<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>SELFHTML: Graphisme / Techniques et terminologie du traitement de l'image</title>
<link rel="stylesheet" type="text/css" href="../src/selfhtml.css">
<meta name="description"    content="Quels termes relatifs au traitement de l'image num&eacute;ris&eacute;s reviennent sans arr&ecirc;t,et qu'est-ce qu'ils recouvrent avec les techniques qui leurs sont associ&eacute;es.">
<meta name="keywords"       content="SELFHTML, Graphisme, ">
<meta name="author"         content="Stefan M&uuml;nz, selfhtml@teamone.de">
<meta http-equiv="content-type" content="text/html; charset=ISO-8859-1">
<meta name="DC.Publisher"   content="Serge Fran&ccedil;ois, selfhtml@selfhtml.com.fr">
<meta name="DC.Date"        content="2003-01-27T08:00+00:00">
<meta name="DC.Identifier"  content="http://selfhtml.selfhtml.com.fr/graphisme/techniques.htm">
<meta name="DC.Language"    content="fr">
<meta name="DC.Rights"      content="../editorial/copyright.htm">
<meta name="DC.Date.Create" content="2003-01-27T08:00+00:00">
<meta name="SELF.Version"   content="1">
<meta name="SELF.Pagetype"  content="Information">
<meta name="SELF.Path"      content="SELFHTML == ../index.htm // Graphisme == index.htm">
<!-- Matomo -->
<script type="text/javascript">
  var _paq = window._paq = window._paq || [];
  /* tracker methods like "setCustomDimension" should be called before "trackPageView" */
  _paq.push(['trackPageView']);
  _paq.push(['enableLinkTracking']);
  (function() {
    var u="//matomo.boitasite.com/";
    _paq.push(['setTrackerUrl', u+'matomo.php']);
    _paq.push(['setSiteId', '1']);
    var d=document, g=d.createElement('script'), s=d.getElementsByTagName('script')[0];
    g.type='text/javascript'; g.async=true; g.src=u+'matomo.js'; s.parentNode.insertBefore(g,s);
  })();
</script>
<!-- End Matomo Code -->
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#AA5522" vlink="#772200" alink="#000000">


<table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr>
<td bgcolor="#FFEEDD" class="nav"><a class="an" name="top"><img src="../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"></a> <a href="../index.htm"><b>SELFHTML</b></a>/<a href="../navigation/index.htm" target="_parent">Aides &agrave; la navigation</a> <img src="../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="index.htm"><b>Graphisme</b></a></td>
</tr>
</table><table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr>
<td bgcolor="#EEEEEE" class="doc" width="110"><img src="../src/logo.gif" width="106" height="109" border="0" alt="SELFHTML"></td>
<td bgcolor="#EEEEEE" class="doc" valign="bottom" width="100%"><h2>Techniques et terminologie du traitement de l'image</h2></td>
</tr>
<tr>
<td bgcolor="#EEEEEE" class="doc" valign="top" align="center">
<img src="../src/docx.gif" width="30" height="20" vspace="6" border="0" alt="Page d'information: vue d'ensemble">
</td>
<td bgcolor="#FFFFFF" valign="top" nowrap>
<p>
<img src="../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#generalites"><b>G&eacute;n&eacute;ralit&eacute;s sur le traitement de l'image des graphiques de trame ou des graphiques en pixels</b></a><br>
<img src="../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#taille_image"><b>Taille de l'image, dpi et pixels</b></a><br>
<img src="../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#intensite_modeles_canaux_couleurs"><b>Intensit&eacute; des couleurs, mod&egrave;les de couleurs et canaux de couleurs</b></a><br>
<img src="../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#palettes_couleurs"><b>Palettes de couleurs et couleurs index&eacute;es</b></a><br>
<img src="../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#canal_alpha_transparence"><b>Canal alpha et transparence v&eacute;ritable</b></a><br>
<img src="../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#transparence"><b>Transparence d'une couleur d&eacute;termin&eacute;e de la palette de couleurs</b></a><br>
<img src="../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#tramage"><b>Tramage &agrave; diffusion d'erreur - Dithering (Error-Diffusion)</b></a><br>
<img src="../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#niveaux_gris"><b>Niveaux de gris</b></a><br>
<img src="../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#luminosite_saturation_contraste"><b>Luminosit&eacute;, saturation et contraste</b></a><br>
<img src="../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#histogramme"><b>Histogramme</b></a><br>
<img src="../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#correction_gamma"><b>Correction Gamma</b></a><br>
<img src="../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#filtres"><b>Effets de filtre</b></a><br>
<img src="../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#anti_crenelage"><b>Anti-cr&eacute;nelage</b></a><br>
</p>
</td>
</tr><tr><td colspan="2" bgcolor="#EEEEEE" class="doc">&#160;<a href="#bottom"><img src="../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;</td></tr>
</table>



<h2 class="Sh2"><a class="an" name="generalites">G&eacute;n&eacute;ralit&eacute;s sur le traitement de l'image des graphiques de trame ou des graphiques en pixels</a></h2>


<p>Le traitement de l'image est un monde en soi et ne peut &ecirc;tre qu'effleur&eacute; dans le cadre de cette documentation. Le traitement de graphiques est encore toujours tr&egrave;s li&eacute; aux performances des diff&eacute;rents produits logiciels. Quand vous voulez cr&eacute;er ou travailler vous m&ecirc;me des graphiques pour pages Web, vous avez besoin en tout &eacute;tat de cause d'un programme graphique professionnel ou semi-professionnel pour graphiques en pixels. Les moyens du bord offerts par le syst&egrave;me d'exploitation comme  Paint sous Windows ne suffisent pas pour le faire. Le produit de r&eacute;f&eacute;rence pour le traitement de l'image est bien comme avant Photoshop. D'autres programmes qui sont bien moins chers ou qui sont m&ecirc;me des gratuiciels sans pour cela &agrave; avoir honte d'&ecirc;tre compar&eacute;s &agrave;  Photoshop, sont aussi disponibles. Dans l'index des liens de l'offre en ligne de  SELFHTML actuel vous trouverez un r&eacute;capitulatif des logiciels:</p>

<p><img src="../src/serverdoc.gif" width="15" height="10" border="0" alt="Page d'information: connexion exig&eacute;e">&nbsp;
<a href="http://www.selfhtml.com.fr/liens/index.htm"><b>Programmes graphiques</b></a></p>

<p>Pour la mise en &#339;uvre correcte des fonctions de ces programmes graphiques, vous avez besoin de connaissances. Dans l'index des liens de l'offre en ligne de  SELFHTML actuel vous trouverez des liens &agrave; des didacticiels de graphisme sur la toile:</p>

<p><img src="../src/serverdoc.gif" width="15" height="10" border="0" alt="Page d'information: connexion exig&eacute;e">&nbsp;
<a href="http://www.selfhtml.com.fr/liens/index.htm"><b>Conception, graphisme, polices</b></a></p>

<p>Quelques termes et fonctions importantes du traitement de l'image sont aussi trait&eacute;s ici. Il s'agit ici de la technique des images de trame. Les images de trame sont simplement toutes les images dont le contenu n'est pas d&eacute;crit par des donn&eacute;es vectorielles mais mais par une trame de points constituant l'image. Une trame id&eacute;ale pour les graphiques &agrave; l'&eacute;cran sont les pixels de l'&eacute;cran. Les graphiques en pixels sont donc une forme d'images de trame. Les deux formats les plus r&eacute;pandus aujourd'hui pour les graphiques Web, le <img src="../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="formats.htm#gif"><b>format GIF</b></a>  et le <img src="../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="formats.htm#jpeg"><b>format JPEG</b></a>, sont tous deux sp&eacute;cialis&eacute;s pour la sauvegarde de ces graphiques en pixels.</p>





<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;</td></tr></table>
<h2 class="Sh2"><a class="an" name="taille_image">Taille de l'image, dpi et pixels</a></h2>

<p>Quand vous voulez cr&eacute;er un nouveau graphique en pixels, vous devez d'abord en fixer la taille en mentionnant la largeur et la hauteur du graphique.</p>

<p>Un graphique en pixels (ou graphique de trame) est constitu&eacute; - &agrave; la diff&eacute;rence du graphique vectoriel - d'un nombre de points d'images nomm&eacute;s pixels. La largeur d'un tel graphique s'obtient alors par le nombre de pixels situ&eacute;s sur une rang&eacute;e horizontale et la hauteur par le nombre de pixels situ&eacute;s sur une rang&eacute;e verticale. Aussi longtemps que tout reste &agrave; l'&eacute;cran, cette op&eacute;ration simple suffit. Et aussi longtemps que vous avez besoin de graphiques en pixels pour le seul usage sur vos pages Web, vous n'avez pas besoin de vous faire de soucis sur les autres probl&egrave;mes de taille de l'image.</p>

<p>Les probl&egrave;mes n'apparaissent que lorsqu'un graphique en pixels doit &ecirc;tre sorti sur un autre p&eacute;riph&eacute;rique non orient&eacute; pixels. Pour la sortie sur papier par exemple, donc pour l'impression, il faut fixer quelle &quot;taille&quot; doit avoir un pixel sur le papier, car &agrave; la diff&eacute;rence de l'&eacute;cran il n'existe sur le papier aucun pixel prescrit. &Agrave; l'impression, il y a des points pouvant &ecirc;tre imprim&eacute;s. Plus ils sont rapproch&eacute;s, plus la r&eacute;solution de l'image imprim&eacute;e est fine. Cette densit&eacute; est mesur&eacute;e en points par pouce (Dots per Inch) (dpi).</p>

<p>&Eacute;tant donn&eacute; que beaucoup de graphiques en pixels sont maintenant con&ccedil;us pour l'impression, la plupart des programmes graphiques proposent deux ou plusieurs variantes pour fixer la taille de l'image. L'une d'entre elles consiste &agrave; mentionner la largeur et la hauteur de l'image en pixels, la deuxi&egrave;me &agrave; choisir la densit&eacute; de points par pouce ou &agrave; pr&eacute;ciser la taille de l'image en unit&eacute;s de mesure comme les centim&egrave;tres ou les pouces ou Inch. La deuxi&egrave;me variante est int&eacute;ressante en tous cas pour continuer &agrave; traiter le graphique pour l'impression. Pour d&eacute;terminer la taille d'une image &agrave; l'&eacute;cran, vous devez toujours choisir la variante qui consiste &agrave; fixer la taille d'une image par la mention de pixels pour la largeur et la hauteur.</p>

<p>Des graphiques en pixels d&eacute;j&agrave; existants ont soit d&eacute;j&agrave;  la taille &agrave; l'&eacute;cran dont vous avez besoin pour les incorporer dans vos pages Web, ou bien les graphiques existants sont trop grands ou trop petits.</p>

<p>Quand l'image est trop grande par rapport &agrave; ce dont vous avez besoin pour l'affichage &agrave; l'&eacute;cran, vous devez la r&eacute;duire en fixant des valeurs de pixels plus faibles pour la largeur et la hauteur. C'est indispensable par exemple pour les photos d'appareil photo num&eacute;rique qui ont souvent une taille de plusieurs m&eacute;ga-pixels et qui donnent l'effet d'&ecirc;tre gigantesques &agrave; l'&eacute;cran pour un rapport d'agrandissement de 1:1. M&ecirc;me les graphiques cr&eacute;&eacute;s par num&eacute;risation au scanneur avec un nombre de ppp (dpi) &eacute;lev&eacute; ont cette taille. Pour calculer &agrave; la baisse la taille d'une image, les programmes graphiques modernes disposent d'algorithme &eacute;prouv&eacute;s. Quelques-uns disposent pour calculer le contenu de l'image pour une autre taille (&quot;Resample&quot;) plusieurs algorithmes au choix. Deux facteurs sont en tous cas importants pour le redimensionnement: l'intensit&eacute; de couleurs pleine doit &ecirc;tre r&eacute;gl&eacute;e (par exemple 16,7 millions de couleurs) et les proportions doivent &ecirc;tre conserv&eacute;es c'est &agrave; dire que le rapport entre les c&ocirc;t&eacute;s doit &ecirc;tre maintenu pour que le programme graphique en r&eacute;duisant de doive pas en plus d&eacute;former l'image.</p>

<p>Quand l'image est trop petite &agrave; l'&eacute;cran par rapport &agrave; ce que vous d&eacute;sirez, l'affaire s'annonce mal. En redimensionnant, vous ne pouvez pas seulement r&eacute;duire un graphique, mais aussi l'agrandir. Cependant, les r&eacute;sultats sont ici souvent insuffisants. Car il est plus facile, partant de beaucoup d'informations d'en obtenir moins (comme pour la r&eacute;duction), que de, &agrave; partir de peu d'informations, d'en obtenir plus (comme pour l'agrandissement). Dans ces cas l&agrave;, il est pr&eacute;f&eacute;rable la plupart du temps de se contenter de l'image trop petite.</p>




<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;</td></tr></table>
<h2 class="Sh2"><a class="an" name="intensite_modeles_canaux_couleurs">Intensit&eacute; des couleurs, mod&egrave;les de couleurs et canaux de couleurs</a></h2>

<p>L'intensit&eacute; de couleurs signifie combien de tons de couleurs diff&eacute;rents peuvent &ecirc;tre sauvegard&eacute;s dans un fichier graphique. Pour les formats pixels existent aujourd'hui les intensit&eacute;s de couleurs typiques suivantes:</p>

<ul>
<li>2 couleurs (noir et blanc)</li>
<li>16 couleurs</li>
<li>256 couleurs</li>
<li>16,7 millions de couleurs</li>
</ul>

<p>Le <img src="../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="formats.htm#gif"><b>format GIF</b></a> soutient 2, 16 et 256 couleurs, le <img src="../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="formats.htm#jpeg"><b>format JPEG</b></a> 16,7 millions de couleurs, tout comme le <img src="../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="formats.htm#png"><b>format PNG</b></a>. Qu'il soit possible de sauvegarder autant de couleurs dans un fichier est loin de vouloir dire que les utilisateurs vient effectivement autant de couleurs. Car le nombre de couleurs pouvant &ecirc;tre affich&eacute;es chez l'utilisateur, d&eacute;pend de son mat&eacute;riel (carte graphique, &eacute;cran). Il n'y a que peu d'utilisateurs qui disposent du mat&eacute;riel &agrave; l'aide duquel 16,7 millions de couleurs peuvent &ecirc;tre pleinement affich&eacute;es. Beaucoup d'ordinateurs standard disposent aujourd'hui d'intensit&eacute;s  comprises entre 16.000, 32.000 ou 64.000 couleurs.</p>

<p>Pour les graphiques en pixels, la couleur est sauvegard&eacute;e pour chacun des pixels. Pour mettre les couleurs sous une forme compatible pour l'ordinateur, elles doivent &ecirc;tre repr&eacute;sent&eacute;es comme valeurs num&eacute;riques. C'est tout &agrave; fait similaire &agrave; la transcription de <img src="../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="../internationalisation/langage.htm#bits_octets_caracteres"><b>bits, octets et caract&egrave;res</b></a>. Pour la repr&eacute;sentation num&eacute;rique de couleurs dans l'ordinateur, il existe diff&eacute;rents mod&egrave;les. Les deux mod&egrave;les les plus connus sont:</p>

<ul>
<li><b>le mod&egrave;le RGB:</b> Dans le mod&egrave;le RGB, une couleur est d&eacute;finie par la part qu'elle contient dans chacune des couleurs fondamentales  <b>R</b>ouge, <b>G</b>reen (vert) et <b>B</b>leu . Chaque couleur a donc une valeur pour le rouge, une valeur pour le vert et une valeur pour le bleu. Chacune des trois valeurs est d&eacute;finie par des nombres entre 0 et 255. La valeur 0 signifie: aucune part de la couleur fondamentale concern&eacute;e, la valeur 255 signifie: la part maximale de la couleur fondamentale concern&eacute;e. Un bleu fonc&eacute; a, d'apr&egrave;s ce sch&eacute;ma par exemple, la valeur de couleur 0,0,153. ((0 rouge, 0 vert, 153 bleu). D'apr&egrave;s ce sch&eacute;ma, jusqu'&agrave; 16,7 millions de couleurs diff&eacute;rentes peuvent &ecirc;tre d&eacute;finies.<br>&nbsp;
<table cellpadding="0" cellspacing="0" border="0"
bgcolor="#C0C0C0"><tr><td>
<table cellpadding="10" cellspacing="1" border="0">
<tr>
<td bgcolor="#FFFFFF" valign="top">
<img src="rgb.gif" width="400" height="200" border="0" alt="mod&egrave;le RGB">
</td>
<td bgcolor="#FFFFFF" valign="top">
L'illustration ci-contre montre comment on obtient les diff&eacute;rents tons pour le mod&egrave;le RGB en ajoutant au m&eacute;lange.
</td>
</tr></table>
</td></tr></table><br>&nbsp;</li>
<li><b>Le mod&egrave;le HSB</b>: M&ecirc;me pour ce mod&egrave;le, il y a trois valeurs num&eacute;riques &agrave; d&eacute;finir. <b>H</b> figure pour <i>Hue</i> (<i>tonalit&eacute;</i>), <b>S</b> pour <i>Saturation</i> (<i>saturation</i>), et <b>B</b> pour <i>Brightness</i> (<i>luminosit&eacute;</i>). Les coloris peuvent accepter des valeurs entre 0 et 359, la saturation et la luminosit&eacute; des valeurs entre 0 et 255. Il est ainsi possible de d&eacute;finir environ 23,6 millions de couleurs.<br>&nbsp;
<table cellpadding="0" cellspacing="0" border="0"
bgcolor="#C0C0C0"><tr><td>
<table cellpadding="10" cellspacing="1" border="0">
<tr>
<td bgcolor="#FFFFFF" valign="top">
<img src="hsb.jpg" width="400" height="200" border="0" alt="mod&egrave;le HSB">
</td>
<td bgcolor="#FFFFFF" valign="top">
L'illustration ci-contre montre une boite de dialogue typique d'un programme graphique, qui permet de d&eacute;finir les coloris d'apr&egrave;s le mod&egrave;le HSB.
</td>
</tr></table>
</td></tr></table><br>&nbsp;</li>
</ul>

<p>Pour les graphiques Web le mod&egrave;le RGB est d&eacute;terminant. Quand vous cr&eacute;ez des graphiques Web avec un programme graphique qui conna&icirc;t plusieurs mod&egrave;les de couleurs, tenez vous en au mod&egrave;le RGB.</p>








<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;</td></tr></table>
<h2 class="Sh2"><a class="an" name="palettes_couleurs">Palettes de couleurs et couleurs index&eacute;es</a></h2>

<p>Dans le format GIF, vous pouvez par fichier GIF &quot;choisir&quot; et sauvegarder un maximum de 256 couleurs parmi les 16,7 millions de couleurs possibles du mod&egrave;le RGB. Pour un tel choix de couleurs, on parle de palette de couleurs.</p>

<p>Th&eacute;oriquement, chacune des 256 couleurs peut avoir des valeurs RGB quelconques c'est &agrave; dire que des valeurs aussi &quot;incongrues&quot; que 71,217,34 sont pensables. Pour des graphiques conformes au Web vous devez pourtant vous tenir &agrave; un sch&eacute;ma standard qui a aussi &eacute;t&eacute; introduit par Netscape. Pour ce sch&eacute;ma toutes les couleurs sont permises dont les valeurs RGB sont divisibles par 51. R(ouge), V(ert) et B(leu) doivent donc avoir une des valeurs 0, 51, 102, 153, 204 ou 255 (en hexad&eacute;cimal: 00, 33, 66, 99, CC ou FF). Une valeur permise d'apr&egrave;s ceci est par exemple 255,51,204 (en hexad&eacute;cimal: FF,33,CC). De cette fa&ccedil;on on obtient 6 x 6 x 6 couleurs possibles soit 216. Les 40 couleurs restantes peuvent &ecirc;tre consid&eacute;r&eacute;es comme &quot;stock permanent&quot;. Si vous avez besoin pour des graphiques distincts de certains coloris manquants, vous pouvez d&eacute;finir des coloris inemploy&eacute;s de la palette avec la couleur d&eacute;sir&eacute;e.</p>

<p><img src="../src/docf.gif" width="15" height="10" border="0" alt="D&eacute;monstration - nouvelle fen&ecirc;tre">&nbsp;<a href="../divers/affichage/palettecouleurs_216.htm" target="_blank"><b>Affichage: les 216 couleurs du sch&eacute;ma Netscape</b></a></p>

<p>Si vous voulez limiter encore davantage vos exigences concernant le mat&eacute;riel de l'utilisateur final, vous pouvez aussi vous limiter &agrave; des graphiques contenant une palette de 16 couleurs. Ici aussi remarquez: th&eacute;oriquement, chacune des 16 couleurs d'une telle palette peut avoir des valeurs de couleur au choix. Il existe pourtant 16 couleurs qui peuvent &ecirc;tre affich&eacute;es par tous les &eacute;crans VGA compatibles. Pour cette raison, ce sont aussi les 16 couleurs de base sous MS Windows. En vous limitant &agrave; 16 couleurs, il est donc judicieux de travailler avec ces 16 couleurs de base.</p>

<p><img src="../src/docf.gif" width="15" height="10" border="0" alt="D&eacute;monstration - nouvelle fen&ecirc;tre">&nbsp;<a href="../divers/affichage/palettecouleurs_16.htm" target="_blank"><b>Affichage: Les 16 couleurs du sch&eacute;ma VGA</b></a></p>






<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;</td></tr></table>
<h2 class="Sh2"><a class="an" name="canal_alpha_transparence">Canal alpha et transparence v&eacute;ritable</a></h2>

<p>Le canal Alpha est une extension des mod&egrave;les de couleurs. Ici, et pour chaque point de l'image (pixel) est sauvegard&eacute;e, outre sa valeur de couleur, une valeur alpha. Pour le mod&egrave;le RGB on parle aussi pour cette raison du mod&egrave;le  RGBA &eacute;tendu (<b>R</b>ouge <b>G</b>reen (vert) <b>B</b>leu <b>A</b>lpha). Par le canal alpha la transparence de la couleur est d&eacute;crite.</p>

<p>Le travail avec le canal alpha est conseill&eacute; quand on travaille avec ce qu'on appelle la technique des calques. Ici un graphique est compos&eacute; de plusieurs couches reposant l'une sur l'autre, chaque couche contenant une certaine composante du graphique. Quand vous ne mentionnez rien d'autres, les couches se recouvrent simplement. &Agrave; l'aide de diff&eacute;rents effets de filtre qui sont sauvegard&eacute;s dans le canal alpha, il est n&eacute;anmoins possible de d&eacute;terminer que et comment une couleur plac&eacute;e au dessous doit transpara&icirc;tre au travers d'une couleur plac&eacute;e au dessus.</p>

<p>Les deux illustrations suivantes montrent deux effets de filtres typiques, cr&eacute;&eacute;s par le travail avec plusieurs couches et le canal alpha:</p>

<table cellpadding="0" cellspacing="0" border="0"
bgcolor="#C0C0C0"><tr><td>
<table cellpadding="10" cellspacing="1" border="0">
<tr>
<td bgcolor="#FFFFFF" valign="top">
<img src="alpha1.jpg" width="347" height="216" border="0" alt="Exemple 1 Alpha ">
</td>
<td bgcolor="#FFFFFF" valign="top">
<img src="alpha2.jpg" width="347" height="216" border="0" alt="Exemple 2 Aplha ">
</td>
</tr></table>
</td></tr></table>

<p>Dans ce cas, une photo a &eacute;t&eacute; d&eacute;finie comme premier calque (premi&egrave;re couche) et une inscription  <kbd>NATURE</kbd> comme deuxi&egrave;me calque. Le deuxi&egrave;me calque ne contient que l'inscription et elle est autrement compl&egrave;tement transparente. Afin que le calque du dessous puisse transpara&icirc;tre au travers de l'inscription, le canal alpha est indispensable. En activant le canal alpha, les effets de filtre d&eacute;sir&eacute;s peuvent &ecirc;tre r&eacute;gl&eacute;s.</p>

<p>Les bons programmes graphiques vous aident pour le travail avec plusieurs calques et le canal alpha.</p>

<p>Pour les effets de transparence comme ils sont possibles &agrave; l'aide du canal alpha, on parle aussi de  transparence &quot;v&eacute;ritable&quot;. Par opposition &agrave; celle-ci, il y a la transparence d'une couleur d&eacute;termin&eacute;e de la palette de couleurs d&eacute;crite ci-apr&egrave;s.</p>




<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;</td></tr></table>
<h2 class="Sh2"><a class="an" name="transparence">Transparence d'une couleur d&eacute;termin&eacute;e de la palette de couleurs</a></h2>

<p>La plupart des navigateurs WWW modernes proposent par d&eacute;faut &agrave; l'utilisateur un arri&egrave;re plan gris perle ou blanc de la fen&ecirc;tre d'affichage en pr&eacute;voyant pourtant la possibilit&eacute; d'adapter cette couleur d'arri&egrave;re plan &agrave; son propre go&ucirc;t. Si maintenant vous avez un graphique avec un arri&egrave;re plan gris perle, ce graphique aura l'air d'une &quot;horrible&quot; t&acirc;che grise sur un arri&egrave;re plan blanc ou de couleur de la fen&ecirc;tre d'affichage. L'id&eacute;al serait un graphique avec un arri&egrave;re plan invisible (transparent) pour qu'il agisse quelque soit l'arri&egrave;re plan de la fen&ecirc;tre d'affichage. M&ecirc;me en relation avec des  couleurs d'arri&egrave;re plan d&eacute;finies soi-m&ecirc;me ou  des images d'arri&egrave;re plan (papier peint) la mise en oeuvre de graphiques avec arri&egrave;re plan transparent est judicieuse.</p>

<p>Le <img src="../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="formats.htm#gif"><b>format GIF</b></a> pr&eacute;voit la possibilit&eacute; de d&eacute;finir une certaine <img src="../src/haut.gif" width="14" height="10" border="0" alt="vers le haut">&nbsp;<a href="#palettes_couleurs"><b>couleur de la palette</b></a> comme invisible. Ceci n'est pourtant possible qu'avec le nouveau format 89 de GIF. Dans l'ancien, le format 87 ce n'est pas encore possible. L'application est appropri&eacute;e pour des graphiques &agrave; l'arri&egrave;re-plan clair et monochrome.</p>

<p>Les programmes de graphiques modernes permettent le choix et l'essai de la couleur de palette transparente.</p>





<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;</td></tr></table>
<h2 class="Sh2"><a class="an" name="tramage">Tramage &agrave; diffusion d'erreur - Dithering (Error-Diffusion)</a></h2>

<p>Quand vous travaillez avec des <img src="../src/haut.gif" width="14" height="10" border="0" alt="vers le haut">&nbsp;<a href="#palettes_couleurs"><b> palettes de couleurs et couleurs index&eacute;es</b></a> et que vous appliquez un sch&eacute;ma de couleurs aussi limit&eacute; sur des photos avec des d&eacute;grad&eacute;s d&eacute;licats et de nombreux tons interm&eacute;diaires, il faut alors que l'ordinateur trouve une solution &agrave; ce probl&egrave;me qu'il dispose de moins de valeurs de couleurs que n'en n&eacute;cessite l'image. Pour ce faire, il existe diff&eacute;rents algorithmes. L'illustration suivante montre deux possibilit&eacute;s dont celle avec l'algorithme pour le tramage &agrave; diffusion d'erreur:</p>

<table cellpadding="0" cellspacing="0" border="0"
bgcolor="#C0C0C0"><tr><td>
<table cellpadding="10" cellspacing="1" border="0">
<tr>
<td bgcolor="#FFFFFF" valign="top">
<img src="fondu1.jpg" width="181" height="127" border="0" alt="D&eacute;grad&eacute; de couleurs 1">
</td>
<td bgcolor="#FFFFFF" valign="top">
D&eacute;grad&eacute; de couleurs avec 16,7 millions de couleurs<br>
(la qualit&eacute; de l'affichage d&eacute;pend n&eacute;anmoins de votre &eacute;cran - au cas o&ugrave; celui-ci peut repr&eacute;senter moins de couleurs, le tramage est assur&eacute; par le navigateur Web)
</td>
</tr><tr>
<td bgcolor="#FFFFFF" valign="top">
<img src="fondu2.gif" width="181" height="127" border="0" alt="D&eacute;grad&eacute; de couleurs 2">
</td>
<td bgcolor="#FFFFFF" valign="top">
Image r&eacute;duite &agrave; une palette de 16 couleurs index&eacute;es optimis&eacute;es<br>
<b>sans</b> tramage &agrave; diffusion d'erreur!
</td>
</tr><tr>
<td bgcolor="#FFFFFF" valign="top">
<img src="fondu3.gif" width="181" height="127" border="0" alt="D&eacute;grad&eacute; de couleurs 3">
</td>
<td bgcolor="#FFFFFF" valign="top">
Image r&eacute;duite &agrave; une palette de 16 couleurs index&eacute;es optimis&eacute;es<br>
<b>avec</b> tramage &agrave; diffusion d'erreur!
</td>
</tr><tr>
<td bgcolor="#FFFFFF" valign="top">
<img src="fondu4.gif" width="181" height="126" border="0" alt="D&eacute;grad&eacute; de couleurs 4">
</td>
<td bgcolor="#FFFFFF" valign="top">
Agrandissement d'un extrait qui met en &eacute;vidence le tramage &agrave; diffusion d'erreur.
</td>
</tr></table>
</td></tr></table>

<p>Avec le tramage &agrave; diffusion d'erreur les d&eacute;grad&eacute;s de couleurs sont r&eacute;solus en mod&egrave;les de points qui peuvent &ecirc;tre repr&eacute;sent&eacute;s avec les couleurs existantes de la palette. Le principe est aussi d&eacute;sign&eacute; comme diffusion d'erreur. L'algorithme le plus connu pour cela est l'algorithme de Floyd-Steinberg, qui est employ&eacute; dans la plupart des programmes graphiques. Ne perdez pas de vue que des graphiques GIF avec un tramage intensif peuvent vite devenir tr&egrave;s grands. Il est pr&eacute;f&eacute;rable la plupart du temps de sauvegarder tour de suite ces graphiques comme graphiques JPEG . Il faut alors, il est vrai, que le navigateur Web de l'utilisateur assure le tramage au cas o&ugrave; l'environnement graphique sur lequel il tourne, n'autorise qu'un nombre limit&eacute; de couleurs.</p>






<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;</td></tr></table>
<h2 class="Sh2"><a class="an" name="niveaux_gris">Niveaux de gris</a></h2>

<p>Pour les images en niveaux de gris, le travail se fait avec une <img src="../src/haut.gif" width="14" height="10" border="0" alt="vers le haut">&nbsp;<a href="#palettes_couleurs"><b>palette de couleurs</b></a> de 256 couleurs. Il s'agit cependant ici d'une palette bien d&eacute;termin&eacute;e. Le rouge, le vert et le bleu ont des parts &eacute;gales et cela pour les 256 valeurs d&eacute;finies, ce qui donne une tonalit&eacute; entre le noir et le blanc. Quand R, V et B ont pour valeur 0, la valeur ainsi d&eacute;finie est un noir profond. Quand les trois parts de couleurs ont pour valeur 255, c'est un blanc pur qui est d&eacute;fini. Une valeur interm&eacute;diaire, par exemple 192,192,192, d&eacute;finit une couleur grise d'une certaine luminosit&eacute;. La palette d'une image en niveaux de gris est constitu&eacute;e par les 256 couleurs comprises entre 0,0,0 et 255,255,255 qui y sont sauvegard&eacute;es - donc 256 nuances de gris.</p>

<p>Les illustrations suivantes montrent &agrave; gauche le tableau typique des nuances de gris, constitu&eacute; par 256 nuances de gris du noir au blanc, et &agrave; droite l'application d'un tel tableau de nuances de gris sur une photo.</p>

<table cellpadding="0" cellspacing="0" border="0"
bgcolor="#C0C0C0"><tr><td>
<table cellpadding="10" cellspacing="1" border="0">
<tr>
<td bgcolor="#FFFFFF" valign="top">
<img src="nuancesgris.gif" width="297" height="297" border="0" alt="nuances de gris">
</td>
<td bgcolor="#FFFFFF" valign="top">
<img src="imageengris.jpg" width="297" height="297" border="0" alt="image en nuances de gris">
</td>
</tr></table>
</td></tr></table>

<p>Dans l'illustration de l'exemple, il est vrai, la photo apr&egrave;s avoir &eacute;t&eacute; ramen&eacute;e aux nuances de gris, a &eacute;t&eacute; fix&eacute;e &agrave; nouveau sur une pleine intensit&eacute; des couleurs et a &eacute;t&eacute; ensuite &eacute;t&eacute; sauvegard&eacute;e dans le format JPEG et non pas dans le format GIF. Le graphique devient ainsi beaucoup plus petit. Car m&ecirc;me en ramenant une photo avec pleine intensit&eacute; des couleurs &agrave; une photo en nuances de gris, il est travaill&eacute; &eacute;norm&eacute;ment avec le <img src="../src/haut.gif" width="14" height="10" border="0" alt="vers le haut">&nbsp;<a href="#tramage"><b>tramage &agrave; diffusion d'erreur - Dithering (Error-Diffusion)</b></a>, ce qui rend vite les tailles de fichiers de photo excessives.</p>






<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;</td></tr></table>
<h2 class="Sh2"><a class="an" name="luminosite_saturation_contraste">Luminosit&eacute;, saturation et contraste</a></h2>

<p>La luminosit&eacute;, la saturation et le contraste sont des fonctions typiques du traitement de l'image qui peuvent &ecirc;tre appliqu&eacute;es &agrave; toute l'image ou &agrave; des extraits marqu&eacute;s auparavant.</p>

<h3>Luminosit&eacute;:</h3>

<p>Des couleurs peuvent avoir la m&ecirc;me tonalit&eacute; mais para&icirc;tre plus ou moins claires. Les comparaisons de couleurs qui suivent affichent pour chacune d'entre elles, &agrave; gauche une couleur et &agrave; droite une variante plus claire de cette couleur:</p>

<p><img src="luminosite.gif" width="200" height="128" border="0" alt="Luminosit&eacute;"></p>

<p>Pour les couleurs du c&ocirc;t&eacute; droit 25% de luminosit&eacute; en plus par rapport au c&ocirc;t&eacute; gauche ont &eacute;t&eacute; fix&eacute;s. Par la luminosit&eacute;, les couleurs <b>ne</b> deviennent <b>pas</b> plus vives! Les couleurs soutenues restent soutenues et les couleurs pastel restent pastel.</p>

<h3>Saturation:</h3>

<p>&Agrave; l'inverse de la luminosit&eacute;, la saturation influence la perception subjective du caract&egrave;re vif d'une couleur. Les comparaisons de couleurs suivantes montrent respectivement au milieu la couleur de base, &agrave; gauche une variante avec une saturation moindre et &agrave; droite une variante avec une saturation plus &eacute;lev&eacute;e:</p>

<p><img src="saturation.gif" width="300" height="128" border="0" alt="saturation"></p>

<p>En ce qui concerne la luminosit&eacute;, les diff&eacute;rents coloris ont &eacute;t&eacute; r&eacute;gl&eacute;s environ sur la m&ecirc;me luminosit&eacute;. Les couleurs avec une saturation plus ou moins &eacute;lev&eacute;e semblent certes souvent au premier coup d'&#339;il plus claires ou plus sombres mais c'est &agrave; l'&eacute;vidence une conclusion fallacieuse.</p>

<h3>Contraste:</h3>

<p>Une augmentation du contraste a pour effet que les couleurs sombres deviennent encore plus sombres et les couleurs claires encore plus claires. Les diff&eacute;rences entre les couleurs claires et les couleurs sombres sont donc accentu&eacute;es. Cela se remarque tout particuli&egrave;rement pour les photos par exemple aux changements de couleurs francs, par exemple aux c&ocirc;t&eacute;s d'une maison o&ugrave; l'un est &eacute;clair&eacute; par le soleil et l'autre &agrave; l'ombre. Si par contre le contraste est diminu&eacute;, les couleurs claires deviennent plus sombres et les couleurs sombres deviennent plus claires. Les couleurs de la photo s'uniformisent fortement. Des changements de couleurs durs paraissent plus doux, l'image appara&icirc;t tirer davantage sur les tons gris. Les comparaisons de couleurs suivantes montrent respectivement au milieu la couleur de base, &agrave; gauche une variante avec un contraste moins &eacute;lev&eacute; et &agrave; droite une variante avec un contraste plus &eacute;lev&eacute;:</p>

<p><img src="contraste.gif" width="300" height="128" border="0" alt="contraste"></p>

<p>Avec un contraste fortement &eacute;lev&eacute; les finesses dans les d&eacute;grad&eacute;s de couleurs se perdent, on en arrive &agrave; un effet d'ombre port&eacute;e. Avec un contraste fortement r&eacute;duit on en arrive &agrave; un effet de voile gris. Les trois illustrations suivantes montrent au milieu la photo de base, &agrave; gauche un contraste r&eacute;duit (voile gris) et &agrave; droite un contraste augment&eacute; (ombre port&eacute;e).</p>

<table cellpadding="0" cellspacing="0" border="0"
bgcolor="#C0C0C0"><tr><td>
<table cellpadding="2" cellspacing="1" border="0">
<tr>
<td bgcolor="#FFFFFF" valign="top">
<img src="contraste2.jpg" width="200" height="350" border="0" alt="contraste: moindre">
</td>
<td bgcolor="#FFFFFF" valign="top">
<img src="contraste1.jpg" width="200" height="350" border="0" alt="contraste: normal">
</td>
<td bgcolor="#FFFFFF" valign="top">
<img src="contraste3.jpg" width="200" height="350" border="0" alt="contraste: plus &eacute;lev&eacute;">
</td>
</tr></table>
</td></tr></table>

<p>Outre la simple correction de contraste, la plupart des bons programmes graphiques proposent une balance de correction des valeurs de tonalit&eacute;s de couleurs &agrave; l'aide de laquelle on &eacute;vite les d&eacute;fauts grossiers qui proviennent d'une forte modification du contraste.</p>




<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;</td></tr></table>
<h2 class="Sh2"><a class="an" name="histogramme">Histogramme</a></h2>

<p>Pour chaque graphique en pixels, il est possible d'&eacute;tablir un histogramme. C'est la repr&eacute;sentation de la r&eacute;partition de la luminosit&eacute; et de la couleur dans le graphique. Un syst&egrave;me d'axes sert &agrave; la repr&eacute;sentation avec les abscisses (horizontal) et les ordonn&eacute;es (vertical). Les abscisses expriment la luminosit&eacute;. L'origine de l'axe figurant pour une obscurit&eacute; maximale. Plus on avance sur l'axe, plus la luminosit&eacute; est forte. Les ordonn&eacute;es expriment le nombre de pixels dans l'image. Dans le syst&egrave;me d'axes, il est maintenant possible de lire combien de pixels ont quelle valeur de couleur ou quelle luminosit&eacute;. L'exemple suivant montre une photo et son histogramme:</p>

<table cellpadding="0" cellspacing="0" border="0"
bgcolor="#C0C0C0"><tr><td>
<table cellpadding="2" cellspacing="1" border="0">
<tr>
<td bgcolor="#FFFFFF" valign="top">
<img src="photohistogramme.jpg" width="250" height="200" border="0" alt="photo">
</td>
<td bgcolor="#FFFFFF" valign="top">
<img src="histogramme.gif" width="300" height="200" border="0" alt="histogramme">
</td>
</tr></table>
</td></tr></table>

<p>L'histogramme de cet exemple montre deux choses: premi&egrave;rement deux pics visibles, un dans la zone tr&egrave;s fonc&eacute;e et un dans la zone tr&egrave;s claire; deuxi&egrave;mement il montre que les courbes rouge, verte et bleue de l'image ont un trac&eacute; parall&egrave;le. Ce dernier point est un indice que l'image pr&eacute;sente une bonne r&eacute;partition des couleurs et que l'image n'a pas de couleur dominante. Les deux pics de la courbe de luminosit&eacute;, dans le passage de grande luminosit&eacute; et dans le passage de moins grande luminosit&eacute; annoncent cependant une forte dominance de couleurs tr&egrave;s claires et de couleurs tr&egrave;s fonc&eacute;es, ce que l'on constate aussi sur la photo.</p>

<p>Les bons programmes graphiques permettent de modifier les courbes graphiques de l'histogramme. De cette fa&ccedil;on, il est possible de rectifier la r&eacute;partition des couleurs sur la photo. Dans l'exemple ci-dessus, il serait int&eacute;ressant de tenter de r&eacute;duire le pic du passage moins lumineux, donc de ramener les valeurs RVB qui s'y trouvent plus pr&egrave;s de l'origine de l'axe des ordonn&eacute;es. Cela n'a de sens naturellement que si l'&eacute;claircissement de l'image qui s'ensuit, ne provoque pas d'horribles alt&eacute;rations des couleurs sombres. Les corrections d'images au niveau de l'histogramme exigent pour cette raison m&ecirc;me beaucoup de patience et d'essais.</p>



<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;</td></tr></table>
<h2 class="Sh2"><a class="an" name="correction_gamma">Correction Gamma</a></h2>

<p>Pour la correction Gamma il est d'abord important de savoir ce qu'est une valeur Gamma. Une valeur Gamma est, pour des graphiques &agrave; l'ordinateur, le rapport entre les valeurs de couleurs sauvegard&eacute;es dans le graphique et les valeurs de couleurs restitu&eacute;es par un p&eacute;riph&eacute;rique comme l'&eacute;cran ou l'imprimante. L'id&eacute;al serait un rapport de 1:1, ce qui revient &agrave; dire que les couleurs sorties sont exactement celles qui sont sauvegard&eacute;es  dans le fichier graphique. Ce n'est toutefois pas le cas. Les &eacute;crans par exemple ne sont pas &quot;&eacute;talonn&eacute;s&quot;. La repr&eacute;sentation des couleurs varie &eacute;norm&eacute;ment d'un &eacute;cran &agrave; l'autre et d'un syst&egrave;me d'exploitation &agrave; l'autre. Quand donc vous travaillez un graphique sur votre &eacute;cran et que vous modifiez son aspect optique avec des fonctions telles que la luminosit&eacute;, la saturation, l'histogramme etc... le r&eacute;sultat obtenu s'applique tout d'abord seulement &agrave; votre &eacute;cran. Si vous voulez pr&eacute;senter votre graphique sur la toile, il est toutefois affich&eacute; sur de tr&egrave;s nombreux &eacute;crans tr&egrave;s diff&eacute;rents.</p>

<p>Les bons programmes graphiques proposent ainsi la correction Gamma sur deux niveaux: au niveau de son propre moniteur, et au niveau de graphiques concrets. La correction Gamma pour le moniteur assure l'adaptation entre les valeurs num&eacute;riques de couleur, par exemple d'apr&egrave;s le mod&egrave;le RGB, et leur repr&eacute;sentation par le programme graphique sur votre &eacute;cran. Les r&eacute;glages de l'&eacute;cran proprement-dit demeurent inchang&eacute;s. Le correction concerne somme toute le bon r&eacute;glage de la couleur dans le programme graphique. Une repr&eacute;sentation graphique permet avec de tels programmes l'&eacute;galisation entre les valeurs de couleurs sauvegard&eacute;es et les valeurs de couleurs repr&eacute;sent&eacute;es &agrave; l'&eacute;cran. Pour la plupart des &eacute;crans d'ordinateur, vous devez r&eacute;gler une valeur Gamma de 1,5 ou plus pour obtenir une repr&eacute;sentation r&eacute;aliste des couleurs par le programme graphique. Si tous ceux qui travaillent sur des graphiques le faisaient, un grand pas serait franchi.</p>

<p>Apr&egrave;s que la correction Gamma est r&eacute;ussie pour l'&eacute;cran, la correction Gamma permet d'aplanir des probl&egrave;mes de couleurs pour des graphiques concrets. Ces probl&egrave;mes de couleurs sont li&eacute;s &agrave; la source ou l'origine du graphique. Ainsi par exemple de nombreux appareils photo num&eacute;riques prennent apparemment des photos trop sombres. Cela tient au fait que lors du calcul de la luminosit&eacute; dans les valeurs RGB qu'un appareil photo num&eacute;rique doit entreprendre lors d'une prise de vue, des in&eacute;galit&eacute;s apparaissent qui varient d'un appareil &agrave; l'autre. Par une correction Gamma, de tels probl&egrave;mes peuvent &ecirc;tre la plupart du temps bien r&eacute;solus. L'image de gauche des deux illustrations  suivantes montre l'image de base, celle de droite le r&eacute;sultat apr&egrave;s une correction Gamma (valeur Gamma 1,8):</p>

<table cellpadding="2" cellspacing="1" border="0">
<tr>
<td bgcolor="#FFFFFF" valign="top">
<img src="gamma1.jpg" width="360" height="288" border="0" alt="Photo sans  correction Gamma">
</td>
<td bgcolor="#FFFFFF" valign="top">
<img src="gamma2.jpg" width="360" height="288" border="0" alt="Photo avec correction Gamma">
</td>
</tr></table>



<p>Pour une valeur Gamma sup&eacute;rieure &agrave; 1,0 ce sont avant tout les tons moyens qui sont &eacute;claircis par rapport aux tons tr&egrave;s fonc&eacute;s ou tr&egrave;s clairs. Pour une valeur Gamma inf&eacute;rieure &agrave; 1,0, ces tons sont obscurcis. L'effet est ici tout autre que si vous essayiez par exemple d'augmenter la luminosit&eacute; du graphique.</p>





<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;</td></tr></table>
<h2 class="Sh2"><a class="an" name="filtres"> Effets de filtre</a></h2>

<p>Toute forme de manipulation d'un graphique que ce soit la luminosit&eacute;, le contraste, la saturation ou la correction Gamma est un filtre. Car au niveau de l'ordinateur, la modification de la luminosit&eacute;, du contraste etc... est li&eacute;e &agrave; un certain algorithme math&eacute;matique qui est appliqu&eacute; aux valeurs RGB sauvegard&eacute;es dans le graphique. Celles-ci sont recalcul&eacute;es par l'application de l'algorithme. Le r&eacute;sultat est alors l'aspect modifi&eacute; de l'image en fonction des nouvelles valeurs RGB de chaque pixel.</p>

<p>Tant que vous travaillez avec les fonctions standard de la manipulation de l'image, vous n'avez pas besoin de conna&icirc;tre leurs algorithmes de filtres. Dans les dialogues propos&eacute;s par le programme graphique, vous modifiez en fin de compte des param&egrave;tres mais pas les algorithmes qui sont &agrave; la base de ceux-ci. Ainsi par exemple, vous r&eacute;glez la valeur d&eacute;sir&eacute;e pour la saturation, mais vous ne savez pas comment le programme graphique calcule, pour, &agrave; partir de cette valeur fix&eacute;e, recalculer les valeurs RGB de chaque pixel.</p>

<p>Les bons programmes graphiques des dialogues pour toute une s&eacute;rie d'autres filtres. On y compte des standard comme des effets de relief, de bruit d'att&eacute;nuation etc... Outre ceux-ci, certains programmes offrent aussi ce qu'on appelle une interface plugicielle pour des filtres. Celle-ci permet d'&eacute;crire ses propres filtres quelconques qui font agir l'algorithme sur les valeurs RGB d'un graphique. Un algorithme pourrait par exemple s'&eacute;noncer: soustrais 50 de toutes les valeurs rouges sup&eacute;rieures &agrave; 200, 100 de toutes les valeurs vertes sup&eacute;rieures &agrave; 200 et 150 de toutes les valeurs bleues sup&eacute;rieures &agrave; 200. Ou bien: fixe sur un blanc pur donc sur 255,255,255 les valeurs de tous les pixels dont la valeur rouge, la valeur verte et la valeur bleue est sup&eacute;rieure &agrave; 200.</p>

<p>Les filtres peuvent ex&eacute;cuter des t&acirc;ches tout &agrave; fait diff&eacute;rentes, par exemple:</p>

<ul>
<li>Ex&eacute;cuter des corrections d'erreurs dans les photos (par exemple des corrections de couleur)</li>
<li>Obtenir des effets int&eacute;ressants (par exemple un effet de puzzle ou des effets d'att&eacute;nuation)</li>
<li>Faire ressentir des effets optiques standard (par exemple &eacute;clairage sur un c&ocirc;t&eacute; ou clart&eacute; de la lune)</li>
<li>Cr&eacute;ation de  graphiques compl&egrave;tement nouveaux et imaginaires (ici le graphique de base n'est utilis&eacute; que comme &quot;entr&eacute;e al&eacute;atoire&quot;)</li>
</ul>

<p>Les illustration suivantes montrent l'application de quelques filtres sur une photo de base:</p>

<table cellpadding="0" cellspacing="0" border="0"
bgcolor="#C0C0C0"><tr><td>
<table cellpadding="10" cellspacing="1" border="0">
<tr>
<td bgcolor="#FFFFFF" valign="top">
<img src="imageafiltrer.jpg" width="250" height="200" border="0" alt="image &agrave; filtrer">
</td>
<td bgcolor="#FFFFFF" valign="top">
Image de base
</td>
</tr><tr>
<td bgcolor="#FFFFFF" valign="top">
<img src="filtre1.jpg" width="250" height="200" border="0" alt="filtre 1">
</td>
<td bgcolor="#FFFFFF" valign="top">
filtre, qui donne l'effet d'une d&eacute;formation
</td>
</tr><tr>
<td bgcolor="#FFFFFF" valign="top">
<img src="filtre2.jpg" width="250" height="200" border="0" alt="filtre 2">
</td>
<td bgcolor="#FFFFFF" valign="top">
filtre, qui donne l'effet d'un dessin au fusain
</td>
</tr><tr>
<td bgcolor="#FFFFFF" valign="top">
<img src="filtre3.jpg" width="250" height="200" border="0" alt="filtre 3">
</td>
<td bgcolor="#FFFFFF" valign="top">
filtre, qui donne l'effet d'un &eacute;clairage au projecteur
</td>
</tr><tr>
<td bgcolor="#FFFFFF" valign="top">
<img src="filtre4.jpg" width="250" height="200" border="0" alt="filtre 4">
</td>
<td bgcolor="#FFFFFF" valign="top">
filtre, qui utilise le graphique pour la cr&eacute;ation d'un motif
</td>
</tr></table>
</td></tr></table><br>&nbsp;




<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;</td></tr></table>
<h2 class="Sh2"><a class="an" name="anti_crenelage">Anti-cr&eacute;nelage</a></h2>

<p>L' anti-cr&eacute;nelage est un algorithme pour les  graphiques en pixels, qui permet d'att&eacute;nuer les effets d'escaliers visibles sur des bords francs ou aux changements de couleurs dans les graphiques. Vous pouvez bien observer l'effet sur les graphiques suivants:</p>


<table cellpadding="0" cellspacing="0" border="0"
bgcolor="#C0C0C0"><tr><td>
<table cellpadding="10" cellspacing="1" border="0">
<tr>
<td bgcolor="#FFFFFF" valign="middle" align="center">
<img src="antialias2.gif" width="200" height="50" border="0" alt="">
</td>
<td bgcolor="#FFFFFF" valign="middle" align="center">
sans anti-cr&eacute;nelage
</td>
<td bgcolor="#FFFFFF" valign="middle" align="center">
<img src="antialias4.gif" width="132" height="50" border="0" alt="">
</td>
<td bgcolor="#FFFFFF" valign="middle" align="center">
(agrandissement partiel)
</td>
</tr><tr>
<td bgcolor="#FFFFFF" valign="middle" align="center">
<img src="antialias1.gif" width="200" height="50" border="0" alt="">
</td>
<td bgcolor="#FFFFFF" valign="middle" align="center">
avec anti-cr&eacute;nelage
</td>
<td bgcolor="#FFFFFF" valign="middle" align="center">
<img src="antialias3.gif" width="135" height="50" border="0" alt="">
</td>
<td bgcolor="#FFFFFF" valign="middle" align="center">
(agrandissement partiel)
</td>
</tr><tr>
<td bgcolor="#FFFFFF" valign="middle" align="center">
<img src="antialias6.gif" width="50" height="50" border="0" alt="">
</td>
<td bgcolor="#FFFFFF" valign="middle" align="center">
sans anti-cr&eacute;nelage
</td>
<td bgcolor="#FFFFFF" valign="middle" align="center">
<img src="antialias8.gif" width="143" height="50" border="0" alt="">
</td>
<td bgcolor="#FFFFFF" valign="middle" align="center">
(agrandissement partiel)
</td>
</tr><tr>
<td bgcolor="#FFFFFF" valign="middle" align="center">
<img src="antialias5.gif" width="50" height="50" border="0" alt="">
</td>
<td bgcolor="#FFFFFF" valign="middle" align="center">
avec anti-cr&eacute;nelage
</td>
<td bgcolor="#FFFFFF" valign="middle" align="center">
<img src="antialias7.gif" width="143" height="50" border="0" alt="">
</td>
<td bgcolor="#FFFFFF" valign="middle" align="center">
(agrandissement partiel)
</td>
</tr></table>
</td></tr></table>



<p>Les agrandissements partiels montrent le principe de l'anti-cr&eacute;nelage. Avec  l'anti-cr&eacute;nelage , les effets d'escaliers sont att&eacute;nu&eacute;s pour des traits obliques ou des arrondis, en leur ajoutant des tonalit&eacute;s de couleurs feutr&eacute;es.</p>

<p>En particulier pour de l'&eacute;criture dans des graphiques, l'anti-cr&eacute;nelage est un moyen pour plus de professionnalisme. Mais m&ecirc;me pour d'autres objets avec obliques et courbes, l'anti-cr&eacute;nelage permet d'adoucir les bords et d'&eacute;viter de voir l'escalier des pixels.</p>

<p>Les bons programmes graphiques soutiennent l'effet anti-cr&eacute;nelage. Le probl&egrave;me r&eacute;side en ce que les graphiques en pixels de contiennent pas d'&quot;objets&quot; que l'on puisse simplement marquer pour leur affecter des propri&eacute;t&eacute;s -comme par exemple l'anti-cr&eacute;nelage. Quelques programmes offrent la possibilit&eacute; de marquer comme objet des passages de pixels, repr&eacute;sentant un dessin coh&eacute;rent (Un moyen d'aide pour le faire est ce qu'on appelle le plus souvent la &quot;baguette magique&quot;). Vous pouvez alors affecter aux objets marqu&eacute;s la propri&eacute;t&eacute; de l'anti-cr&eacute;nelage. Pour les cr&eacute;ations nouvelles d'&eacute;l&eacute;ments comme des inscriptions ou des figures g&eacute;om&eacute;triques, vous pouvez par contre fixer d'embl&eacute;e l'effet anti-cr&eacute;nelage.</p>






<table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr><td colspan="2" bgcolor="#EEEEEE" class="doc">
&#160;<a href="#top"><img src="../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a>
</td></tr>
<tr><td bgcolor="#EEEEEE" class="doc" align="right"><a href="gifs_animes.htm"><img src="../src/suivant.gif" width="10" height="10" border="0" hspace="10" alt="page suivante"></a></td>
<td bgcolor="#FFFFFF"><img src="../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information"> <a href="gifs_animes.htm"><b>Graphiques GIF anim&eacute;s </b></a>
</td></tr>
<tr>
<td bgcolor="#EEEEEE" class="doc" align="right"><a href="sortes.htm"><img src="../src/precedent.gif" width="10" height="10" border="0" hspace="10" alt="page pr&eacute;c&eacute;dente"></a></td>
<td bgcolor="#FFFFFF" width="100%"><img src="../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information"> <a href="sortes.htm"><b>Sortes de graphiques typiques sur les pages Web</b></a>
</td>
</tr>
<tr><td colspan="2" bgcolor="#EEEEEE" class="doc">&#160;</td></tr>
</table><table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr>
<td bgcolor="#FFEEDD" class="nav"><a class="an" name="bottom"><img src="../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"></a> <a href="../index.htm"><b>SELFHTML</b></a>/<a href="../navigation/index.htm" target="_parent">Aides &agrave; la navigation</a> <img src="../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="index.htm"><b>Graphisme</b></a></td>
</tr>
</table>

<p>&copy; 2001 Stefan M&uuml;nz / &copy; 2003 Traduction <img src="../../src/courriel.gif" width="15" height="10" border="0" alt="Adresse &eacute;lectronique">&nbsp;<a href="mailto:13405@free.fr">Serge Fran&ccedil;ois, 13405@free.fr</a><br><img src="../../src/courriel.gif" width="15" height="10" border="0" alt="Adresse &eacute;lectronique">&nbsp;<a href="mailto:selfhtml@selfhtml.com.fr">selfhtml@selfhtml.com.fr</a></p>



</body>
</html>
