<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>SELFHTML: Introduction / Aides / Support</title>
<link rel="stylesheet" type="text/css" href="../../src/selfhtml.css">
<meta name="description"    content="Comment vous pouvez obtenir de l'aide lors de la cr&eacute;ation de pages Web, et &agrave; quoi vous devez veiller pour ne heurter personne.">
<meta name="keywords"       content="SELFHTML, aide, support, assistance">
<meta name="author"         content="Stefan M&uuml;nz, selfhtml@teamone.de">
<meta http-equiv="content-type" content="text/html; charset=ISO-8859-1">
<meta name="DC.Publisher"   content="Serge Fran&ccedil;ois, selfhtml@selfhtml.com.fr">
<meta name="DC.Date"        content="2003-01-27T08:00+00:00">
<meta name="DC.Identifier"  content="http://selfhtml.selfhtml.com.fr/introduction/aide/aide.htm">
<meta name="DC.Language"    content="fr">
<meta name="DC.Rights"      content="../../editorial/copyright.htm">
<meta name="DC.Date.Create" content="2003-01-27T08:00+00:00">
<meta name="SELF.Version"   content="1">
<meta name="SELF.Pagetype"  content="Information">
<meta name="SELF.Path"      content="SELFHTML == ../../index.htm // Introduction == ../index.htm // Aides == index.htm">
<!-- Matomo -->
<script type="text/javascript">
  var _paq = window._paq = window._paq || [];
  /* tracker methods like "setCustomDimension" should be called before "trackPageView" */
  _paq.push(['trackPageView']);
  _paq.push(['enableLinkTracking']);
  (function() {
    var u="//matomo.boitasite.com/";
    _paq.push(['setTrackerUrl', u+'matomo.php']);
    _paq.push(['setSiteId', '1']);
    var d=document, g=d.createElement('script'), s=d.getElementsByTagName('script')[0];
    g.type='text/javascript'; g.async=true; g.src=u+'matomo.js'; s.parentNode.insertBefore(g,s);
  })();
</script>
<!-- End Matomo Code -->
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#AA5522" vlink="#772200" alink="#000000">

<table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr>
<td bgcolor="#FFEEDD" class="nav"><a class="an" name="top"><img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"></a> <a href="../../index.htm"><b>SELFHTML</b></a>/<a href="../../navigation/index.htm" target="_parent">Aides &agrave; la navigation</a> <img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="../index.htm"><b>Introduction</b></a> <img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="index.htm"><b>Aides</b></a></td>
</tr>
</table><table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr>
<td bgcolor="#EEEEEE" class="doc" width="110"><img src="../../src/logo.gif" width="106" height="109" border="0" alt="SELFHTML"></td>
<td bgcolor="#EEEEEE" class="doc" valign="bottom" width="100%"><h2>Support</h2>
<tr>
<td bgcolor="#EEEEEE" class="doc" valign="top" align="center">
<img src="../../src/docx.gif" width="30" height="20" vspace="6" border="0" alt="Page d'information: vue d'ensemble">
</td>
<td bgcolor="#FFFFFF" valign="top" nowrap>
<p>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#ou"><b>O&ugrave; trouver de l'aide</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#comment"><b>Comment fonctionne cette aide b&eacute;n&eacute;vole</b></a><br>
</p>
</td>
</tr><tr><td colspan="2" bgcolor="#EEEEEE" class="doc">&#160;<a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;</td></tr>
</table>



<h2 class="Sh2"><a class="an" name="ou">O&ugrave; trouver de l'aide</a></h2>

<p>Quand vous &ecirc;tes confront&eacute;s pendant des heures &agrave; des probl&egrave;mes du genre que Netscape repr&eacute;sente un tableau autrement que L'Explorer Internet ou que vous recevez des messages d'erreur que vous ne comprenez pas dans un JavaScript alors vous d&eacute;sirerez vraisemblablement le &quot;tuyau d&eacute;cisif&quot;. Car une seule indication suffit souvent pour repartir sur le bon chemin et r&eacute;soudre un probl&egrave;me.</p>

<p>Vous n'&ecirc;tes pourtant pas le seul &agrave; conna&icirc;tre de tels probl&egrave;mes. Des milliers d'autres ont les m&ecirc;mes probl&egrave;mes, des probl&egrave;mes semblables ou d'autres probl&egrave;mes lorsqu'ils cr&eacute;ent leurs pages. D'un autre c&ocirc;t&eacute;, il sont nombreux aussi ceux qui prennent le temps de pr&ecirc;ter assistance aux autres. Cet ensemble induit &agrave; ce qu'il y ait sur la toile des endroits tr&egrave;s bien visit&eacute;s o&ugrave; l'&eacute;change d'exp&eacute;rience dans la cr&eacute;ation de pages Web ou la programmation etc. est possible.</p>

<p>Le plus grand et sans doute le plus comp&eacute;tent des syst&egrave;mes &quot;Comment faire&quot; de questions sur Internet est bien le  <b>Usenet</b> avec ses <img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="../internet/services.htm#news"><b>Newsgroups</b></a> (groupes de nouvelles). En langue fran&ccedil;aise, existent d&eacute;j&agrave; des groupes de nouvelles sur  HTML/CSS, sur JavaScript, sur CGI/Perl, sur XML etc.</p>

<p>La participation est gratuite, il vous faut pourtant un News-Reader (lecteur de nouvelles) (sous Windows suffit par exemple le programme de courriel Outlook Express, qui fait partie du paquet livr&eacute; avec l'Explorer Internet). En outre, vous avez besoin d'un serveur de nouvelles avec lequel vous pouvez recevoir les groupes de discussion. Demandez &agrave; votre fournisseur d'acc&egrave;s Internet s'il propose un tel serveur, au cas o&ugrave; vous ne connaissez pas de tel serveur de nouvelles. Veillez, au cas o&ugrave; vous recherchez un fournisseur d'acc&egrave;s &agrave; ce qu'il propose un tel serveur de groupe de nouvelles. Chez la plupart des serveurs de nouvelles, vous devez entrer votre identification et votre mot de passe. Vous recevez l'un et l'autre du fournisseur de serveur de nouvelles, en r&egrave;gle g&eacute;n&eacute;rale de votre fournisseur d'acc&egrave;s.</p>

<p>&Agrave; c&ocirc;t&eacute; de ces groupes de nouvelles, les <b>forums de discussions bas&eacute;s sur le Web</b> prennent aussi une importance croissante. Il y a m&ecirc;me des offres Web qui ne proposent rien d'autre que des forums sur certains th&egrave;mes. D'autres encore proposent des informations sur ces th&egrave;mes et sont branch&eacute;s &agrave; un forum.</p>

<p>Les forum bas&eacute;s sur le Web n'ont pas encore, la plupart du temps une tradition aussi longue que les groupe de nouvelles et les fournisseurs de forums sont souvent inexp&eacute;riment&eacute;s dans le r&ocirc;le d'un &quot;tavernier virtuel&quot;. La qualit&eacute;, l'aura et la fr&eacute;quences des visites peuvent diff&eacute;rer sensiblement d'un forum &agrave; l'autre. La plupart des forums peuvent &ecirc;tre utilis&eacute;s gratuitement, certains exigent cependant une ouverture de session nominative.</p>

<p>Dans le cas o&ugrave; vous n'aimez pas trop envoyer des messages publiquement, il y a encore la possibilit&eacute; de s'abonner &agrave; des  <b>listes de publipostage</b> qui traitent d'un sujet sp&eacute;cialis&eacute;. Pour participer &agrave; une liste de publipostage, un programme de courriel suffit. Vous vous abonnez &agrave; une liste de publipostage en envoyant un courriel au contenu d&eacute;termin&eacute; &agrave; une adresse &eacute;lectronique d&eacute;termin&eacute;e - De nombreuses liste de publipostage permettent &eacute;galement entre-temps de s'abonner en remplissant un formulaire Web. Quand vous vous &ecirc;tes abonn&eacute; &agrave; une liste de publipostage, vous recevez tous les courriels envoy&eacute;s &agrave; cette liste. Vous pouvez vous-m&ecirc;me envoyer des courriels &agrave; la liste. Ils seront alors envoy&eacute;s &agrave; tous les participants &agrave; cette liste.</p>

<p>Dans l'index des liens de l'offre en ligne de SELFHTML actuel vous trouverez d'autres liens importants et actuels aux groupes de nouvelles comp&eacute;tents, aux forums bas&eacute;s sur le Web et aux listes de publipostage qui traitent de la cr&eacute;ation de pages Web.:</p>

<p><img src="../../src/serverdoc.gif" width="15" height="10" border="0" alt="Page d'information: connexion exig&eacute;e">&nbsp;
<a href="http://www.selfhtml.com.fr/liens/forums.htm"><b>Index des liens SELFHTML: Forums, groupes de nouvelles, listes de publipostage</b></a></p>

<p>Tous ces lieux de discussion sur la toile sont con&ccedil;us principalement pour des probl&egrave;mes concernant les technologies ind&eacute;pendantes de tout logiciel telles que HTML, CSS, XML etc. ou pour des probl&egrave;mes concernant des technologies bas&eacute;es sur le gratuiciel telles que Perl, PHP etc. Si vous avez achet&eacute; le logiciel et que vous connaissez des probl&egrave;mes avec ce produit, c'est toujours le fournisseur du produit qui est le premier endroit o&ugrave; poser vos questions. Ainsi des grands fournisseurs de logiciels tels que  Microsoft, Macromedia ou Adobe ont-ils en plus du central t&eacute;l&eacute;phonique habituel leur propre forum de discussions sur leurs pages Web ou leur groupe de nouvelles.</p>






<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="comment">Comment fonctionne cette aide b&eacute;n&eacute;vole</a></h2>

<p>L'aide b&eacute;n&eacute;vole telle qu'elle est assur&eacute;e dans les diff&eacute;rentes sortes de discussion cit&eacute;es plus haut est fond&eacute;e sur le principe prendre et donner. Si en tant que d&eacute;butant, vous chercher et trouvez plusieurs fois de l'aide dans ces lieux de discussion alors, il est simplement loyal par rapport aux autres participants que plus tard, vous aussi r&eacute;pondiez &agrave; quelques questions dans la mesure o&ugrave; vous en connaissez la r&eacute;ponse. De tels lieux de discussions vivent de la disponibilit&eacute; de tous les participants &agrave; s'aider mutuellement. Avec une mentalit&eacute; du type &quot;Aidez-moi, tout de suite, vite!&quot; vous serez vite importun et dans la plupart des endroits nomm&eacute;s les choses qui vous viendront aux oreilles ne seront pas forc&eacute;ment formul&eacute;es tr&egrave;s d&eacute;licatement. Pour les standards et technologies ouverts vous n'&ecirc;tes pas un consommateur prot&eacute;g&eacute; avec des droits de reprise du produit, garantie de fonctionnement et service tout compris. Un groupe de nouvelles ou un forum de discussions ne sont pas un commerce o&ugrave; vous auriez achet&eacute; un produit. Si toutefois vous employez le ton qui convient, vous recevez dans ce genre d'endroits une aide souvent bien plus &eacute;tendue et engag&eacute;e que l&agrave; o&ugrave; vous pourriez pr&eacute;tendre &agrave; une aide contractuelle &agrave; la suite d'une vente.</p>

<p>&quot;Avoir un ton correct&quot; concerne moins l'habilet&eacute; rh&eacute;torique. On attend pas de vous des hautes performances linguistiques si vous demandez quelque chose, pourtant quelques d&eacute;tails encore:</p>

<ul>
<li>Essayez dans un premier temps, ce qui est en votre pouvoir pour r&eacute;soudre un probl&egrave;me. Pour des lecteurs de forum exp&eacute;riment&eacute;s il est facile de remarquer si vous avez d&eacute;j&agrave; recherch&eacute; vous-m&ecirc;me des solutions ou si vous posez la question par paresse.</li>
<li>Choisissez un titre adapt&eacute; &agrave; votre article. Les titres tels que  &quot;Probl&egrave;me JavaScript!&quot; ne sont pas des plus explicites sur un forum o&ugrave; on ne traite rien d'autre que JavaScript. Le titre doit permettre de reconna&icirc;tre o&ugrave; se situe le probl&egrave;me sans &ecirc;tre trop long. Le probl&egrave;me lui-m&ecirc;me doit &ecirc;tre d&eacute;crit dans le texte de l'article.</li>
<li>D&eacute;crivez votre probl&egrave;me aussi exactement que possible. D&eacute;crivez le contexte du test dans lequel vous rencontrez le probl&egrave;me, quels messages d'erreur vous recevez &eacute;ventuellement et ce que vous avez d&eacute;j&agrave; essay&eacute; pour r&eacute;soudre le probl&egrave;me. Joignez aussi &eacute;ventuellement des extraits des textes sources dont vous pensez qu'ils sont &agrave; l'origine du probl&egrave;me - Ne copiez pourtant pas des pages enti&egrave;res de texte source dans un article de discussion, vous ne feriez qu'irriter les lecteurs. Une solution id&eacute;ale si vous avez des pages avec des probl&egrave;mes est de les transmettre sur le Web &agrave; une adresse o&ugrave; ne m&egrave;ne aucun lien et de mentionner l'adresse dans la question.</li>
<li>Apportez un peu de cordialit&eacute; dans les groupes de discussion et un peu de respect en ne perdant pas de vue que vous vous adressez &agrave; vos semblables et non pas &agrave; un r&eacute;pondeur. Ne fa&icirc;tes pas l'&eacute;conomie d'une formule d&eacute;contract&eacute;e et aimable comme &quot;Bonjour &agrave; toutes et &agrave; tous!&quot; - Dans les endroits de discussion pour un public plus jeune, suffit aussi un &quot;salut!&quot; laconique. Employez votre vrai nom et donnez au cas o&ugrave; vous y &ecirc;tes contraint par exemple dans le formulaire pour un article dans un forum Web, votre v&eacute;ritable adresse &eacute;lectronique. Cela cr&eacute;e un climat de confiance et augmente les chances d'avoir des r&eacute;ponses utilisables. Dans la plupart des endroits o&ugrave; on discute, tous se tutoient. Vous verrez de toutes fa&ccedil;ons assez vite vous-m&ecirc;me si vous lisez les articles, ce qu'il vous faut faire avant d'&eacute;crire vous-m&ecirc;me  un article.</li>
<li>Lisez &eacute;galement, avant d'&eacute;crire un article pour la premi&egrave;re fois, les <img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="docs.htm#faqs"><b>questions r&eacute;currentes</b></a>, qui existent pour la plupart des groupes de nouvelles, forums et listes de publipostage. L&agrave; est mentionn&eacute; exactement ce qui est souhait&eacute; ou ind&eacute;sirable dans le groupe de discussion concern&eacute;, quelles sources il vous faut conna&icirc;tre avant de poser une question etc. Les questions pos&eacute;es effectivement le plus souvent y sont nomm&eacute;es la plupart du temps avec leur r&eacute;ponse.</li>
</ul>

<p>&Agrave; vrai dire ces quelques r&egrave;gles de base devraient couler de source, pourtant malheureusement elles sont toujours plus souvent enfreintes. Dans les forums de discussion et groupes de nouvelles, il n'est pas rare de rencontrer des gens en d&eacute;tresse sociale et avares de contact qui adoptent des comportements extr&ecirc;mes en essayant de provoquer le groupe ou trouvent un malin plaisir &agrave; d&eacute;truire des discussions par des r&eacute;ponses monosyllabiques ou inappropri&eacute;es. En r&egrave;gle g&eacute;n&eacute;rale, le meilleur moyen pour contrer est de garder son calme sans se laisser provoquer.</p>




<table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr><td colspan="2" bgcolor="#EEEEEE" class="doc">
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a>
</td></tr>
<tr><td bgcolor="#EEEEEE" class="doc" align="right"><a href="../hypertexte/definitions.htm"><img src="../../src/suivant.gif" width="10" height="10" border="0" hspace="10" alt="page suivante"></a></td>
<td bgcolor="#FFFFFF"><img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information"> <a href="../hypertexte/definitions.htm"><b>D&eacute;finitions sur l' &quot;hypertexte&quot;</b></a>
</td></tr>
<tr>
<td bgcolor="#EEEEEE" class="doc" align="right"><a href="services.htm"><img src="../../src/precedent.gif" width="10" height="10" border="0" hspace="10" alt="page pr&eacute;c&eacute;dente"></a></td>
<td bgcolor="#FFFFFF" width="100%"><img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information"> <a href="services.htm"><b>Services sur la toile</b></a>
</td>
</tr>
<tr><td colspan="2" bgcolor="#EEEEEE" class="doc">&#160;</td></tr>
</table><table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr>
<td bgcolor="#FFEEDD" class="nav"><a class="an" name="bottom"><img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"></a> <a href="../../index.htm"><b>SELFHTML</b></a>/<a href="../../navigation/index.htm" target="_parent">Aides &agrave; la navigation</a> <img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="../index.htm"><b>Introduction</b></a> <img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="index.htm"><b>Aides</b></a></td>
</tr>
</table>

<p>&copy; 2001 Stefan M&uuml;nz / &copy; 2003 Traduction <img src="../../src/courriel.gif" width="15" height="10" border="0" alt="Adresse &eacute;lectronique">&nbsp;<a href="mailto:13405@free.fr">Serge Fran&ccedil;ois, 13405@free.fr</a><br><img src="../../src/courriel.gif" width="15" height="10" border="0" alt="Adresse &eacute;lectronique">&nbsp;<a href="mailto:selfhtml@selfhtml.com.fr">selfhtml@selfhtml.com.fr</a></p>



</body>
</html>
