<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>SELFHTML: Introduction / Aides / Documents et documentations</title>
<link rel="stylesheet" type="text/css" href="../../src/selfhtml.css">
<meta name="description"    content="Quels documents officiels et semi-officiels importants et quelle place accorder aux autres documentations.">
<meta name="keywords"       content="SELFHTML, Aides, documents, documentations, Draft,recommandations, Recommendation, RFC, Request for Comment, FAQs, questions r&eacute;currentes, Frequently asked Questions, livres, livres sp&eacute;cialis&eacute;s">
<meta name="author"         content="Stefan M&uuml;nz, selfhtml@teamone.de">
<meta http-equiv="content-type" content="text/html; charset=ISO-8859-1">
<meta name="DC.Publisher"   content="Serge Fran&ccedil;ois, selfhtml@selfhtml.com.fr">
<meta name="DC.Date"        content="2003-01-27T08:00+00:00">
<meta name="DC.Identifier"  content="http://selfhtml.selfhtml.com.fr/introduction/aide/docs.htm">
<meta name="DC.Language"    content="fr">
<meta name="DC.Rights"      content="../../editorial/copyright.htm">
<meta name="DC.Date.Create" content="2003-01-27T08:00+00:00">
<meta name="SELF.Version"   content="1">
<meta name="SELF.Pagetype"  content="Information">
<meta name="SELF.Path"      content="SELFHTML == ../../index.htm // Introduction == ../index.htm // Aides == index.htm">
<!-- Matomo -->
<script type="text/javascript">
  var _paq = window._paq = window._paq || [];
  /* tracker methods like "setCustomDimension" should be called before "trackPageView" */
  _paq.push(['trackPageView']);
  _paq.push(['enableLinkTracking']);
  (function() {
    var u="//matomo.boitasite.com/";
    _paq.push(['setTrackerUrl', u+'matomo.php']);
    _paq.push(['setSiteId', '1']);
    var d=document, g=d.createElement('script'), s=d.getElementsByTagName('script')[0];
    g.type='text/javascript'; g.async=true; g.src=u+'matomo.js'; s.parentNode.insertBefore(g,s);
  })();
</script>
<!-- End Matomo Code -->
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#AA5522" vlink="#772200" alink="#000000">

<table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr>
<td bgcolor="#FFEEDD" class="nav"><a class="an" name="top"><img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"></a> <a href="../../index.htm"><b>SELFHTML</b></a>/<a href="../../navigation/index.htm" target="_parent">Aides &agrave; la navigation</a> <img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="../index.htm"><b>Introduction</b></a> <img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="index.htm"><b>Aides</b></a></td>
</tr>
</table><table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr>
<td bgcolor="#EEEEEE" class="doc" width="110"><img src="../../src/logo.gif" width="106" height="109" border="0" alt="SELFHTML"></td>
<td bgcolor="#EEEEEE" class="doc" valign="bottom" width="100%"><h2>Documents et documentations</h2>
<tr>
<td bgcolor="#EEEEEE" class="doc" valign="top" align="center">
<img src="../../src/docx.gif" width="30" height="20" vspace="6" border="0" alt="Page d'information: vue d'ensemble">
</td>
<td bgcolor="#FFFFFF" valign="top" nowrap>
<p>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#generalites"><b>G&eacute;n&eacute;ralit&eacute;s sur les documents et documentations</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#recommandations"><b>Recommandations du consortium W3</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#rfcs"><b>Documents RFC(RFCs)</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#questions"><b>Questions r&eacute;currentes(FAQs)</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#fournisseur"><b>Documentations de fournisseurs</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#libre"><b>Documentations libres</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#livres"><b>Livres</b></a><br>
</p>
</td>
</tr><tr><td colspan="2" bgcolor="#EEEEEE" class="doc">&#160;<a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;</td></tr>
</table>



<h2 class="Sh2"><a class="an" name="generalites">G&eacute;n&eacute;ralit&eacute;s sur les documents et documentations</a></h2>

<p>La quantit&eacute; de techniques et de technologies qui ont cours et qui sont mises en &#339;uvre sur la toile et sur Internet en g&eacute;n&eacute;ral est &eacute;norme. Aucun n'est en mesure de  conna&icirc;tre et ma&icirc;triser tout ce qui en fait partie. C'est pourquoi il est d'une importance vitale que toutes ces techniques et technologies mises en &#339;uvre soient bien document&eacute;es et le soient compl&egrave;tement, et que ces documentations soient accessibles et visibles par tous. La documentation technique sur Internet est le sel de la terre. Sans documentation. il n'y aurait pas d'Internet - car les techniques et technologies seules resteraient li&eacute;es &agrave; la t&ecirc;te de ceux qui les ma&icirc;trisent et ne se propageraient pas et tomberaient vite dans l'oubli. La documentation est donc la culture &eacute;crite d'Internet et les fondements de sa stabilit&eacute;. La plupart des gens qui se plongent vraiment &agrave; fond dans Internet, le comprennent aussi t&ocirc;t ou tard. Dans les d&eacute;cennies qui ont vu le r&eacute;seau gagner en exp&eacute;rience, certains standards se sont impos&eacute;s en publiant leur documentation. Cela concerne aussi bien l'art et la mani&egrave;re de d&eacute;crire que sa caract&eacute;ristique de force obligatoire.</p>

<p>En tant que d&eacute;veloppeur de pages Web, vous ne vous en sortirez pas avec une documentation comme celle-ci, &agrave; elle seule, m&ecirc;me si celle-ci peut para&icirc;tre si vaste et si compl&egrave;te. Car d'un c&ocirc;t&eacute; il y a des documents qui traitent simplement compl&egrave;tement des th&egrave;mes sp&eacute;ciaux ce qui dans le cadre d'une documentation g&eacute;n&eacute;rale comme celle-ci n'est en aucun cas possible. Et d'autre part, il y a des documents qui ont un  caract&egrave;re plus &eacute;lev&eacute; de force obligatoire que la documentation que vous &ecirc;tes en train de lire. Car ce n'est pas ce qui figure ici qui est par exemple la r&eacute;f&eacute;rence pour la fa&ccedil;on d'&eacute;crire en HTML, mais c'est ce qui se trouve dans le document officiel pr&eacute;vu &agrave; cet effet du consortium W3. Les diff&eacute;rentes formes de documentation ont toutes leur objectif et l'existence de toutes est justifi&eacute;e. Mais vous devez conna&icirc;tre les diff&eacute;rences et savoir quelle forme de documentation sert &agrave; quoi. Et enfin vous devez naturellement savoir aussi comment acc&eacute;der aux document correspondants.</p>

<p>Pratiquement tous les documents importants sur Internet sont en anglais. Nombre d'entre eux ne sont pas traduits et quand ils le sont, c'est la version anglaise qui fait foi pour les bases de la norme. La mise en &#339;uvre d'aide &agrave; la traduction automatique conduit en r&egrave;gle g&eacute;n&eacute;rale avec ce genre de textes &agrave; des moments divertissants et n'est pas d'une grande aide pour la compr&eacute;hension du texte. De bonnes connaissances de la langue anglaise sont donc une condition pr&eacute;alable importante pour permettre la lecture des documents originaux.</p>



<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="recommandations">Recommandations du consortium W3</a></h2>

<p>Le consortium W3 est un organe ind&eacute;pendant se contr&ocirc;lant lui-m&ecirc;me et comp&eacute;tent pour les standards techniques du Web. Les recommandations (<i>recommendations</i>) du consortium W3 sont des documents qui sont disponibles sur le Web et qui sont les plus officiels. Il s'agit ici de descriptions techniques de diff&eacute;rentes technologies du Web comme par exemple <img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="../technologies/html.htm"><b>HTML</b></a>, <img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="../technologies/css.htm"><b>CSS</b></a> ou <img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="../technologies/xml.htm"><b>XML</b></a>. Les  Recommandations ont pour but de repr&eacute;senter la technologie concern&eacute;e, compl&egrave;tement et sans ambigu&iuml;t&eacute;. Les groupes cibl&eacute;s par ces descriptions sont d'un c&ocirc;t&eacute; les auteurs Web, mais aussi les fabricants de logiciels, comme par exemple de navigateurs qui sont tenus d'implanter ces standards aussi exactement et compl&egrave;tement que possible dans leurs produits. Cette exigence quant &agrave; l'exactitude et l'int&eacute;gralit&eacute; ne rendent pas forc&eacute;ment la lecture de ces recommandations tr&egrave;s facile pour les d&eacute;butants. Car il n'est pas rare que la compr&eacute;hension g&eacute;n&eacute;rale ait &agrave; souffrir des contraintes de la terminologie. Le consortium W3 est pourtant conscient que ces documents sont lus ou doivent &ecirc;tre lus en partie par des gens moins sp&eacute;cialis&eacute;s ou non-informaticiens. Les recommandations les plus r&eacute;centes sont pour cette raison plus explicites que les anciennes. On n'y fait plus non plus l'&eacute;conomie d'exemples bien clairs.</p>

<p>Chaque recommandation suit un long processus au cours duquel le document est examin&eacute; plusieurs fois sous toutes ses coutures. &Agrave; partir des notices techniques en vrac, se cr&eacute;ent dans un premier temps les <b>Working Drafts</b> (<i>projets de travail</i>), dont il peut y avoir un ou plusieurs exemplaires. Les projets de travail laissent bien entrevoir le document final pr&eacute;vu. Ils ne sont pourtant pas encore officiels. Apr&egrave;s diverses refontes dans le groupe de travail et l'accord du groupe d'int&eacute;r&ecirc;t, le document obtient enfin le statut de &quot;<b>Candidate Recommendation</b>&quot; (<i>candidat &agrave; la recommandation</i>). &Agrave; ce stade on attend encore un avis du public pour un remaniement &eacute;ventuel. Ce qui donne naissance &agrave; la  &quot;<b>Proposed Recommendation</b>&quot; (<i>proposition de recommandation</i>).
Apr&egrave;s une relecture finale, le document re&ccedil;oit enfin le statut d'une &quot;<b>Recommendation</b>&quot; officielle.</p>

<p>Le d&eacute;veloppement de la technologie concern&eacute;e n'est naturellement pas termin&eacute; pour autant. Il s'agit en fin de compte d'un stade de d&eacute;veloppement fix&eacute; par &eacute;crit, pour que les d&eacute;veloppeurs aient des points de rep&egrave;re auxquels ils puissent se tenir. Les Recommandations re&ccedil;oivent pour cette raison des num&eacute;ros de version, un peu comme les produits logiciels. Ainsi par exemple, il y a  HTML 4.01, CSS 2.0 ou XML 1.0. Pour des nouvelles versions du document, le processus d'examen est r&eacute;p&eacute;t&eacute; en tout ou partie.</p>

<p>La totalit&eacute; des recommandations du consortium W3 m&ecirc;me dans leurs diff&eacute;rentes &eacute;tapes du processus d'examen peuvent &ecirc;tre consult&eacute;es &agrave; l'adresse Web suivante:</p>

<p><img src="../../src/en.gif" width="16" height="10" border="0" alt="Page en langue anglaise">&nbsp;<a target="_top" href="http://www.w3.org/TR/"><b>http://www.w3.org/TR/</b></a></p>

<p>Le &quot;TR&quot; signifie ici &quot;<b>Technical Reports</b>&quot; (<i>rapports techniques</i>). La totalit&eacute; des documents est publi&eacute;e en langue anglaise et la version en langue anglaise est la version officielle pour la norme. Beaucoup de ces documents sont pourtant d&eacute;j&agrave; traduits dans d'autres langues m&ecirc;me en fran&ccedil;ais. &Agrave; l'adresse suivante, vous pouvez consulter la liste des traductions disponibles:</p>

<p><img src="../../src/en.gif" width="16" height="10" border="0" alt="Page en langue anglaise">&nbsp;<a target="_top" href="http://www.w3.org/Consortium/Translation/"><b>http://www.w3.org/Consortium/Translation/</b></a></p>

<p>Toutes les recommandations du consortium W3 existent au format HTML et peuvent &ecirc;tre t&eacute;l&eacute;charg&eacute;es des pages Web du consortium W3 sous forme de fichier zip. De cette fa&ccedil;on, tout d&eacute;veloppeur Web peut se procurer une copie locale des documents dont il a besoin pour son travail quotidien. Si vous voulez travailler s&eacute;rieusement avec HTML, CSS, XML etc. il est chaudement recommand&eacute; de vous procurer ces documents et de vous y plonger.</p>





<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="rfcs">Documents RFC(RFCs)</a></h2>

<p>Tandis que les recommandations du consortium W3 ont force de loi sp&eacute;cialement pour le World Wide Web , il y a aussi des documents pour les standards techniques sur Internet en g&eacute;n&eacute;ral. Le processus pour ces standards n'est pas organis&eacute; de fa&ccedil;on tout &agrave; fait aussi rigide qu' il est possible pour l'organisation du consortium W3. Pourtant le processus a fait ses preuves et les documents valent pi&egrave;ces officielles pour les d&eacute;veloppeurs.</p>

<p>Les <b>Requests for Comments (RFCs)</b> (mot &agrave; mot: &quot;<i>demande de commentaire</i>&quot;) sont le type de document pour ce genre de descriptions. La collection des documents RFC est tenue depuis les tout d&eacute;buts de l'ARPANET, donc depuis 1969. Les nouveaux documents RFC re&ccedil;oivent un num&eacute;ro d'une liste num&eacute;rique continue. C'est ainsi qu'on voit appara&icirc;tre des nom de document tels que RFC 959 ou RFC 1867. Un document RFC, celui qui porte le num&eacute;ro 1543 d&eacute;crit comment un document RFC doit &ecirc;tre pr&eacute;sent&eacute;. Car ce n'est que si un sch&eacute;ma uniforme est respect&eacute;, que l'on s'assure que les documents RFC aient une qualit&eacute; constante. Les documents RFC sont g&eacute;r&eacute;s par l'organisation <img src="../../src/en.gif" width="16" height="10" border="0" alt="Page en langue anglaise">&nbsp;<a target="_top" href="http://www.ietf.org/"><b>Internet Engineering Task Force (IETF)</b></a>.</p>

<p>Chaque participant &agrave; Internet peut &eacute;crire de nouveaux documents RFC. Celui qui d&eacute;sire proposer un nouveau standard, par exemple un nouveau format de fichier ou un certain d&eacute;roulement technique, peut r&eacute;diger ce qu'on appelle un <b>Internet Draft</b> (<i>projet Internet</i>). L&agrave; il se tient d&eacute;j&agrave; aux r&egrave;gles fix&eacute;es dans le document RFC 1543, comment la description doit &ecirc;tre faite. Il fait parvenir le projet Internet termin&eacute; &agrave; l'organisation IETF. L&agrave; existe une liste de publipostage &agrave; laquelle tous les participants &agrave; Internet int&eacute;ress&eacute;s par les standards techniques peuvent s'abonner. Cette liste de publipostage fait conna&icirc;tre les nouveaux projets Internet qui peuvent &ecirc;tre discut&eacute;s. Les discussions permettent encore en r&egrave;gle g&eacute;n&eacute;rale des corrections, des propositions d'am&eacute;lioration etc. que l'auteur du projet Internet apporte &agrave; son document. Apr&egrave;s une p&eacute;riode de discussions raisonnable, l'organisation IETF finit par d&eacute;cider si le document devient un document RFC officiel. Si oui, il re&ccedil;oit un num&eacute;ro et est ajout&eacute; &agrave; la collection des documents RFC.</p>

<p>Les documents RFC contiennent beaucoup de connaissances ainsi que des points de vues
personnels des auteurs et des passages pleins d'humour contiennent beaucoup de connaissances, mais aussi des avis personnels d'auteurs. Beaucoup de standards de facto importants sur Internet comme le protocole HTTP ou la technique MIME pour les courriers &eacute;lectroniques sont disponibles comme documents RFC. C'est aussi des documents RFC que sont issues souvent d&eacute;j&agrave; des parties de sp&eacute;cifications de langages. Ainsi les commandes pour les objets multim&eacute;dia ou les tableaux, aujourd'hui partie int&eacute;grante du standard HTML tirent elles leur origine des documents RFC.</p>

<p>Les documents RFC sont &agrave; l'origine de purs fichiers texte et r&eacute;dig&eacute;s d'un bout &agrave; l'autre en langue anglaise. Vous pouvez obtenir la collection actuelle des documents &agrave; 'adresse Web:  <img src="../../src/en.gif" width="16" height="10" border="0" alt="Page en langue anglaise">&nbsp;<a target="_top" href="http://rfc.net/"><b>rfc.net</b></a>. Sur l'espace Internet francophone, les documents RFC sont &eacute;galement propos&eacute;s  par exemple par RFC-Editeur.org qui propose ces documents RFC  <img src="../../src/fr.gif" width="16" height="10" border="0" alt="Page en langue fran&ccedil;aise">&nbsp;<a target="_top" href="http://abcdrfc.free.fr/"><b>aux formats HTML PDF et RTF </b></a>avec des liens &agrave; d'autres sources (documents RFC originaux par exemple).</p>

<p>Il est vivement recommand&eacute; de regarder &agrave; t&ecirc;te repos&eacute;e la liste des documents RFC et d'en appeler quelques uns. En tant que d&eacute;veloppeur Web, vous vous devez de conna&icirc;tre le type de document des RFC et savoir que des quantit&eacute;s de standards y sont d&eacute;crits dont vous pourriez un jour avoir besoin.</p>




<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="questions">Questions r&eacute;currentes (FAQs)</a></h2>

<p>Les Frequently asked questions (<i>questions pos&eacute;es fr&eacute;quemment</i>) ne sont pas des documents officiels dans le sens qu'ils sont publi&eacute;s et g&eacute;r&eacute;s par une organisation. Il s'agit simplement d'un type de documentation &eacute;tabli sur Internet et ayant une longue tradition. Il existe des questions r&eacute;currentes sur tous les th&egrave;mes imaginables - des animaux aux questions techniques sur Internet en passant par la politique et la religion.. Sur le WWW il y a un <img src="../../src/en.gif" width="16" height="10" border="0" alt="Page en langue anglaise">&nbsp;<a target="_top" href="http://www.faqs.org/faqs/"><b>faqs.org</b></a> emplacement o&ugrave; sont r&eacute;unies les questions r&eacute;currentes. Il s'agit l&agrave; d'une collection de liens &agrave; des questions r&eacute;currentes.</p>

<p>Les questions r&eacute;currentes se basent sur des questions reviennent r&eacute;guli&egrave;rement pour &ecirc;tre pos&eacute;es dans les listes de publipostage, les groupes de nouvelles ou les forums, justement partout l&agrave; o&ugrave; des participants &agrave; Internet peuvent &eacute;changer des points de vue. Une question f&eacute;tiche dans les forums pour les d&eacute;veloppeurs de pages Web demande par exemple: &quot;comment puis-je programmer un mot de passe pour mes pages?&quot;. Au lieu d'&eacute;crire une documentation qui se divise d'apr&egrave;s le contenu en chapitre, th&egrave;mes, sous-th&egrave;mes etc., une question r&eacute;currente contient comme titre exactement ces questions libell&eacute;es comme telles. Sous la question se trouve alors une r&eacute;ponse correcte et qui m&egrave;ne au but. Dans les domaines de discussion o&ugrave; de telles questions reviennent sans cesse, les  &quot;vieux de la vielle&quot; peuvent alors indiquer simplement le lien &agrave; la question r&eacute;currente avant d'exploser nerveusement parce que cette m&ecirc;me question est d&eacute;j&agrave; pos&eacute;e pour la troisi&egrave;me fois en deux jours. C'est pourquoi entre-temps, les questions r&eacute;currentes sont disponibles la plupart du temps sur le Web sous forme de pages Web - car c'est l&agrave; la fa&ccedil;on la plus &eacute;l&eacute;gante pour envoyer directement le demandeur &agrave; la r&eacute;ponse &agrave; sa question.</p>

<p>Justement si vous recherchez de l'aide sur la toile  <img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="aide.htm"><b>Support</b></a> sans vous y conna&icirc;tre particuli&egrave;rement, vous devez en tous cas &eacute;couter quand on vous indique un lien &agrave; une question r&eacute;currente. Car les questions r&eacute;currentes sont issues de la pratique et contribuent &agrave; pouvoir se concentrer sur l'aide &agrave; apporter &agrave; des probl&egrave;mes qu'on ne voit pas tous les jours.</p>




<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="fournisseur">Documentations de fournisseurs</a></h2>

<p>Toutes les <img src="../../src/chap.gif" width="15" height="13" border="0" alt="Autre page d'information">&nbsp;<a href="../technologies/index.htm"><b>Technologies du Web</b></a>, qui ne sont pas standardis&eacute;es par le consortium W3 sont malgr&eacute; tout document&eacute;es quelque part &quot;dans l'original&quot;. Car derri&egrave;re de telles technologies, qu'il s'
agisse de Java, de Perl, de PHP etc... se cachent des fournisseurs qui ont int&eacute;r&ecirc;t &agrave; ce que leur technologie se r&eacute;pande. Mais une technologie ne peut se r&eacute;pandre que si elle est correctement document&eacute;e. C'est pourquoi vous trouvez normalement sur les pages Web du fournisseur de la technologie la documentation officielle pour cette technologie.</p>

<p>Pour les d&eacute;veloppeurs Web, les pages d&eacute;veloppeurs des grands navigateurs ont aussi leur importance. Les deux pages qui suivent doivent &ecirc;tre connues de tous ceux qui s'occupent de cr&eacute;ation de pages Web:</p>

<p><img src="../../src/en.gif" width="16" height="10" border="0" alt="Page en langue anglaise">&nbsp;<a target="_top" href="http://developer.netscape.com/"><b>Pages d&eacute;veloppeur de  Netscape</b></a><br>
Vous trouverez l&agrave; par exemple la documentation originale de JavaScript mais aussi des informations sur les &eacute;l&eacute;ments HTML et la version de Netscape qui les soutient. De nombreuses notices techniques et articles d&eacute;voilent certains tuyaux et astuces sur la fa&ccedil;on de programmer pour que le navigateur Netscape interpr&egrave;te correctement.</p>

<p><img src="../../src/en.gif" width="16" height="10" border="0" alt="Page en langue anglaise">&nbsp;<a target="_top" href="http://msdn.microsoft.com/"><b>Pages d&eacute;veloppeur de Microsoft</b></a><br>
Vous trouverez l&agrave; par exemple la documentation originale de JScript, l'implantation Microsoft de JavaScript. D'ailleurs il vous faudra chercher un peu, car il y a l&agrave; &eacute;galement d&eacute;crites d'autres technologies qui n'ont rien &agrave; voir avec le d&eacute;veloppement Web. Le stock d'informations est &eacute;norme.</p>





<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="libre">Documentations libres</a></h2>

<p>Les documentations libres sont telles que celle que vous &ecirc;tes en train de lire en ce moment. De telles documentations peuvent &ecirc;tre publi&eacute;es sur le r&eacute;seau par tout auteur qui s'y sent oblig&eacute;. Il n'y a pourtant pas le moindre instance de contr&ocirc;le et c'est pourquoi aussi il n'y a pas non plus de garantie pour certifier &agrave; quel point de telles descriptions sont compl&egrave;tes ou exactes quant &agrave; leur contenu. En r&egrave;gle g&eacute;n&eacute;rale c'est la communaut&eacute; du r&eacute;seau qui d&eacute;cide de la valeur de telles documentations. Les bonnes documentations sont mentionn&eacute;es sur d'autres pages Web par des liens qui y m&egrave;nent ce qui les rend de plus en plus connues pour leur donner ainsi le statut de source d'informations reconnue utilisable.</p>

<p>Une t&acirc;che importance des documentations libres est avant tout de porter la connaissances sur la technologie dans les diff&eacute;rentes langues nationales. Car les d&eacute;butants justement auraient plus de facilit&eacute;s s'il pouvaient d&eacute;j&agrave; aborder un nouveau sujet compliqu&eacute; dans leur langue maternelle. Et ceux qui ne connaissent pas l'anglais ou trop peu n'ont pas d'autre choix que d'acc&eacute;der &agrave; ces connaissances par ces sources qui les leur communiquent dans leur propre langue.</p>

<p>Dans l'index des liens de l'offre en ligne de SELFHTML actuel vous trouverez d'autres liens importants et actuels par exemple &agrave; de la documentation libre aux pages suivantes:</p>

<p>
<img src="../../src/serverdoc.gif" width="15" height="10" border="0" alt="Page d'information: connexion exig&eacute;e">&nbsp;<a target="_top" href="http://www.selfhtml.com.fr/liens/html.htm"><b>Index des liens SELFHTML: HTML</b></a><br>
<img src="../../src/serverdoc.gif" width="15" height="10" border="0" alt="Page d'information: connexion exig&eacute;e">&nbsp;<a target="_top" href="http://www.selfhtml.com.fr/liens/css.htm"><b>Index des liens SELFHTML: feuilles de style CSS</b></a><br>
<img src="../../src/serverdoc.gif" width="15" height="10" border="0" alt="Page d'information: connexion exig&eacute;e">&nbsp;<a target="_top" href="http://www.selfhtml.com.fr/liens/xml.htm"><b>Index des liens SELFHTML: XML</b></a><br>
<img src="../../src/serverdoc.gif" width="15" height="10" border="0" alt="Page d'information: connexion exig&eacute;e">&nbsp;<a target="_top" href="http://www.selfhtml.com.fr/liens/javascript.htm"><b>Index des liens SELFHTML: JavaScript/DOM</b></a><br>
<img src="../../src/serverdoc.gif" width="15" height="10" border="0" alt="Page d'information: connexion exig&eacute;e">&nbsp;<a target="_top" href="http://www.selfhtml.com.fr/liens/dhtml.htm"><b>Index des liens SELFHTML:  HTML dynamique (DHTML)</b></a><br>
<img src="../../src/serverdoc.gif" width="15" height="10" border="0" alt="Page d'information: connexion exig&eacute;e">&nbsp;<a target="_top" href="http://www.selfhtml.com.fr/liens/cgiperl.htm"><b>Index des liens SELFHTML:  CGI/Perl</b></a><br>
<img src="../../src/serverdoc.gif" width="15" height="10" border="0" alt="Page d'information: connexion exig&eacute;e">&nbsp;<a target="_top" href="http://www.selfhtml.com.fr/liens/php.htm"><b>Index des liens SELFHTML: PHP</b></a><br>
<img src="../../src/serverdoc.gif" width="15" height="10" border="0" alt="Page d'information: connexion exig&eacute;e">&nbsp;<a target="_top" href="http://www.selfhtml.com.fr/liens/asp.htm"><b>Index des liens SELFHTML: ASP</b></a><br>
<img src="../../src/serverdoc.gif" width="15" height="10" border="0" alt="Page d'information: connexion exig&eacute;e">&nbsp;<a target="_top" href="http://www.selfhtml.com.fr/liens/java.htm"><b>Index des liens SELFHTML: Java</b></a></p>






<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="livres">Livres</a></h2>

<p>Quand vous entrez dans le rayon sp&eacute;cialis&eacute; en informatique de la librairie d'une grande ville, vous pouvez emmener tellement de livres sur les th&egrave;mes touchant &agrave; la cr&eacute;ation de pages Web que vous pourriez en remplir les &eacute;tag&egrave;res de plusieurs murs. &Agrave; la condition que le porte monnaie le permette car ce genre de livres n'est presque jamais bon march&eacute;. Par contre beaucoup de ces livres sont mauvais. Mais pas tous, certains sont aussi sensationnels. La raison pour laquelle tant de livres sp&eacute;cialis&eacute;s sont mauvais r&eacute;side d'un c&ocirc;t&eacute; dans le fait qu'il y a un &eacute;norme march&eacute; de lecteurs pour cette litt&eacute;rature sp&eacute;cialis&eacute;e mais pas assez d'auteurs avec les v&eacute;ritables &quot;solides connaissances&quot;. Il y a bien une quantit&eacute; de bons programmeurs et de sp&eacute;cialistes ayant les connaissances n&eacute;cessaires: ils sont cependant surcharg&eacute;s avec des projets et ne sont souvent pas en mesure d'&eacute;crire un livre. Alors, les maisons d'&eacute;dition informatiques ne perdant pas de vue le march&eacute; potentiel cherchent souvent en se frottant les mains des auteurs, en courant souvent le risque de produire un titre dont la qualit&eacute; laisse &agrave; d&eacute;sirer. La plupart du temps, les auteurs n'ont pas non plus plus de deux &agrave; trois mois pour faire surgir du n&eacute;ant des livres qui comptent plusieurs centaines de pages. Cela conduit naturellement &agrave; aller pomper ailleurs, sans y mettre vraiment la substantifique moelle, &agrave; faire du &quot;remplissage, &agrave; employer une terminologie peu homog&egrave;ne etc. - et cela avant tout quand l'auteur ne peut pas puiser dans ses connaissances pratiques mais doit pendant la phase d'&eacute;laboration commencer &agrave; travailler lui-m&ecirc;me le sujet. Beaucoup de livres sont aussi produits pour le &quot;march&eacute; &eacute;ph&eacute;m&egrave;re&quot;c'est &agrave; dire qu'ils font l'objet d'une campagne de publicit&eacute; par la maison d'&eacute;dition pendant quelques mois puis ils disparaissent &agrave; nouveau parce que les co&ucirc;ts de la maison d'&eacute;dition ont grimp&eacute; et qu'une nouvelle campagne serait trop on&eacute;reuse.</p>

<p>Avant d'acheter des livres sp&eacute;cialis&eacute;s vous devez pour cette raison chercher des critiques. Les grands fournisseurs de livres sur Internet sont tout &agrave; fait bien appropri&eacute;s pour ce genre de recherches par exemple <img src="../../src/fr.gif" width="16" height="10" border="0" alt="Page en langue fran&ccedil;aise">&nbsp;<a target="_top" href="http://www.amazon.fr"><b>Amazon</b></a>. M&ecirc;me si vous pr&eacute;f&eacute;rez l'achat en librairie r&eacute;elle, il peut &ecirc;tre int&eacute;ressant d'aller y chercher auparavant des informations. Car les lecteurs peuvent y faire des critiques sur des livres qu'ils ont lus. Pour beaucoup de livres vous trouvez ainsi plusieurs critiques qui sont tr&egrave;s authentiques car elles refl&egrave;tent les exp&eacute;riences imm&eacute;diates de lecteurs. Recherchez simplement des livres sur le th&egrave;me d&eacute;sir&eacute; par exemple des livres sur HTML ou Perl et lisez ce que d'autres en disent. C'est au moins plus sens&eacute; que de ne se fier qu'aux textes des couvertures de livre.</p>

<p>On dit g&eacute;n&eacute;ralement que les livres sp&eacute;cialis&eacute;s deviennent meilleurs au fur et &agrave; mesure qu'une technologie progresse. Quand de nouvelles technologies naissent et sont pressenties importantes par le monde sp&eacute;cialis&eacute;, comme c'&eacute;tait le cas ces derni&egrave;res ann&eacute;es par exemple avec Java ou XML, alors beaucoup de maisons d'&eacute;dition s'y jettent pour &ecirc;tre les premi&egrave;res &agrave; publier quelque chose sur le th&egrave;me. Ce qui en sort est presque toujours une marchandise indigente, &eacute;tant donn&eacute; que les technologies  ne sont la plupart du temps pas s&eacute;rieusement document&eacute;es elles-m&ecirc;mes et encore en cours de d&eacute;veloppement. &Agrave; ces p&eacute;riodes il est souvent mieux de se contenter des documents gratuits sur Internet. Si par contre une technologie est bien introduite et &eacute;tablie comme c'est le cas entre-temps avec HTML, il y a alors aussi en r&egrave;gle g&eacute;n&eacute;rale des livres sp&eacute;cialis&eacute;s bien &eacute;labor&eacute;s la concernant.</p>




<table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr><td colspan="2" bgcolor="#EEEEEE" class="doc">
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a>
</td></tr>
<tr><td bgcolor="#EEEEEE" class="doc" align="right"><a href="logiciels.htm"><img src="../../src/suivant.gif" width="10" height="10" border="0" hspace="10" alt="page suivante"></a></td>
<td bgcolor="#FFFFFF"><img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information"> <a href="logiciels.htm"><b>Logiciels</b></a>
</td></tr>
<tr>
<td bgcolor="#EEEEEE" class="doc" align="right"><a href="../technologies/flash.htm"><img src="../../src/precedent.gif" width="10" height="10" border="0" hspace="10" alt="page pr&eacute;c&eacute;dente"></a></td>
<td bgcolor="#FFFFFF" width="100%"><img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information"> <a href="../technologies/flash.htm"><b>Flash</b></a>
</td>
</tr>
<tr><td colspan="2" bgcolor="#EEEEEE" class="doc">&#160;</td></tr>
</table><table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr>
<td bgcolor="#FFEEDD" class="nav"><a class="an" name="bottom"><img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"></a> <a href="../../index.htm"><b>SELFHTML</b></a>/<a href="../../navigation/index.htm" target="_parent">Aides &agrave; la navigation</a> <img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="../index.htm"><b>Introduction</b></a> <img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="index.htm"><b>Aides</b></a></td>
</tr>
</table>

<p>&copy; 2001 Stefan M&uuml;nz / &copy; 2003 Traduction <img src="../../src/courriel.gif" width="15" height="10" border="0" alt="Adresse &eacute;lectronique">&nbsp;<a href="mailto:13405@free.fr">Serge Fran&ccedil;ois, 13405@free.fr</a><br><img src="../../src/courriel.gif" width="15" height="10" border="0" alt="Adresse &eacute;lectronique">&nbsp;<a href="mailto:selfhtml@selfhtml.com.fr">selfhtml@selfhtml.com.fr</a></p>



</body>
</html>
