<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>SELFHTML: Introduction / Aides / Logiciels</title>
<link rel="stylesheet" type="text/css" href="../../src/selfhtml.css">
<meta name="description"    content="Quels types de lociciels vous devez conna&icirc;tre en tant que d&eacute;veloppeur Web et desquels avez vous besoin dans la pratique?">
<meta name="keywords"       content="SELFHTML, aides, logiciels, programmes, &eacute;diteurs HTML, programmes FTP, navigateurs Web, utilitaires, programmes graphiques, programmes de compression">
<meta name="author"         content="Stefan M&uuml;nz, selfhtml@teamone.de">
<meta http-equiv="content-type" content="text/html; charset=ISO-8859-1">
<meta name="DC.Publisher"   content="Serge Fran&ccedil;ois, selfhtml@selfhtml.com.fr">
<meta name="DC.Date"        content="2003-01-27T08:00+00:00">
<meta name="DC.Identifier"  content="http://selfhtml.selfhtml.com.fr/introduction/aide/logiciels.htm">
<meta name="DC.Language"    content="fr">
<meta name="DC.Rights"      content="../../editorial/copyright.htm">
<meta name="DC.Date.Create" content="2003-01-27T08:00+00:00">
<meta name="SELF.Version"   content="1">
<meta name="SELF.Pagetype"  content="Information">
<meta name="SELF.Path"      content="SELFHTML == ../../index.htm // Introduction == ../index.htm // Aides == index.htm">
<!-- Matomo -->
<script type="text/javascript">
  var _paq = window._paq = window._paq || [];
  /* tracker methods like "setCustomDimension" should be called before "trackPageView" */
  _paq.push(['trackPageView']);
  _paq.push(['enableLinkTracking']);
  (function() {
    var u="//matomo.boitasite.com/";
    _paq.push(['setTrackerUrl', u+'matomo.php']);
    _paq.push(['setSiteId', '1']);
    var d=document, g=d.createElement('script'), s=d.getElementsByTagName('script')[0];
    g.type='text/javascript'; g.async=true; g.src=u+'matomo.js'; s.parentNode.insertBefore(g,s);
  })();
</script>
<!-- End Matomo Code -->
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#AA5522" vlink="#772200" alink="#000000">

<table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr>
<td bgcolor="#FFEEDD" class="nav"><a class="an" name="top"><img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"></a> <a href="../../index.htm"><b>SELFHTML</b></a>/<a href="../../navigation/index.htm" target="_parent">Aides &agrave; la navigation</a> <img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="../index.htm"><b>Introduction</b></a> <img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="index.htm"><b>Aides</b></a></td>
</tr>
</table><table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr>
<td bgcolor="#EEEEEE" class="doc" width="110"><img src="../../src/logo.gif" width="106" height="109" border="0" alt="SELFHTML"></td>
<td bgcolor="#EEEEEE" class="doc" valign="bottom" width="100%"><h2>Logiciels</h2>
<tr>
<td bgcolor="#EEEEEE" class="doc" valign="top" align="center">
<img src="../../src/docx.gif" width="30" height="20" vspace="6" border="0" alt="Page d'information: vue d'ensemble">
</td>
<td bgcolor="#FFFFFF" valign="top" nowrap>
<p>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#generalites"><b>G&eacute;n&eacute;ralit&eacute;s sur les logiciels pour d&eacute;veloppeurs Web</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#html"><b>&Eacute;diteurs HTML</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#navigateurs"><b>Navigateurs Web</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#xml"><b>Outils XML</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#ftp"><b>Programmes FTP</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#graphiques"><b>Programmes graphiques</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#utilitaires"><b>Utilitaires divers</b></a><br>
</p>
</td>
</tr><tr><td colspan="2" bgcolor="#EEEEEE" class="doc">&#160;<a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;</td></tr>
</table>



<h2 class="Sh2"><a class="an" name="generalites">G&eacute;n&eacute;ralit&eacute;s sur les logiciels pour d&eacute;veloppeurs Web</a></h2>

<p>Le plus important qu'il y ait &agrave; dire sur le sujet logiciels en relation avec le d&eacute;veloppement de pages Web, c'est qu'il n'y a pas &quot;le logiciel&quot; et il faut souhaiter qu'il n'existe jamais. En fin de compte avec des technologies propri&eacute;taires telles que <img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="../technologies/flash.htm"><b>Flash</b></a> vous &ecirc;tes orient&eacute;s sur certains produits logiciels. Toutes les technologies Internet originales sont par contre consciemment con&ccedil;us dans l'ind&eacute;pendance &agrave; tout logiciel. Il y a de bonnes raisons. Sur Internet se c&ocirc;toient tous les syst&egrave;mes d'exploitation et types d'ordinateurs possibles et les technologies qui doivent &ecirc;tre disponibles pour tous n'ont pas de grandes chances, dans la mesure o&ugrave; elles sont sp&eacute;cifiques &agrave; un syst&egrave;me ou qu'elles ont des exigences sp&eacute;ciales qui excluent une partie des utilisateurs d'Internet.</p>

<p>L'ind&eacute;pendance &agrave; tout logiciel des technologies conduit aussi &agrave; ce que les fabricants de logiciels ne puissent plus imposer de format de fichier au client ni d'interface d'application peu souple et non-pratique. Les produits logiciels ne peuvent se distinguer de la concurrence pour les donn&eacute;es ind&eacute;pendantes de tout logiciel que si elles convainquent l'utilisateur de leur efficacit&eacute; accrue, de leur meilleure clart&eacute;, et d'une interface plus intelligente. Les fabricants de logiciels seront ainsi forc&eacute;s de s'inqui&eacute;ter davantage de l'ergonomie de l'utilisateur et de la cr&eacute;ation d'une interface plus intelligente.</p>

<p>On voit toujours arriver des produits logiciels en effet qui pr&eacute;tendent proposer &agrave; l'utilisateur un paquet &agrave; tout faire et cela sans souci, qui lui promettent la cr&eacute;ation, la gestion, et la surveillance de ses propres pages Web avec la mention &quot;utilisation &agrave; la port&eacute;e d'un enfant et sans connaissances approfondies n&eacute;cessaires&quot;. C'est faux la plupart du temps. Justement de tels paquets logiciels sont sans espoir en ce qui concerne l'&eacute;quipement en fonctions, menus, assistants et dialogues. L'utilisateur commence alors &agrave; passer un temps fou pour assimiler le fonctionnement du logiciel. Ce temps serait dans de nombreux cas mieux investi s'il &eacute;tait directement consacr&eacute; aux technologies qu'il rec&egrave;le.</p>

<p>L'affirmation est pourtant tout aussi stupide qui consiste &agrave; dire que l'on peut travailler plus proprement avec des outils archa&iuml;ques comme l'&eacute;diteur Bloc-notes de Windows ou avec l'invite de commande FTP. Le logiciel est l&agrave; pour all&eacute;ger les t&acirc;ches et quand il le fait, il remplit son r&ocirc;le. Il y a une quantit&eacute; d'utilitaires bien au point qui font gagner du temps pour la cr&eacute;ation de pages Web et contribuent &agrave; &eacute;viter les erreurs. Il n'est pourtant pas judicieux de recommander certains produits. Car la fa&ccedil;on de travailler personnelle et l'estimation de l'aspect et de l'avis sur un logiciel diff&egrave;rent d'une personne &agrave; l'autre. Il ne vous sera pas &eacute;pargn&eacute; de tester une fois diff&eacute;rents produits et d'essayer de vous y faire. Par chance, la plupart des produits m&ecirc;me payants sont disponibles sur Internet pour &ecirc;tre t&eacute;l&eacute;charg&eacute;s en version d'essai. Ainsi vous pouvez essayer un produit sans engagement avant de d&eacute;cider de l'acqu&eacute;rir. Utilisez imp&eacute;rativement cette possibilit&eacute;.</p>





<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="html">&Eacute;diteurs HTML</a></h2>

<p>Parmi les &eacute;diteurs <img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="../technologies/html.htm"><b>HTML</b></a> on peut distinguer
entre les &eacute;diteurs bas&eacute;s sut le texte et les les &eacute;diteurs  WYSIWYG  (<i>WYSIWYG = What You See Is What You Get - Ce que vous voyez est ce que vous obtenez</i>). Avec les &eacute;diteurs bas&eacute;s sur le texte, vous travaillez directement avec des
commandes HTML. En g&eacute;n&eacute;ral, de tels &eacute;diteurs disposent d'une barre
d'outils avec des boutons et diverses commandes de menus pour ins&eacute;rer les
rep&egrave;res HTML dans le texte. Les rep&egrave;res apparaissent clairement dans le texte, en r&egrave;gle g&eacute;n&eacute;rale d'une autre couleur et visuellement bien reconnaissables (&quot;Syntax-Highlighting&quot;). les &eacute;diteurs WYSIWYG offrent des barres d'outils avec des boutons et des commandes de menus pour assister la pose de rep&egrave;res HTML sous
forme de dialogue. La diff&eacute;rence est cependant que les rep&egrave;res ne sont pas affich&eacute;s (&agrave moins qu'une option correspondante ne soit choisie). Au lieu de cela, le texte est d&eacute;j&agrave affich&eacute; &agrave; l'&eacute;cran tel qu'il le sera sur le navigateur WWW . Ce qui ne signifie pourtant pas forc&eacute;ment que le texte appara&icirc;tra ensuite sur tous les navigateurs Web comme il appara&icirc;t dans la fen&ecirc;tre de votre &eacute;diteur  Wysiwyg. &quot;Wysiwyg&quot; est &agrave; vrai dire une dangereuse tromperie et une promesse bien difficile &agrave; tenir eu &eacute;gard &agrave; la vari&eacute;t&eacute; des navigateurs Web et et de leurs nombreuses surprises.</p>

<p>Ne vous laissez pas influencer par la &quot;guerre de religion&quot; qui existe entre les partisans et les d&eacute;tracteurs des &eacute;diteurs WYSIWYG. Essayer d'&eacute;tablir avec quoi vous-m&ecirc;me pouvez travailler le mieux.</p>

<p>Dans l'index des liens de l'offre en ligne de SELFHTML actuel vous trouverez d'autres liens importants et actuels aux &eacute;diteurs HTML:</p>

<p><img src="../../src/serverdoc.gif" width="15" height="10" border="0" alt="Page d'information: connexion exig&eacute;e">&nbsp;<a target="_top" href="http://www.selfhtml.com.fr/liens/editeurs.htm"><b>Index des liens SELFHTML: &eacute;diteurs HTML</b></a></p>







<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="navigateurs">Navigateurs Web</a></h2>

<p>Les navigateurs Web sont des programmes de visualisation de pages Web. Les navigateurs Web ma&icirc;trisent le protocole HTTP et peuvent communiquer avec des serveurs Web pour demander les donn&eacute;es d'une certaine adresse Web par exemple. Tous les navigateurs ma&icirc;trisent plus ou moins bien  HTML, la plupart entre-temps &eacute;galement les technologies compl&eacute;mentaires CSS et JavaScript, il est vrai de fa&ccedil;on in&eacute;gale. C&ocirc;t&eacute; serveur des applications dynamiques telles que les scripts CGI et les instructions PHP ne posent aucun probl&egrave;me au navigateur aussi longtemps qu'elles g&eacute;n&egrave;rent du code HTML pour le navigateur. Il y a par contre de grandes diff&eacute;rences dans le soutien des multim&eacute;dia. En outre vous pouvez aussi en restant d&eacute;connect&eacute lire les fichiers HTML sur votre propre ordinateur. C'est important par exemple quand vous voulez essayer vos pages Web localement sans connexion &agrave; Internet.</p>

<p>En tant que d&eacute;veloppeur de pages Web, vous ne devez pas installer qu'un seul navigateur sur votre ordinateur, mais le plus de sortes possible. Avec quel navigateur vous pr&eacute;f&eacute;rez naviguer sur la toile, c'est votre affaire. Mais les visiteurs de vos pages utilisent quelquefois des produits diff&eacute;rents et c'est pourquoi vous devez v&eacute;rifier vos pages avec plusieurs logiciels diff&eacute;rents. Car malheureusement il y a encore toujours dans le d&eacute;tail beaucoup de diff&eacute;rences irritantes entre les navigateurs. Et votre ambition doit &ecirc;tre de proposer des pages Web attrayantes sans pourtant exclure des utilisateurs, pour la seule raison qu'ils n'utilisent pas le m&ecirc;me navigateur que le v&ocirc;tre.</p>

<p>Dans l'index des liens de l'offre en ligne de SELFHTML actuel vous trouverez d'autres liens importants et actuels aux navigateurs Web:</p>

<p><img src="../../src/serverdoc.gif" width="15" height="10" border="0" alt="Page d'information: connexion exig&eacute;e">&nbsp;<a target="_top" href="http://www.selfhtml.com.fr/liens/navigateurs_web.htm"><b>Index des liens SELFHTML: navigateurs WWW</b></a></p>






<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="xml">Outils XML</a></h2>

<p>De nombreux &eacute;diteurs ne sont pas seulement appropri&eacute;s pour HTML mais sont &eacute;galement bons comme &eacute;diteurs de texte pour d'autres langages . Pourtant il existe des &eacute;diteurs sp&eacute;ciaux <img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="../technologies/xml.htm"><b>XML</b></a> &eacute;tant donn&eacute; qu'il arrive fr&eacute;quemment en travaillant dur des donn&eacute;es XML de buter sur des choses que l'on ne trouve pas en travaillant des donn&eacute;es HTML. Car XML n'a d&eacute;j&agrave; rien &agrave; voir avec la pr&eacute;sentation de pages. Et les donn&eacute;es XML n'ont pas besoin non plus d'&ecirc;tre orient&eacute;es sur le texte. On peut avec XML aussi bien d&eacute;crire des donn&eacute;es graphiques, acoustiques ou formelles. L'importance est plut&ocirc;t mise sur la repr&eacute;sentation optimale de l'arborescence des donn&eacute;es et il peut &ecirc;tre utile lorsque l'on utilise les DTD  (d&eacute;finitions de type de document dont les r&egrave;gles doivent correspondre aux donn&eacute;es entr&eacute;es) que l'&eacute;diteur refuse les saisies qui ne correspondent pas aux r&egrave;gles.</p>

<p>Dans l'index des liens de l'offre en ligne de SELFHTML actuel vous trouverez d'autres liens importants et actuels aux outils XML:</p>

<p><img src="../../src/serverdoc.gif" width="15" height="10" border="0" alt="Page d'information: connexion exig&eacute;e">&nbsp;<a target="_top" href="http://www.selfhtml.com.fr/liens/logiciels_xml.htm"><b>Index des liens SELFHTML: Outils XML</b></a></p>






<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="ftp">Programmes FTP</a></h2>

<p>Pour transmettre les fichiers d'un projet Web sur le serveur o&ugrave; de la place est mise &agrave; votre disposition, vous avez g&eacute;n&eacute;ralement besoin d'un logiciel qui soutienne le <img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="../internet/services.htm#ftp"><b>File-Transfer-Protokoll (FTP)</b></a>. Avec de tels programmes, vous pouvez transmettre les fichiers de votre projet et en assurer la gestion sur le serveur WWW (copier, renommer, effacer etc...).</p>

<p>La plupart des programmes FTP modernes ne pr&eacute;sentent pour ainsi-dire pas de diff&eacute;rence avec tous les gestionnaires de fichiers ou autres explorateurs connus. Dans une partie, vous avez la structure des r&eacute;pertoires locale et dans l'autre partie la structure des r&eacute;pertoires du serveur que vous appelez. En marquant et en tirant avec la souris, les fichiers peuvent &ecirc;tre transmis ou t&eacute;l&eacute;charg&eacute;s. Et il est absolument aussi simple d'effacer ou de renommer des fichiers. Les programmes FTP disposent en g&eacute;n&eacute;ral aussi d'une gestion de &quot;Site&quot;. L&agrave; vous pouvez pour chaque adresse FTP utilis&eacute;e (ordinateur
serveur ou adresse domaine) sauvegarder l'adresse de l'ordinateur, les donn&eacute;es
d'acc&egrave;s et les r&eacute;glages techniques.</p>

<p>Dans l'index des liens de l'offre en ligne de SELFHTML actuel vous trouverez d'autres liens importants et actuels aux programmes FTP:</p>

<p><img src="../../src/serverdoc.gif" width="15" height="10" border="0" alt="Page d'information: connexion exig&eacute;e">&nbsp;<a target="_top" href="http://www.selfhtml.com.fr/liens/logiciels_ftp.htm"><b>Index des liens SELFHTML: logiciels FTP</b></a></p>





<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="graphiques">Programmes graphiques</a></h2>

<p>Les programmes graphiques sont un compl&eacute;ment toujours plus important pour la
conception de pages WWW qui &quot;parlent&quot;. Il y a une s&eacute;rie de bons et m&ecirc;me d'excellents programmes graphiques en partagiciel (shareware) pour constituer, convertir
ou retoucher des graphiques. Celui qui a des exigences de graphiques professionnels ne pourra de toutes fa&ccedil;on pas &eacute;viter l'achat d'un programme professionnel on&eacute;reux m&ecirc;me si ce n'est que pour des travaux sp&eacute;ciaux.</p>

<p>Dans tous les cas, les programmes que vous utilisez doivent reconna&icirc;tre les formats de fichiers <img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="../../graphisme/formats.htm#gif"><b>GIF</b></a>  et<img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="../../graphisme/formats.htm#jpeg"><b>JPEG</b></a> car ce sont les formats de fichiers r&eacute;pandus sur le Web que pratiquement tous les navigateurs peuvent afficher directement. Cependant, le processus de cr&eacute;ation d'un tel graphique
n&eacute;cessite souvent l'intervention de programmes orient&eacute;s vecteur ou des programmes de lancer de rayon (Raytracing).</p>

<p>Dans l'index des liens de l'offre en ligne de SELFHTML actuel vous trouverez d'autres liens importants et actuels aux programmes graphiques:</p>

<p><img src="../../src/serverdoc.gif" width="15" height="10" border="0" alt="Page d'information: connexion exig&eacute;e">&nbsp;<a target="_top" href="http://www.selfhtml.com.fr/liens/programmes_graphiques.htm"><b>Index des liens SELFHTML: programmes graphiques</b></a></p>





<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="utilitaires">Utilitaires divers</a></h2>

<p>Il existe une quantit&eacute; d'autres programmes et de types de logiciels que des d&eacute;veloppeurs Web peuvent utiliser judicieusement. En font partie dans tous les cas des utilitaires standards comme les programmes de compression et de d&eacute;compression pour des formats de fichiers tels que ZIP, RAR etc... Car vous enverrez souvent par exemple des donn&eacute;es de votre projet Web par courriel que ce soit &agrave; des clients, &agrave; des amis etc. Pour que les quantit&eacute;s de donn&eacute;es envoy&eacute;es restent faibles et qu'au lieu de joindre de nombreux fichier &agrave; votre courriel, vous n'ayez &agrave; n'en joindre qu'un, les programmes de compression sont importants. Dans l'index des liens de l'offre en ligne de SELFHTML actuel vous trouverez d'autres liens importants et actuels aux programmes de compression:</p>

<p><img src="../../src/serverdoc.gif" width="15" height="10" border="0" alt="Page d'information: connexion exig&eacute;e">&nbsp;<a target="_top" href="http://www.selfhtml.com.fr/liens/programmes_compression.htm"><b>Index des liens SELFHTML: programmes de compression</b></a></p>

<p>De plus d'autres programmes client sur Internet sont souvent importants. Ainsi vous pouvez chez de nombreux fournisseurs d'acc&egrave;s acc&eacute;der &agrave; vos donn&eacute;es sur le serveur &eacute;galement avec <img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="../internet/services.htm#telnet_ssh"><b>Telnet/SSH</b></a> . Dans l'index des liens de l'offre en ligne de SELFHTML actuel vous trouverez d'autres liens importants et actuels aux programmes pour Telnet et SSH:</p>

<p><img src="../../src/serverdoc.gif" width="15" height="10" border="0" alt="Page d'information: connexion exig&eacute;e">&nbsp;<a target="_top" href="http://www.selfhtml.com.fr/liens/programmes_telnet_ssh.htm"><b>Index des liens SELFHTML: Programme f&uuml;r Telnet et SSH</b></a></p>

<p>Vous pouvez trouver de bons logiciels &agrave; vocations diverses sur la page::</p>

<p><img src="../../src/serverdoc.gif" width="15" height="10" border="0" alt="Page d'information: connexion exig&eacute;e">&nbsp;<a target="_top" href="http://www.selfhtml.com.fr/liens/logiciels_utilitaires.htm"><b>:Index des liens SELFHTML logiciels utilitaires divers</b></a></p>





<table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr><td colspan="2" bgcolor="#EEEEEE" class="doc">
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a>
</td></tr>
<tr><td bgcolor="#EEEEEE" class="doc" align="right"><a href="services.htm"><img src="../../src/suivant.gif" width="10" height="10" border="0" hspace="10" alt="page suivante"></a></td>
<td bgcolor="#FFFFFF"><img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information"> <a href="services.htm"><b>Services sur la toile</b></a>
</td></tr>
<tr>
<td bgcolor="#EEEEEE" class="doc" align="right"><a href="docs.htm"><img src="../../src/precedent.gif" width="10" height="10" border="0" hspace="10" alt="page pr&eacute;c&eacute;dente"></a></td>
<td bgcolor="#FFFFFF" width="100%"><img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information"> <a href="docs.htm"><b>Documents et documentations</b></a>
</td>
</tr>
<tr><td colspan="2" bgcolor="#EEEEEE" class="doc">&#160;</td></tr>
</table><table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr>
<td bgcolor="#FFEEDD" class="nav"><a class="an" name="bottom"><img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"></a> <a href="../../index.htm"><b>SELFHTML</b></a>/<a href="../../navigation/index.htm" target="_parent">Aides &agrave; la navigation</a> <img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="../index.htm"><b>Introduction</b></a> <img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="index.htm"><b>Aides</b></a></td>
</tr>
</table>

<p>&copy; 2001 Stefan M&uuml;nz / &copy; 2003 Traduction <img src="../../src/courriel.gif" width="15" height="10" border="0" alt="Adresse &eacute;lectronique">&nbsp;<a href="mailto:13405@free.fr">Serge Fran&ccedil;ois, 13405@free.fr</a><br><img src="../../src/courriel.gif" width="15" height="10" border="0" alt="Adresse &eacute;lectronique">&nbsp;<a href="mailto:selfhtml@selfhtml.com.fr">selfhtml@selfhtml.com.fr</a></p>



</body>
</html>
