<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>SELFHTML: Param&egrave;tres internationaux / Polices &agrave; t&eacute;l&eacute;charger </title>
<link rel="stylesheet" type="text/css" href="../src/selfhtml.css">
<meta name="description"    content="Quelles solutions existent actuellement pour t&eacute;l&eacute;charger des polices sur le WWW &agrave; savoir pour la possibilit&eacute; de forcer des polices sur des pages WWW et de t&eacute;l&eacute;charger celles-ci et de les afficher de fa&ccedil;on dynamique si elles ne sont pas disponibles chez l'utilisateur.">
<meta name="keywords"       content="SELFHTML, Param&egrave;tres internationaux, polices &agrave; t&eacute;l&eacute;charger, Download-Fonts, pfr, eot, Weft, Bitstream">
<meta name="author"         content="Stefan M&uuml;nz, selfhtml@teamone.de">
<meta http-equiv="content-type" content="text/html; charset=ISO-8859-1">
<meta name="DC.Publisher"   content="Serge Fran&ccedil;ois, selfhtml@selfhtml.com.fr">
<meta name="DC.Date"        content="2003-01-27T08:00+00:00">
<meta name="DC.Identifier"  content="http://selfhtml.selfhtml.com.fr/internationalisation/polices_telechargeables.htm">
<meta name="DC.Language"    content="de">
<meta name="DC.Rights"      content="../editorial/copyright.htm">
<meta name="DC.Date.Create" content="2003-01-27T08:00+00:00">
<meta name="SELF.Version"   content="1">
<meta name="SELF.Pagetype"  content="Information">
<meta name="SELF.Path"      content="SELFHTML == ../index.htm // Param&egrave;tres internationaux == index.htm">
<!-- Matomo -->
<script type="text/javascript">
  var _paq = window._paq = window._paq || [];
  /* tracker methods like "setCustomDimension" should be called before "trackPageView" */
  _paq.push(['trackPageView']);
  _paq.push(['enableLinkTracking']);
  (function() {
    var u="//matomo.boitasite.com/";
    _paq.push(['setTrackerUrl', u+'matomo.php']);
    _paq.push(['setSiteId', '1']);
    var d=document, g=d.createElement('script'), s=d.getElementsByTagName('script')[0];
    g.type='text/javascript'; g.async=true; g.src=u+'matomo.js'; s.parentNode.insertBefore(g,s);
  })();
</script>
<!-- End Matomo Code -->
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#AA5522" vlink="#772200" alink="#000000">


<table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr>
<td bgcolor="#FFEEDD" class="nav"><a class="an" name="top"><img src="../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"></a> <a href="../index.htm"><b>SELFHTML</b></a>/<a href="../navigation/index.htm" target="_parent">Aides &agrave; la navigation</a> <img src="../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="index.htm"><b>Param&egrave;tres internationaux</b></a></td>
</tr>
</table><table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr>
<td bgcolor="#EEEEEE" class="doc" width="110"><img src="../src/logo.gif" width="106" height="109" border="0" alt="SELFHTML"></td>
<td bgcolor="#EEEEEE" class="doc" valign="bottom" width="100%"><h2>Polices &agrave; t&eacute;l&eacute;charger </h2></td>
</tr>
<tr>
<td bgcolor="#EEEEEE" class="doc" valign="top" align="center">
<img src="../src/docx.gif" width="30" height="20" vspace="6" border="0" alt="Page d'information: vue d'ensemble">
</td>
<td bgcolor="#FFFFFF" valign="top" nowrap>
<p>
<img src="../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#generalites"><b>G&eacute;n&eacute;ralit&eacute;s sur les polices &agrave; t&eacute;l&eacute;charger</b></a> <br>
<img src="../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#truedoc"><b>TrueDoc (Bitstream)</b></a><br>
<img src="../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#weft"><b>Web Embedding Fonts Tool WEFT (Microsoft)</b></a><br>
<img src="../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#incorporer"><b>Incorporer des polices &agrave; t&eacute;l&eacute;charger en HTML
</b></a><br>
</p>
</td>
</tr><tr><td colspan="2" bgcolor="#EEEEEE" class="doc">&#160;<a href="#bottom"><img src="../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;</td></tr>
</table>



<h2 class="Sh2"><a class="an" name="generalites">G&eacute;n&eacute;ralit&eacute;s sur les polices &agrave; t&eacute;l&eacute;charger</a></h2>

<p>Les polices &agrave; t&eacute;l&eacute;charger sont  incorpor&eacute;es directement dans les pages Web comme r&eacute;f&eacute;rence &agrave; un fichier de polices. Chaque navigateur Web qui interpr&egrave;te les polices &agrave; t&eacute;l&eacute;charger, reconna&icirc;t de telles polices et les charge avec les fichiers HTML et autres fichiers de ressources d'une page Web. En l'&eacute;tat actuel des choses, la police n'est pas cependant install&eacute;e sur l'ordinateur de l'utilisateur, mais elle y est seulement disponible, Quand la page Web concern&eacute;e est affich&eacute;e par l'ordinateur serveur. Le navigateur peut interpr&eacute;ter les donn&eacute;es de police et repr&eacute;sente les textes format&eacute;s en HTML/CSS avec cette police conform&eacute;ment &agrave; cette police. La condition pr&eacute;alable en est naturellement une interface graphique chez l'utilisateur.</p>

<p>Malheureusement, il n'existe pas de standard pour les polices &agrave; t&eacute;l&eacute;charger, mais deux solutions incompatibles et sp&eacute;cifiques aux constructeurs: L'une vient de Bitstream (cette solution est soutenue par le navigateur Netscape), et l'autre de Microsoft (soutenue par l'Explorer Internet). Pour les deux solutions existe un logiciel sp&eacute;cial. Les deux programmes permettent aussi de convertir des polices banales comme TrueType ou Adobe dans le nouveau format de fichier ou d'importer les diff&eacute;rents signes n&eacute;cessaires dans la police &egrave; t&eacute;l&eacute;charger devant &ecirc;tre cr&eacute;&eacute;e. Pour &eacute;crire pour les deux navigateurs, il y a deux solutions: soit vous cr&eacute;ez les deux types de police &agrave; t&eacute;l&eacute;charger et travaillez donc avec les  deux programmes en parall&egrave;le, soit vous vous limitez &agrave; la technique Bitstream/Truedoc, car il existe pour l'Explorer Internet un contr&ocirc;le  ActiveX qui permet &agrave; ce navigateur d'utiliser la technique Bitstream/Truedoc.</p>

<p>Dans le domaine de la conception Web, les polices &agrave; t&eacute;l&eacute;charger ne se sont pas particuli&egrave;rement impos&eacute;es apr&egrave;s plusieurs ann&eacute;es d'existence. La raison r&eacute;side d'une part dans maniement quelque peu inhabituel avec droits r&eacute;serv&eacute;s pour de telles polices (les polices sont seulement interpr&eacute;t&eacute;es quand elles sont charg&eacute;es d'une adresse domaine librement choisie, mais bien d&eacute;termin&eacute;e). D'autre part on a aussi conc&eacute;d&eacute; que la plupart des polices artificielles sont moins belles sur des &eacute;crans orient&eacute;s pixels que sur papier. Alors que seules peu de pages Web misent pour des raisons de conception sur les polices &agrave; t&eacute;l&eacute;charger, celles-ci peuvent par contre tout &agrave; fait &ecirc;tre une solution qui se d&eacute;fend au probl&egrave;me de l'internationalisation. Les pages Web qui par exemple contiennent des caract&egrave;res cyrilliques, pourraient utiliser des polices &agrave; t&eacute;l&eacute;charger pour s'assurer un affichage correct sur les ordinateurs occidentaux et am&eacute;ricains. &Agrave; vrai dire, une certaine am&eacute;lioration a aussi &eacute;t&eacute; apport&eacute;e pour ces cas par le  <img src="../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="unicode.htm"><b>syst&egrave;me Unicode</b></a> et les polices plus modernes qui couvrent la majeure partie du syst&egrave;me Unicode.</p>







<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;</td></tr></table>
<h2 class="Sh2"><a class="an" name="truedoc">TrueDoc (Bitstream)</a></h2>


<p><img src="../src/en.gif" width="16" height="10" border="0" alt="Page en langue anglaise">&nbsp;<a target="_top" href="http://www.bitstream.com/"><b>Bitstream</b></a> est une entreprise qui d&eacute;veloppe des solutions pour la repr&eacute;sentation de l'&eacute;criture dans les documents &eacute;lectroniques. Parmi les technologies qui y sont d&eacute;velopp&eacute;es, on trouve aussi celle qui porte le nom de <img src="../src/en.gif" width="16" height="10" border="0" alt="Page en langue anglaise">&nbsp;<a target="_top" href="http://www.truedoc.com/"><b>TrueDoc</b></a>. Sur les pages Web sur TrueDoc vous trouverez toutes les autres informations n&eacute;cessaires concernant la technologie TrueDoc.</p>

<p>Derri&egrave;re TrueDoc se cache un concept de police pour la publication &eacute;lectronique non limit&eacute;e &agrave; la plate-forme et con&ccedil;ue aussi sp&eacute;cialement pour &ecirc;tre utilis&eacute;e sur la toile. Les polices TrueDoc ne sont pas install&eacute;e chez l'utilisateur comme des polices ordinaires pour y &ecirc;tre ensuite &quot;disponibles&quot;, mais elles sont incorpor&eacute;es  ou r&eacute;f&eacute;renc&eacute;es dans des documents &eacute;lectroniques. Un logiciel qui interpr&egrave;te TrueDoc, reconna&icirc;t ces polices  et les charge avec les donn&eacute;es d'un document &agrave; afficher. Les donn&eacute;es d'un document format&eacute; avec des polices TrueDoc, sont ensuite affich&eacute;es &agrave; l'&eacute;cran de l'utilisateur conform&eacute;ment &agrave; ces polices.</p>

<p>Lors de l'utilisation sur la toile les conditions suivantes, pr&eacute;alables  au fonctionnement de la technologie TrueDoc, sont indispensables:</p>
<ul>
<li>En tant qu'auteur Web vous avez besoin du logiciel de d&eacute;veloppement payant pour les polices True-Doc de Bitstream. Vous pouvez acqu&eacute;rir ce logiciel sur les pages Web de TrueDoc.</li>
<li>Les polices du mod&egrave;le TrueDoc doivent &ecirc;tre incorpor&eacute;es dans les pages Web selon une convention bien pr&eacute;cise. La mise en &#339;uvre d&eacute;pend du serveur. Cela revient &agrave; dire que lors de la cr&eacute;ation des polices, vous d&eacute;terminez de quelle URI les polices peuvent &ecirc;tre t&eacute;l&eacute;charg&eacute;es. Elles ne fonctionnent alors que lorsque la page Web est appel&eacute;e par l'adresse correspondante. De cette fa&ccedil;on l'usage illicite et la copie pirate des polices est emp&ecirc;ch&eacute;. Le concept de s&eacute;curit&eacute; correspondant se nomme <var>DocLock</var> chez TrueDoc. Comment fonctionne dans le d&eacute;tail le concept DocLock, fait partie de la documentation du logiciel de d&eacute;veloppement TrueDoc.</li>
<li>Le navigateur WWW de l'utilisateur doit ma&icirc;triser la technologie TrueDoc. Netscape Netscape soutient la technologie TrueDoc &agrave; partir de la version 4.01 de son navigateur. Microsoft riposte avec le logiciel concurrent <img src="../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#weft"><b>WEFT</b></a>. D'un autre c&ocirc;t&eacute; Bitstream permet aux d&eacute;veloppeurs de polices TrueDoc, de proposer un contr&ocirc;le ActiveX pas tr&egrave;s grand qui permet de la m&ecirc;me fa&ccedil;on &agrave; l'Explorer Internet 4.0 ou plus, d'interpr&eacute;ter des pages Web comportant des polices TrueDoc incorpor&eacute;es.</li>
</ul>

<p>Les fichiers de police de ce genre ont l' extension <var>.pfr</var> (<i>&quot;Portable Font Resource&quot;</i>).</p>






<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;</td></tr></table>
<h2 class="Sh2"><a class="an" name="weft">Web Embedding Fonts Tool WEFT (Microsoft)</a></h2>

<p>Comme technologie pour les polices &agrave; t&eacute;l&eacute;charger, Microsoft a d&eacute;velopp&eacute; le programme <var>WEFT</var> (<i>Web Embedding Fonts Tool</i>). L' Explorer Internet MS soutient cette technologie &agrave; partir de la version 4.0 de son navigateur.</p>

<p>Vous pouvez t&eacute;l&eacute;charger le programme WEFT sous la <img src="../src/en.gif" width="16" height="10" border="0" alt="Page en langue anglaise">&nbsp;<a target="_top" href="http://www.microsoft.com/typography/web/embedding/weft/"><b>page d'accueil Microsoft WEFT</b></a>. Au m&ecirc;me endroit, vous trouverez aussi une introduction &agrave; la technologie WEFT.</p>

<p>Pour pouvoir utiliser judicieusement ce programme, &eacute;tablissez d'abord votre projet en utilisant &agrave; l'int&eacute;rieur de vos fichiers HTML les noms de polices d&eacute;sir&eacute;s avec les commandes HTML ou CSS habituelles pour le faire. Ensuite, vous pouvez lancer le <var>WEFT Wizard</var> (partie de WEFT). Avec cet assistant logiciel, vous pouvez faire analyser votre projet. Le WEFT Wizard recherche les noms de polices employ&eacute;s. Vous pouvez choisir pour laquelle des polices vous d&eacute;sirez cr&eacute;er un &quot;Font Object&quot;, &agrave; savoir un fichier de police.</p>

<p>Les fichiers de polices cr&eacute;&eacute;s avec WEFT ont l'extension <var>.eot</var>. Lors de la cr&eacute;ation de ces polices, il y a diverses options, par exemple celle de savoir si vous d&eacute;sirez une police distincte pour chaque fichier HTML ou une police commune pour tous les fichiers HTML. Weft acc&egrave;de &eacute;galement aux fichiers HTML que vous avez &eacute;tablis et en modifie le texte source aux endroits n&eacute;cessaires pour un affichage correct de la police cr&eacute;&eacute;e.</p>

<p>Lors de la cr&eacute;ation des fichiers EOT vous devez aussi mentionner le lieu o&ugrave; ils seront stock&eacute;s. Pour des projets WWW cela peut &ecirc;tre par exemple une adresse FTP &agrave; laquelle vous pouvez stocker des fichiers. Mentionnez en outre quelle adresses URI peuvent utiliser ces fichiers de polices. C'est une mesure qui doit emp&ecirc;cher que chacun puisse utiliser vos fichiers de polices en les r&eacute;f&eacute;ren&ccedil;ant dans ses propres projets.</p>

<p>La technologie Weft fonctionne mais est cependant limit&eacute;e &agrave; l'Explorer Internet - c'est &agrave; dire que les utilisateurs utilisant d'autres navigateurs n'en profitent pas.</p>






<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;</td></tr></table>
<h2 class="Sh2"><a class="an" name="incorporer">Incorporer des polices &agrave; t&eacute;l&eacute;charger en HTML</a></h2>

<p>Pour utiliser des polices &agrave; t&eacute;l&eacute;charger dans un fichier HTML, vous devez r&eacute;f&eacute;rencer les polices d'apr&egrave;s l'un des exemples suivants.</p>

<h3>Exemple 1 - incorporer des fichiers PFR (TrueDoc) d'apr&egrave;s la syntaxe HTML:</h3>

<table width="100%" cellpadding="10"><tr><td class="xmpcode" bgcolor="#FFFFE0"><pre>
&lt;html&gt;&lt;head&gt;&lt;title&gt;Test&lt;/title&gt;
&lt;link rel=&quot;fontdef&quot; src=&quot;http://www.miennes.com/fonts/chianti.pfr&quot;&gt;
&lt;/head&gt;&lt;body&gt;
&lt;font face=&quot;Chianti&quot;&gt;texte dans la police de l'exemple&lt;/font&gt;
&lt;/body&gt;&lt;/html&gt;
</pre></td></tr></table><p>

<h3>Exemple 2 -- incorporer des fichiers PFR (TrueDoc) d'apr&egrave;s la syntaxe CSS:</h3>

<table width="100%" cellpadding="10"><tr><td class="xmpcode" bgcolor="#FFFFE0"><pre>
&lt;html&gt;&lt;head&gt;&lt;title&gt;Test&lt;/title&gt;
&lt;style type=&quot;text/css&quot;&gt;
@font-face { font-family:Chianti XBd BT;
             src:url(http://www.miennes.com/fonts/chianti.pfr); }
&lt;/style&gt;
&lt;/head&gt;&lt;body&gt;
&lt;p style=&quot;font-family:Chianti XBd BT&quot;&gt;texte dans la police de l'exemple&lt;/p&gt;
&lt;/body&gt;&lt;/html&gt;
</pre></td></tr></table><p>

<h3>Exemple 3 - incorporer des fichiers EOT (Microsoft WEFT) d'apr&egrave;s la syntaxe CSS :</h3>

<table width="100%" cellpadding="10"><tr><td class="xmpcode" bgcolor="#FFFFE0"><pre>
&lt;html&gt;&lt;head&gt;&lt;title&gt;Test&lt;/title&gt;
&lt;style type=&quot;text/css&quot;&gt;
@font-face { font-family:Chianti XBd BT;
             src:url(http://www.meine.com/fonts/chianti.eot); }
&lt;/style&gt;
&lt;/head&gt;&lt;body&gt;
&lt;p style=&quot;font-family:Chianti XBd BT&quot;&gt;texte dans la police de l'exemple&lt;/p&gt;
&lt;/body&gt;&lt;/html&gt;
</pre></td></tr></table><p>

<h3>Explication:</h3>

<p>Les polices &agrave; t&eacute;l&eacute;charger sont incorpor&eacute;es dans l'ent&ecirc;te d'un fichier HTML utilisant de telles polices.</p>

<p>Vous pouvez incorporer une police &agrave; t&eacute;l&eacute;charger d'apr&egrave;s la technologie Bitstream (fichier PFR) soit avec une commande HTML <code>&lt;link&gt;</code> (comme dans l'exemple 1) ou avec une d&eacute;finition de feuille de style CSS (comme dans l'exemple 2). Utilisez la commande HTML <code>&lt;link&gt;</code> si vous travaillez avec la  commande HTML pour les polices (<code>&lt;font face=&gt;</code>). Cette solution est n&eacute;anmoins &agrave; d&eacute;conseiller aujourd'hui. De pr&eacute;f&eacute;rence travaillez avec les  mentions de feuilles de style CSS pour les polices, comme il est montr&eacute; dans l'exemple 2. Si vous utilisez les deux formes, incorporez la police d'apr&egrave;s les deux mod&egrave;les.</p>

<p>Vous n'avez pas besoin d'ex&eacute;cuter vous m&ecirc;me la syntaxe de feuille de style pour incorporer des fichiers EOT d'apr&egrave;s la technologie Microsoft. Les mentions du genre de celles de l'exemple 3 ci-dessus, sont effectu&eacute;es dans les fichiers concern&eacute;s de fa&ccedil;on autonome par le programme WEFT. Il importe peu ensuite que vous utilisiez la police dans le fichier HTML comme mention de feuille de style CSS ou de fa&ccedil;on traditionnelle avec <code>&lt;font face=&gt;</code>. L' Explorer Internet MS 4 reconna&icirc;t la r&eacute;f&eacute;rence dans chacun des cas et transmet aussi la police n&eacute;cessaire sur l'ordinateur de l'utilisateur.</p>


<h3 class="inf">Attention:</h3>

<p>Vous trouverez les descriptions relatives aux commandes utilis&eacute;es dans les exemples ci-dessus dans cette documentation aux endroits suivants:</p>

<p><img src="../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="../css/proprietes/fichier_police.htm"><b>formatage de police avec fichier de polices</b></a> (syntaxe CSS pour incorporer des fichiers de police)<br>
<img src="../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="../html/entete/relations.htm"><b> relations logiques d'un fichier HTML</b></a> (syntaxe HTML pour une liaison logique &agrave; d'autres fichiers)</p>

<p>Les polices Bitstream TrueDoc ne sont transmises correctement par les serveurs WWW au navigateur appelant que si un <img src="../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="../divers/typesmime.htm"><b>type Mime</b></a> correspondant est port&eacute; dans la configuration du serveur WWW. Priez le cas &eacute;ch&eacute;ant votre responsable Web/fournisseur d'acc&egrave;s/administrateur de porter pour vous la mention <code>application/font-tdpfr</code> pour les fichiers ayant l'extension <var>.pfr</var> sur le serveur Web, ou portez le type Mime vous m&ecirc;me dans la mesure o&ugrave; vous avez acc&egrave;s &agrave; la configuration serveur.</p>








<table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr><td colspan="2" bgcolor="#EEEEEE" class="doc">
&#160;<a href="#top"><img src="../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a>
</td></tr>
<tr><td bgcolor="#EEEEEE" class="doc" align="right"><a href="../graphisme/formats.htm"><img src="../src/suivant.gif" width="10" height="10" border="0" hspace="10" alt="page suivante"></a></td>
<td bgcolor="#FFFFFF"><img src="../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information"> <a href="../graphisme/formats.htm"><b>Formats graphiques pour les pages Web</b></a>
</td></tr>
<tr>
<td bgcolor="#EEEEEE" class="doc" align="right"><a href="unicode.htm"><img src="../src/precedent.gif" width="10" height="10" border="0" hspace="10" alt="page pr&eacute;c&eacute;dente"></a></td>
<td bgcolor="#FFFFFF" width="100%"><img src="../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information"> <a href="unicode.htm"><b>Le syst&egrave;me unicode</b></a>
</td>
</tr>
<tr><td colspan="2" bgcolor="#EEEEEE" class="doc">&#160;</td></tr>
</table><table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr>
<td bgcolor="#FFEEDD" class="nav"><a class="an" name="bottom"><img src="../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"></a> <a href="../index.htm"><b>SELFHTML</b></a>/<a href="../navigation/index.htm" target="_parent">Aides &agrave; la navigation</a> <img src="../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="index.htm"><b>Param&egrave;tres internationaux</b></a></td>
</tr>
</table>

<p>&copy; 2001 Stefan M&uuml;nz / &copy; 2003 Traduction <img src="../../src/courriel.gif" width="15" height="10" border="0" alt="Adresse &eacute;lectronique">&nbsp;<a href="mailto:13405@free.fr">Serge Fran&ccedil;ois, 13405@free.fr</a><br><img src="../../src/courriel.gif" width="15" height="10" border="0" alt="Adresse &eacute;lectronique">&nbsp;<a href="mailto:selfhtml@selfhtml.com.fr">selfhtml@selfhtml.com.fr</a></p>


</body>
</html>
