<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>SELFHTML: HTML/XHTML / Graphiques / incorporer des graphiques</title>
<link rel="stylesheet" type="text/css" href="../../src/selfhtml.css">
<meta name="description"    content="Comment incorporer des graphiques en HTML, quels types de graphiques sont appropri&eacute;s et &agrave; quoi vous devez faire attention.">
<meta name="keywords"       content="SELFHTML, HTML, XHTML, graphiques, GIF, JPG, JPEG, images,  GIF, JPEG, PNG, &lt;img&gt;, src=, alt=, width=, height=, border=, name=, longdesc=">
<meta name="author"         content="Stefan M&uuml;nz, selfhtml@teamone.de">
<meta http-equiv="content-type" content="text/html; charset=ISO-8859-1">
<meta name="DC.Publisher"   content="Serge Fran&ccedil;ois, selfhtml@selfhtml.com.fr">
<meta name="DC.Date"        content="2003-01-27T08:00+00:00">
<meta name="DC.Identifier"  content="http://selfhtml.selfhtml.com.fr/html/graphiques/incorporer.htm">
<meta name="DC.Language"    content="fr">
<meta name="DC.Rights"      content="../../editorial/copyright.htm">
<meta name="DC.Date.Create" content="2003-01-27T08:00+00:00">
<meta name="SELF.Version"   content="1">
<meta name="SELF.Pagetype"  content="Information">
<meta name="SELF.Path"      content="SELFHTML == ../../index.htm // HTML/XHTML == ../index.htm // Graphiques == index.htm">
<link rel="stylesheet" type="text/css" href="../../src/selfhtml.css">
<!-- Matomo -->
<script type="text/javascript">
  var _paq = window._paq = window._paq || [];
  /* tracker methods like "setCustomDimension" should be called before "trackPageView" */
  _paq.push(['trackPageView']);
  _paq.push(['enableLinkTracking']);
  (function() {
    var u="//matomo.boitasite.com/";
    _paq.push(['setTrackerUrl', u+'matomo.php']);
    _paq.push(['setSiteId', '1']);
    var d=document, g=d.createElement('script'), s=d.getElementsByTagName('script')[0];
    g.type='text/javascript'; g.async=true; g.src=u+'matomo.js'; s.parentNode.insertBefore(g,s);
  })();
</script>
<!-- End Matomo Code -->
</head>

<body bgcolor="#FFFFFF" text="#000000" link="#AA5522" vlink="#772200" alink="#000000">

<table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr><td bgcolor="#FFEEDD" class="nav"><a class="an" name="top"><img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"></a> <a href="../../index.htm"><b>SELFHTML</b></a>/<a href="../../navigation/index.htm" target="_parent">Aides &agrave; la navigation</a> <img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="../index.htm"><b>HTML/XHML</b></a> <img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="index.htm"><b>Graphiques</b></a></td>
</tr></table>

<table cellpadding="4" cellspacing="0" border="0" width="100%">

<tr>
<td bgcolor="#EEEEEE" class="doc" width="110"><img src="../../src/logo.gif" width="106" height="109" border="0" alt="SELFHTML"></td>
<td bgcolor="#EEEEEE" class="doc" valign="bottom" width="100%"><h2>Incorporer des graphiques</h2></td>
</tr>

<tr>
<td bgcolor="#EEEEEE" class="doc" valign="top" align="center">
<img src="../../src/docx.gif" width="30" height="20" vspace="6" border="0" alt="Page d'information: vue d'ensemble">
</td>

<td bgcolor="#FFFFFF" valign="top" nowrap>
<p>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#generalites"><b>G&eacute;n&eacute;ralit&eacute;s sur les graphiques</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#referencer"><b>D&eacute;finir une r&eacute;f&eacute;rence de graphique</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#largeur_hauteur"><b>Largeur et hauteur de graphiques</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#bordures"><b>Bordures autour de graphiques</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#noms"><b>Noms pour les graphiques</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#descriptif"><b>Descriptif pour les graphiques</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#autres_infos"><b>Autres informations</b></a><br>
</p>
</td>
</tr>

<tr><td colspan="2" bgcolor="#EEEEEE" class="doc">&#160;<a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&nbsp;</td></tr>
</table>



<h2 class="Sh2"><a class="an" name="generalites">G&eacute;n&eacute;ralit&eacute;s sur les graphiques</a></h2>

<p>Pour incorporer des graphiques dans vos fichiers HTML, il vous faut
r&eacute;f&eacute;rencer les fichiers aux endroits d&eacute;sir&eacute;s dans le code source HTML. Les formats de fichiers graphiques appropri&eacute;s au Web sont GIF et JPEG mais peu &agrave; peu aussi PNG (voyez &agrave; ce sujet <img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="../../graphisme/formats.htm"><b>formats graphiques pour pages Web</b></a>).</p>

<p>Quand vous cr&eacute;ez des fichiers HTML pour la toile, vous devez veiller &agrave; ce que les graphiques qui y sont r&eacute;f&eacute;renc&eacute;s ne soient pas trop grands, car des graphiques importants occasionnent des temps de chargement longs et d&eacute;couragent l'utilisateur. R&eacute;duisez le cas &eacute;ch&eacute;ant le nombre de couleurs pour vos graphiques, la taille de l'image et ne mettez pas trop de r&eacute;f&eacute;rences graphiques dans un seul fichier HTML. Dans tous les cas, vous devez mentionner aussi les  <img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#largeur_hauteur"><b>largeur et hauteur</b></a>.</p>

<p>Les graphiques sont pour HTML des <img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="../reference/elements.htm#elements_inline"><b>&eacute;l&eacute;ments incorpor&eacute;s</b></a>. Dans la variante HTML &quot;Strict&quot; ces &eacute;l&eacute;ments doivent &ecirc;tre plac&eacute;s dans des  <img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="../reference/elements.htm#elements_bloc"><b>&eacute;l&eacute;ments de bloc</b></a> par exemple dans un paragraphe de texte ou dans un passage commun ou &eacute;galement dans une cellule de tableau.</p>

<p>Avec une interface utilisateur graphique, telle que MS-Windows, Macintosh, KDE et autres, les navigateurs Web peuvent afficher les graphiques r&eacute;f&eacute;renc&eacute;s directement dans leur fen&ecirc;tre d'affichage. Les navigateurs Web pour des interfaces orient&eacute;es texte (par exemple DOS en mode texte, Unix en mode texte) doivent appeler un programme de visualisation graphique s&eacute;par&eacute; pour afficher un graphique.</p>

<p>Quand vous mettez en forme enti&egrave;rement de fa&ccedil;on graphique des fichiers HTML de votre projet Web, par exemple la page d'accueil, que vous n'utilisez presque pas de texte mais seulement des r&eacute;f&eacute;rences de graphiques, vous compliquez l'identification du contenu de votre projet par les programmes de recherche automatique sont se servent beaucoup de services de recherche sur la toile. Dans le doute vous devez mettre en balance ce qui est pour vous le plus important: l'aspect graphique ou l'identification du contenu. Au cas o&ugrave vous structurez d'importants fichiers HTML de votre projet WWW principalement avec des r&eacute;f&eacute;rences graphiques il vous faut alors au moins utiliser la possibilit&eacute offerte par les <img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="../entete/meta.htm"><b>Mentions Meta concernant le contenu</b></a>.</p>





<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&nbsp;
</td></tr></table>
<h2 class="Sh2"><img src="../../src/html20.gif" width="30" height="30" border="0" alt="HTML 2.0"><img src="../../src/xhtml10.gif" width="30" height="30" border="0" alt="XHTML 1.0"><img src="../../src/msie1.gif" width="30" height="30" border="0" alt="MSIE 1.0"><img src="../../src/netsc1.gif" width="30" height="30" border="0" alt="Netscape 1.0">&nbsp;<a class="an" name="referencer">D&eacute;finir une r&eacute;f&eacute;rence de graphique</a></h2>

<p>Vous pouvez r&eacute;f&eacute;rencer un graphique &agrave; un endroit de votre choix.</p>

<h3 class="xmp">Exemple:</h3>

<p><img src="../../src/docf.gif" width="15" height="10" border="0" alt="D&eacute;monstration - nouvelle fen&ecirc;tre">&nbsp;<a href="affichage/img.htm" target="_blank"><b>Exemple d'affichage: aper&ccedil;u</b></a></p>

<table width="100%" cellpadding="10"><tr><td class="xmpcode" bgcolor="#FFFFE0"><pre>
&lt;!DOCTYPE HTML PUBLIC &quot;-//W3C//DTD HTML 4.01 Strict//EN&quot;
       &quot;http://www.w3.org/TR/html4/strict.dtd&quot;&gt;
&lt;html&gt;
&lt;head&gt;
&lt;title&gt;Texte du titre&lt;/title&gt;
&lt;/head&gt;
&lt;body&gt;

&lt;h1&gt;Petit rat&lt;/h1&gt;

&lt;p&gt;&lt;img src=&quot;sourisdansante.gif&quot; alt=&quot;petit rat&quot;&gt;&lt;/p&gt;

&lt;/body&gt;
&lt;/html&gt;
</pre></td></tr></table>

<h3 class="xpl">Explication:</h3>

<p>Pour les r&eacute;f&eacute;rences de graphiques existent en HTML le rep&egrave;re <code>&lt;img&gt;</code> (<i>img = image = image, src = source = source</i>). Il s'agit d'un rep&egrave;re autonome sans contenu et ne n&eacute;cessitant pas de rep&egrave;re de fermeture. Gr&acirc;ce &agrave; des attributs, vous d&eacute;terminez les d&eacute;tails de la r&eacute;f&eacute;rence du graphique. Deux attributs sont obligatoires et doivent toujours &ecirc;tre mentionn&eacute;s:</p>

<p>Avec l'attribut <code>src=</code> vous pr&eacute;cisez le fichier graphique d&eacute;sir&eacute;. S'y appliquent les r&egrave;gles pour <img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="../generalites/referencer.htm"><b>r&eacute;f&eacute;rencer en HTML</b></a>. Quand par exemple le fichier graphique se trouve dans le m&ecirc;me r&eacute;pertoire que le fichier HTML o&ugrave; se trouve le fichier graphique, alors il suffit de mentionner simplement le nom du fichier du graphique - comme dans l'exemple ci-dessus. Le r&eacute;f&eacute;rencement avec des mentions de chemin relatives ou absolues est pourtant &eacute;galement possible de la m&ecirc;me fa&ccedil;on, par exemple:<br>
<code>&lt;img src=&quot;repertoire/fichier.gif&quot; alt=&quot;graphique&quot;&gt;<br>
&lt;img src=&quot;repertoire/sousrep/fichier.gif&quot; alt=&quot;graphique&quot;&gt;<br>
&lt;img src=&quot;../fichier.gif alt=&quot;graphique&quot;&quot;&gt;<br>
&lt;img src=&quot;../../../fichier.gif&quot; alt=&quot;graphique&quot;&gt;<br>
&lt;img src=&quot;../ailleurs/fichier.gif&quot; alt=&quot;graphique&quot;&gt;</code><br>
M&ecirc;me le r&eacute;f&eacute;rencement avec une URI compl&egrave;te est possible par exemple:<br>
&lt;img src=&quot;http://www.selfhtml.com.fr/taggi01.gif&quot; alt=&quot;Taggi&quot;&gt;</p>

<p>Pour l'attribut <code>alt=</code> entrez une alternative en texte pour le cas o&ugrave; le graphique ne peut &ecirc;tre affich&eacute;. Il existe de nombreuses raisons pour lesquelles un graphique ne peut pas &ecirc;tre affich&eacute;; par exemple, parce que l'utilisateur a d&eacute;sactiv&eacute; l'affichage de graphiques dans son navigateur, ou bien parce que l'utilisateur a interrompu le chargement de la page avant que le graphique ne soit transmis. L'alternative en texte peut &ecirc;tre un simple mot mais peut &ecirc;tre aussi un court descriptif comme par exemple:<br>
<code>&lt;img src=&quot;vuedavion.jpg alt=&quot;vue a&amp;eacute;rienne du terrain du 27/05/2001 &amp;agrave; environ 300m d'altitude&quot;&gt;</code><br>
L'attribut <code>alt</code> est obligatoire d'apr&egrave;s le standard HTML. Si pour une raison quelconque, vous ne voulez pas noter d'alternative en texte, par exemple parce qu'il s'agit de &quot;pixels transparents&quot;, alors notez <code>alt=&quot;&quot;</code> - une cha&icirc;ne de caract&egrave;res vide comme valeur affect&eacute;e.</p>


<h3 class="inf">Attention:</h3>

<p>Vous pouvez donc incorporer des graphiques d'adresses externes dans vos pages sans autre formalit&eacute;. Demandez cependant dans ce cas, l'autorisation de celui qui propose le graphique, car l'incorporation de graphiques est - &agrave; la diff&eacute;rence du contenu des pages ext&eacute;rieures - une appropriation de contenus ext&eacute;rieurs. Il n'existe pas non plus de garantie que la r&eacute;f&eacute;rence de graphique fonctionnera toujours &agrave; l'avenir, car si le d&eacute;tenteur du site retire le graphique de ses pages ou le renomme il n'y aura plus affich&eacute;e chez vous que ce que l'on appelle une broken image <img src="../../src/docf.gif" width="15" height="10" border="0" alt="D&eacute;monstration - nouvelle fen&ecirc;tre">&nbsp;<a href="affichage/broken_image.htm" target="_blank"><b>image au lien rompu</b></a>.</p>

<p>Veillez lors de l'affectation de valeur &agrave; l'attribut <code>src</code> &agrave; respecter &agrave; tout prix les majuscules et minuscules des noms de fichiers et de r&eacute;pertoires. La plupart des ordinateurs serveurs tournent avec des syst&egrave;mes d'exploitation qui diff&eacute;rencient s&eacute;v&egrave;rement les majuscules des minuscules. Le plus simple et le plus s&ucirc;r est d'employer des minuscules pour tous les noms de fichiers et de r&eacute;pertoires - en faisant de m&ecirc;me lors de l'attribution d'un nom quand vous r&eacute;f&eacute;rencez dans le fichier HTML.</p>

<p>Netscape interpr&egrave;te un attribut sp&eacute;cifique  <code>lowsrc=</code>, que vous pouvez noter en plus de l'attribut <code>src</code>, et pour lequel vous mentionnez un fichier graphique moins gourmand en m&eacute;moire que le graphique r&eacute;f&eacute;renc&eacute; avec <code>src=</code> . Le graphique <code>lowsrc</code> et alors charg&eacute; en premier par le navigateur et il peut d&eacute;j&agrave; l'afficher pendant que l'autre graphique est charg&eacute;. Cet attribut g&eacute;n&egrave;re cependant du code HTML non valide et s'est av&eacute;r&eacute; superflu dans la pratique.</p>

<p>Quand vous travaillez <b>conform&eacute;ment &agrave; XHTML</b> vous devez marquer l'&eacute;l&eacute;ment <code>img</code> comme &eacute;tant vide. Pour ce faire, notez le rep&egrave;re autonome sous la forme <code>&lt;img...&nbsp;/&gt;</code>.<br>
De plus amples renseignements &agrave; ce sujet dans le chapitre sur <img src="../../src/chap.gif" width="15" height="13" border="0" alt="Chapitre: vue d'ensemble">&nbsp;<a href="../xhtml/index.htm"><b>XHTML et HTML</b></a>.</p>




<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&nbsp;
</td></tr></table>
<h2 class="Sh2"><img src="../../src/html20.gif" width="30" height="30" border="0" alt="HTML 2.0"><img src="../../src/xhtml10.gif" width="30" height="30" border="0" alt="XHTML 1.0"><img src="../../src/msie1.gif" width="30" height="30" border="0" alt="MSIE 1.0"><img src="../../src/netsc1.gif" width="30" height="30" border="0" alt="Netscape 1.0">&nbsp;<a class="an" name="largeur_hauteur">Largeur et hauteur de graphiques</a></h2>

<p>Quand vous incorporez des graphiques dans des fichiers HTML que vous voulez proposer sur la toile, vous devez toujours mentionner la largeur et la hauteur du graphique. Ainsi le navigateur Web prend d&eacute;j&agrave; dans le fichier HTML sa taille et ne doit pas attendre d'avoir lu l'information d'ent&ecirc;te correspondante du fichier graphique. Cela lui permet de construire la page Web sans attendre, et, pour les graphiques qu'il n'a pas encore lus, de leur r&eacute;server d&eacute;j&agrave; une place libre correspondant &agrave; leur taille. Quand vous ne mentionnez ni largeur ni hauteur, le navigateur attend par contre pour afficher la page Web d'avoir lu toutes les mentions de taille dans les fichiers graphiques incorpor&eacute;s, ou bien il doit corriger l'affichage &agrave; l'&eacute;cran, ce qui n'est pas tr&egrave;s esth&eacute;tique.</p>

<h3 class="xmp">Exemple:</h3>

<p><img src="../../src/docf.gif" width="15" height="10" border="0" alt="D&eacute;monstration - nouvelle fen&ecirc;tre">&nbsp;<a href="affichage/img_width_height.htm" target="_blank"><b>Exemple d'affichage: aper&ccedil;u</b></a></p>

<table width="100%" cellpadding="10"><tr><td class="xmpcode" bgcolor="#FFFFE0"><pre>
&lt;!DOCTYPE HTML PUBLIC &quot;-//W3C//DTD HTML 4.01 Strict//EN&quot;
       &quot;http://www.w3.org/TR/html4/strict.dtd&quot;&gt;
&lt;html&gt;
&lt;head&gt;
&lt;title&gt;Texte du titre&lt;/title&gt;
&lt;/head&gt;
&lt;body&gt;

&lt;h1&gt;Ours dansant&lt;/h1&gt;

&lt;p&gt;&lt;img src=&quot;oursdansant.gif&quot; width=&quot;368&quot; height=&quot;383&quot; alt=&quot;ours dansant&quot;&gt;&lt;/p&gt;

&lt;/body&gt;
&lt;/html&gt;
</pre></td></tr></table>

<h3 class="xpl">Explication:</h3>

<p>Avec l'attribut <code>width=</code> [pixels] mentionnez la largeur du graphique et avec <code>height=</code> [pixels] sa hauteur (<i>width = largeur, height = hauteur</i>).</p>

<p>Pour obtenir la largeur et la hauteur exactes d'un graphique, vous avez besoin soit d'un programme graphique qui affiche ces valeurs, soit d'un &eacute;diteur HTML qui lors de l'incorporation d'un graphique lit tout de suite ces donn&eacute;es dans l'ent&ecirc;te du fichier graphique et ins&egrave;re ces mentions automatiquement dans le rep&egrave;re  <code>&lt;img&gt;</code>.</p>

<h3 class="inf">Attention:</h3>

<p>Vous pouvez &eacute;galement faire des mentions sur la largeur et la hauteur d'un graphique qui diff&egrave;rent intentionnellement des dimensions effectives du graphique. Vous pouvez ainsi obtenir des effets de distorsion int&eacute;ressants comme on en voit dans les dessins anim&eacute;s.</p>

<p>Outre des mentions en pixels pour <code>width=</code> et <code>height=</code> les mentions en pourcentage sont &eacute;galement permises. De telles mentions se r&eacute;f&egrave;rent &agrave; l'espace disponible. Quand par exemple le graphique se trouve dans un paragraphe de texte normal, la mention <code>width=&quot;100%&quot;</code>, fait en sorte que le graphique est repr&eacute;sent&eacute; sur toute la largeur de la fen&ecirc;tre d'affichage (d&eacute;duction faite des marges de la page Web affich&eacute;e). Le graphique en sera d&eacute;form&eacute;. Une mention en pourcentage est appropri&eacute;e par exemple pour les graphiques qui repr&eacute;sentent une ligne (comparez avec les <img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="../../graphisme/sortes.htm#barres"><b>barres (lignes de s&eacute;paration)</b></a>), pour &eacute;tendre cette ligne sur la largeur totale.</p>

<p>Si vous avez un graphique que vous aimeriez r&eacute;p&eacute;ter &agrave; un autre endroit en plus petit (par exemple un logo qui doit &ecirc;tre affich&eacute; en grand sur la page d'accueil et en plus petit dans les sous-pages), vous n'avez pas besoin de deux graphiques. Il suffit pour repr&eacute;senter un graphique plus petit de r&eacute;duire proportionnellement les donn&eacute;es relatives &agrave; sa largeur et &agrave; sa hauteur. Si votre logo par exemple mesure 300 pixels de large sur 200 pixels de haut, vous pouvez le repr&eacute;senter deux fois plus petit en mentionnant pour l'incorporer <code>width=150 height=100</code>. Ce n'est cependant judicieux que si le grand graphique a d&eacute;j&agrave; &eacute;t&eacute; affich&eacute; et se trouve dans la m&eacute;moire cache du navigateur WWW.</p>






<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&nbsp;
</td></tr></table>
<h2 class="Sh2"><img src="../../src/html32.gif" width="30" height="30" border="0" alt="HTML 3.2"><img src="../../src/xhtml10.gif" width="30" height="30" border="0" alt="XHTML 1.0"><img src="../../src/deprecie.gif" width="30" height="30" border="0" alt="en cours d'abandon"><img src="../../src/msie2.gif" width="30" height="30" border="0" alt="MSIE 2.0"><img src="../../src/netsc11.gif" width="30" height="30" border="0" alt="Netscape 1.1">&nbsp;<a class="an" name="bordures">Bordures autour de graphiques</a></h2>

<p>Vous pouvez d&eacute;cider que le navigateur dessine une bordure autour du graphique. Toutefois, l'attribut correspondant est class&eacute;  <i>en cours d'abandon</i> et doit dispara&icirc;tre du standard HTML &agrave; l'avenir. L'encadrement est &eacute;galement possible avec les feuilles de style CSS qui offrent beaucoup plus de possibilit&eacute;s.</p>

<h3 class="xmp">Exemple:</h3>

<p><img src="../../src/docf.gif" width="15" height="10" border="0" alt="D&eacute;monstration - nouvelle fen&ecirc;tre">&nbsp;<a href="affichage/img_border.htm" target="_blank"><b>Exemple d'affichage: aper&ccedil;u</b></a></p>

<table width="100%" cellpadding="10"><tr><td class="xmpcode" bgcolor="#FFFFE0"><pre>
&lt;!DOCTYPE HTML PUBLIC &quot;-//W3C//DTD HTML 4.01 Transitional//EN&quot;
       &quot;http://www.w3.org/TR/html4/loose.dtd&quot;&gt;
&lt;html&gt;
&lt;head&gt;
&lt;title&gt;Texte du titre&lt;/title&gt;
&lt;/head&gt;
&lt;body&gt;

&lt;h1&gt;Arbre au cr�puscule&lt;/h1&gt;

&lt;p&gt;&lt;img src=&quot;arbre.jpg&quot; width=&quot;320&quot; height=&quot;400&quot; border=&quot;4&quot; alt=&quot;Arbre au cr�puscule&quot;&gt;&lt;/p&gt;

&lt;/body&gt;
&lt;/html&gt;
</pre></td></tr></table>

<h3 class="xpl">Explication:</h3>

<p>En mentionnant <code>border=</code> dans la r&eacute;f&eacute;rence du graphique une bordure est d&eacute;finie autour du graphique (<i>border = bordure</i>). La valeur est donn&eacute;e en pixels et exprime l'&eacute;paisseur de la bordure. La couleur de la bordure est celle qu'aurait le texte au m&ecirc;me endroit.</p>






<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&nbsp;
</td></tr></table>
<h2 class="Sh2"><img src="../../src/html32.gif" width="30" height="30" border="0" alt="HTML 3.2"><img src="../../src/xhtml10.gif" width="30" height="30" border="0" alt="XHTML 1.0"><img src="../../src/msie4.gif" width="30" height="30" border="0" alt="MSIE 4.0"><img src="../../src/netsc3.gif" width="30" height="30" border="0" alt="Netscape 3.0">&nbsp;<a class="an" name="noms">Noms pour les graphiques</a></h2>

<p>Vous pouvez d&eacute;cider d'attribuer un nom au fichier graphique. C'est judicieux en liaison avec JavaScript. Le nom d'un graphique peut par exemple &ecirc;tre important pour l'objet JavaScript  <img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="../../javascript/objets/images.htm"><b>images</b></a>.</p>

<h3 class="xmp">Exemple:</h3>

<table width="100%" cellpadding="10"><tr><td class="xmpcode" bgcolor="#FFFFE0"><pre>
&lt;p&gt;&lt;img src=&quot;arbre.jpg&quot; width=&quot;320&quot; height=&quot;400&quot; name=&quot;vue_arbre&quot; alt=&quot;arbre au cr�puscule&quot;&gt;&lt;/p&gt;

</pre></td></tr></table>

<h3 class="xpl">Explication:</h3>

<p>Avec <code>name=</code> &agrave; l'int&eacute;rieur d'une r&eacute;f&eacute;rence graphique vous attribuez un nom au graphique. Le nom doit &ecirc;tre plac&eacute entre guillemets, ne doit pas &ecirc;tre trop long et ne peut comporter d'espaces, de caract&egrave;res sp&eacute;ciaux ni de signes avec accent. Le premier signe doit &ecirc;tre une lettre. Ensuite les chiffres sont &eacute;galement permis. Seuls les lettres, les chiffres et le tiret de soulignement (<code>_</code>), le trait d'union, (<code>-</code>), les deux points (<code>:</code>) ou le point (<code>.</code>) sont permis. En prenant JavaScript en consid&eacute;ration, le nom ne peut contenir que les lettres, les chiffres et le tiret de soulignement (<code>_</code>). Les majuscules et les minuscules sont diff&eacute;renci&eacute;es par des langages tels que JavaScript.</p>






<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&nbsp;
</td></tr></table>
<h2 class="Sh2"><img src="../../src/html40.gif" width="30" height="30" border="0" alt="HTML 4.0"><img src="../../src/xhtml10.gif" width="30" height="30" border="0" alt="XHTML 1.0"><img src="../../src/netsc6.gif" width="30" height="30" border="0" alt="Netscape 6.0">&nbsp;<a class="an" name="descriptif">Descriptif pour les graphiques</a></h2>

<p>Si la possibilit&eacute; de noter une courte alternative en texte &agrave; un graphique avec <code>alt=</code> ne vous suffit pas, vous pouvez aussi &agrave; partir de HTML 4.0 &eacute;tablir un lien &agrave; un emplacement  ou &agrave; un fichier o&ugrave se trouvent de plus amples informations sur le graphique. Le navigateur pourrait par exemple ne proposer un lien avec cet endroit que si le graphique ne peut &ecirc;tre affich&eacute;.</p>

<h3 class="xmp">Exemple:</h3>

<p><img src="../../src/docf.gif" width="15" height="10" border="0" alt="D&eacute;monstration - nouvelle fen&ecirc;tre">&nbsp;<a href="affichage/img_longdesc.htm" target="_blank"><b>Exemple d'affichage: aper&ccedil;u</b></a></p>

<table width="100%" cellpadding="10"><tr><td class="xmpcode" bgcolor="#FFFFE0"><pre>
&lt;!DOCTYPE HTML PUBLIC &quot;-//W3C//DTD HTML 4.01 Strict//EN&quot;
       &quot;http://www.w3.org/TR/html4/strict.dtd&quot;&gt;
&lt;html&gt;
&lt;head&gt;
&lt;title&gt;Texte du titre&lt;/title&gt;
&lt;/head&gt;
&lt;body&gt;

&lt;h1&gt;Belle �poque&lt;/h1&gt;

&lt;p&gt;
&lt;img src=&quot;retro.jpg&quot; width=&quot;271&quot; height=&quot;265&quot; alt=&quot;Belle �poque&quot; longdesc=&quot;retro.htm&quot;&gt;
&lt;/p&gt;

&lt;/body&gt;
&lt;/html&gt;
</pre></td></tr></table>

<h3 class="xpl">Explication:</h3>

<p>Avec l'attribut <code>longdesc=</code> vous pouvez &eacute;tablir un lien avec un
endroit o&ugrave le graphique sera d&eacute;crit plus pr&eacute;cis&eacute;ment sous forme de texte. Une URI est permise, c'est &agrave; dire que pour la mention s'appliquent les r&egrave;gles pour <img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="../generalites/referencer.htm"><b>r&eacute;f&eacute;rencer en HTML</b></a>.</p>

<h3 class="inf">Attention:</h3>

<p>Seul Netscape 6.0 soutient cet attribut jusqu'alors et cela tr&egrave;s secr&egrave;tement: avec la touche droite de la souris cliquer sur le graphique et choisir l'option <i>propri&eacute;t&eacute;s</i> dans le menu contextuel, et dans la boite de dialogue qui appara&icirc;t alors, cliquer sur l'adresse figurant pour la <i>description</i>.</p>




<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="autres_infos">Autres informations</a></h2>

<p>Dans le <img src="../../src/chap.gif" width="15" height="13" border="0" alt="Chapitre: vue d'ensemble">&nbsp;<a href="../reference/index.htm"><b>sommaire de r&eacute;f&eacute;rence HTML</b></a> vous trouverez des donn&eacute;es pr&eacute;cisant o&ugrave; le rep&egrave;re <code>&lt;img&gt;</code> peut &ecirc;tre mis, quels attributs il peut avoir et ce &agrave; quoi il faut veiller pour ces diff&eacute;rents attributs :<br>
<img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="../reference/elements.htm#img"><b>r&eacute;f&eacute;rence pour les &eacute;l&eacute;ments</b></a> pour les r&eacute;f&eacute;rences de graphiques (<code>&lt;img&gt;</code>)<br>
<img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="../reference/attributs.htm#img"><b>r&eacute;f&eacute;rence pour les attributs</b></a> pour les r&eacute;f&eacute;rences de graphiques (<code>&lt;img&gt;</code>)</p>

<p>Le chapitre <img src="../../src/chap.gif" width="15" height="13" border="0" alt="Chapitre: vue d'ensemble">&nbsp;<a href="../../graphisme/index.htm"><b>graphisme</b></a> contient une introduction sur les graphiques conformes pour la toile avec des exemples et des descriptions pour les diff&eacute;rentes techniques graphiques.</p>







<table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr><td colspan="2" bgcolor="#EEEEEE" class="doc">
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a>
</td></tr>

<tr><td bgcolor="#EEEEEE" class="doc" align="right"><a href="aligner.htm"><img src="../../src/suivant.gif" width="10" height="10" border="0" hspace="10" alt="page suivante"></a></td>
<td bgcolor="#FFFFFF"><img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information"> <a href="aligner.htm"><b>Aligner les graphiques</b></a>
</td></tr>

<tr>
<td bgcolor="#EEEEEE" class="doc" align="right"><a href="../liens/clavier.htm"><img src="../../src/precedent.gif" width="10" height="10" border="0" hspace="10" alt="page pr&eacute;c&eacute;dente"></a></td>
<td bgcolor="#FFFFFF" width="100%"><img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information"> <a href="../liens/clavier.htm"><b>Recherche tabulateur et raccourcis clavier pour les liens</b></a>
</td>

</tr>
<tr><td colspan="2" bgcolor="#EEEEEE" class="doc">&nbsp;</td></tr>
</table>

<table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr><td bgcolor="#FFEEDD" class="nav"><a class="an" name="bottom"><img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"></a> <a href="../../index.htm"><b>SELFHTML</b></a>/<a href="../../navigation/index.htm" target="_parent">Aides &agrave; la navigation</a> <img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="../index.htm"><b>HTML/XHML</b></a> <img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="index.htm"><b>Graphiques</b></a></td>
</tr></table>

<p>&copy; 2001 Stefan M&uuml;nz / &copy; 2003 Traduction <img src="../../src/courriel.gif" width="15" height="10" border="0" alt="Adresse &eacute;lectronique">&nbsp;<a href="mailto:13405@free.fr">Serge Fran&ccedil;ois, 13405@free.fr</a><br><img src="../../src/courriel.gif" width="15" height="10" border="0" alt="Adresse &eacute;lectronique">&nbsp;<a href="mailto:selfhtml@selfhtml.com.fr">selfhtml@selfhtml.com.fr</a></p>

</body>
</html>
