<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>SELFHTML: XML/DTD / Repr&eacute;sentation de donn&eacute;es XML / Syntaxe XPath</title>
<link rel="stylesheet" type="text/css" href="../../src/selfhtml.css">
<meta name="description"    content="Quelles missions a le langage XPath et comment les chemins &agrave; des n&#339;uds peuvent &ecirc;tre repr&eacute;sent&eacute;s par XPath.">
<meta name="keywords"       content="SELFHTML, XML, XPath, adressage XPath, n&#339;uds, jeux de n&#339;uds, chemins, axes">
<meta name="author"         content="Stefan M&uuml;nz, selfhtml@teamone.de">
<meta http-equiv="content-type" content="text/html; charset=ISO-8859-1">
<meta name="DC.Publisher"   content="Serge Fran&ccedil;ois, selfhtml@selfhtml.com.fr">
<meta name="DC.Date"        content="2003-01-27T08:00+00:00">
<meta name="DC.Identifier"  content="http://selfhtml.selfhtml.com.fr/xml/representation/syntaxexpath.htm">
<meta name="DC.Language"    content="fr">
<meta name="DC.Rights"      content="../../editorial/copyright.htm">
<meta name="DC.Date.Create" content="2003-01-27T08:00+00:00">
<meta name="SELF.Version"   content="1">
<meta name="SELF.Pagetype"  content="Information">
<meta name="SELF.Path"      content="SELFHTML == ../../index.htm // XML/DTD == ../index.htm // Repr&eacute;sentation de donn&eacute;es XML == index.htm">
<!-- Matomo -->
<script type="text/javascript">
  var _paq = window._paq = window._paq || [];
  /* tracker methods like "setCustomDimension" should be called before "trackPageView" */
  _paq.push(['trackPageView']);
  _paq.push(['enableLinkTracking']);
  (function() {
    var u="//matomo.boitasite.com/";
    _paq.push(['setTrackerUrl', u+'matomo.php']);
    _paq.push(['setSiteId', '1']);
    var d=document, g=d.createElement('script'), s=d.getElementsByTagName('script')[0];
    g.type='text/javascript'; g.async=true; g.src=u+'matomo.js'; s.parentNode.insertBefore(g,s);
  })();
</script>
<!-- End Matomo Code -->
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#AA5522" vlink="#772200" alink="#000000">

<table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr>
<td bgcolor="#FFEEDD" class="nav"><a class="an" name="top"><img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"></a> <a href="../../index.htm"><b>SELFHTML</b></a>/<a href="../../navigation/index.htm" target="_parent">Aides &agrave; la navigation</a> <img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="../index.htm"><b>XML/DTD</b></a> <img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="index.htm"><b>Repr&eacute;sentation de donn&eacute;es XML</b></a></td>
</tr>
</table><table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr>
<td bgcolor="#EEEEEE" class="doc" width="110"><img src="../../src/logo.gif" width="106" height="109" border="0" alt="SELFHTML"></td>
<td bgcolor="#EEEEEE" class="doc" valign="bottom" width="100%"><h2>Syntaxe XPath</h2>
<tr>
<td bgcolor="#EEEEEE" class="doc" valign="top" align="center">
<img src="../../src/docx.gif" width="30" height="20" vspace="6" border="0" alt="Page d'information: vue d'ensemble">
</td>
<td bgcolor="#FFFFFF" valign="top" nowrap>
<p>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#missionsxpath"><b>Les missions de XPath</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#typesnoeuds_axes_chemins"><b>Types de n&#339;uds, axes et chemins</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#notation"><b>Notation compl&egrave;te et abr&eacute;g&eacute;e</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#racine_document"><b>Adressage de la racine du document</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#mentions_chemin_absolu"><b>Adressage avec mentions de chemin absolue</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#mentions_chemin_relatif"><b>Adressage avec mentions de chemin relatives</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#attribute"><b>Adressage d'attributs</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#wildcards"><b>Adressage avec des jokers (caract&egrave;res de remplacement)</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#position_conditions"><b>Adressage avec des mentions de position et des conditions</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#operateurs"><b>Op&eacute;rateurs XPath</b></a><br>
</p>
</td>
</tr><tr><td colspan="2" bgcolor="#EEEEEE" class="doc">&#160;<a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;</td></tr>
</table>



<h2 class="Sh2"><a class="an" name="missionsxpath">Les missions de XPath</a></h2>

<p>XPath est tout comme XML, XSL et XSLT un projet de langage du consortium  W3. Pour  XPath il y a un groupe de travail distinct au W3C qui travaille &agrave; la sp&eacute;cification du langage XPath. En Novembre 1999, a &eacute;t&eacute; publi&eacute;e la version 1.0 de la recommandation  (Recommendation) pour  XPath. Vous pouvez suivre la sp&eacute;cification actuelle et l'&eacute;volution du langage XPath &agrave; l'adresse <img src="../../src/en.gif" width="14" height="10" border="0" alt="english page">&nbsp;<a href="http://www.w3.org/TR/xpath"><b>Page d'accueil du W3 &agrave; XPath</b></a>.</p>

<p>XPath est en fin de compte une esp&egrave;ce de langage compl&eacute;mentaire, indispensable pour que XSLT puisse r&eacute;aliser ses t&acirc;ches. Xpath a ici <b>trois</b> t&acirc;ches importantes:</p>

<ul>
<li>Adressage de donn&eacute;es</li>
<li>D&eacute;finition d'expressions logiques</li>
<li>Fonctions suppl&eacute;mentaires</li>
</ul>


<h3>Adressage de donn&eacute;es</h3>

<p>Lors de la transcription d'une structure de documents XML en une autre structure de documents XML, donc par exemple la transcription d'un document avec une DTD XML personnelle en un document HTML, il est important que chaque partie constituante de la structure de donn&eacute;es puisse &ecirc;tre adress&eacute;e avec pr&eacute;cision. Si par exemple vous avez dans l'arborescence de sortie (XML): <code>&lt;yeux couleur=&quot;gris bleu&quot;&gt;</code>, et que vous voulez en faire dans l'arbre de transformation (HTML): <code>&lt;th&gt;couleur des yeux&lt;/th&gt;&lt;td&gt;gris bleu&lt;/td&gt;</code>, alors, il vous faut acc&eacute;der &agrave; l'attribut <code>couleur</code> de l'&eacute;l&eacute;ment <code>yeux</code>. Supposons plus loin que l'&eacute;l&eacute;ment <code>yeux</code> est aussi bien un &eacute;l&eacute;ment-enfant d'un &eacute;l&eacute;ment nomm&eacute; <code>personne</code>, qu'il est aussi un &eacute;l&eacute;ment-enfant d'un &eacute;l&eacute;ment nomm&eacute; <code>portraitrobot</code> dans une autre branche du m&ecirc;me document XML. Cela vous laisse entrevoir qu'une syntaxe d'adressage utilisable est n&eacute;cessaire pour un adressage sans ambigu&iuml;t&eacute; des parties constitutives du document. Les cas typiques dans lesquels l'adressage XPath est utilis&eacute; sont par exemple l'attribut <code>select</code> de l'instruction <img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="elementsxslt.htm#value_of"><b>xsl:value-of</b></a> ou bien l'attribut <code>match</code> de l'instruction <img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="elementsxslt.htm#template"><b>xsl:template</b></a>.</p>

<p>L'adressage de donn&eacute;es avec XPath est d&eacute;crit plus bas sur cette page.</p>


<h3>D&eacute;finition d'expressions logiques</h3>

<p>On veut dire ici les expressions logiques qui sont trait&eacute;es par le processeur XSLT et qui sont importantes pour la fonctionnalit&eacute; de certains &eacute;l&eacute;ments XSLT. Les expressions logiques contiennent des op&eacute;rateurs et peuvent ainsi par exemple comparer deux valeurs. Similaire &agrave; l'adressage de donn&eacute;es, la d&eacute;finition d'expressions est plac&eacute;e dans certaines affectations de valeurs &agrave; des attributs d'&eacute;l&eacute;ments XSLT. Un exemple typique est l'attribut <code>test</code> de l'instruction <img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="elementsxslt.htm#if"><b>xsl:if</b></a>. Y est formul&eacute;e une condition qui peut &ecirc;tre vraie ou fausse. Ce n'est que lorsqu'elle est vraie que les instructions subordonn&eacute;es sont ex&eacute;cut&eacute;es. Une condition telle que <code>test=&quot;age&nbsp;&amp;gt;=&nbsp;18&quot;</code> (est-ce que l'&eacute;l&eacute;ment <code>age</code> a une valeur sup&eacute;rieure ou &eacute;gale &agrave; 18?) est une telle expression logique. Sa syntaxe est fond&eacute;e sur XPath.</p>

<p>La d&eacute;finition d'expressions logiques avec XPath est d&eacute;crite sur cette page dans la partie sur les <img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#operateurs"><b>op&eacute;rateurs XPath</b></a> .</p>


<h3>Fonctions suppl&eacute;mentaires</h3>

<p>La panoplie de fonctions suppl&eacute;mentaires de XSLT qui r&eacute;alisent certaines t&acirc;ches ne sont pas le moindre du grand &eacute;ventail de prestations assur&eacute;es par XLST. Ainsi par exemple il y a une fonction <code>position()</code>, qui lors du traitement de plusieurs &eacute;l&eacute;ments renvoie dans l'ordre, le rang de l'&eacute;l&eacute;ment en cours de traitement. Cette information peut &ecirc;tre par exemple utilis&eacute;e pour num&eacute;roter les &eacute;l&eacute;ments dans l'arbre de transformation. Une autre fonction typique nomm&eacute;e <code>starts-with()</code> v&eacute;rifie si une cha&icirc;ne de caract&egrave;res commence avec une certaine sous-cha&icirc;ne de caract&egrave;res. Quand cette fonction est not&eacute;e par exemple comme condition dans une instruction <code>xsl:if</code>, La cr&eacute;ation de l'arbre de transformation peut &ecirc;tre influenc&eacute;e par la requ&ecirc;te pour savoir si la valeur d'un &eacute;l&eacute;ment commence par un certain signe ou une certaine cha&icirc;ne de caract&egrave;res. Ainsi, une condition telle que <code>test=&quot;starts-with(codepostal,'13')&quot;</code> pourrait par exemple demander si la valeur d'un code postal commence par <code>13</code>, et n'accepter dans l'arbre de transformation que les &eacute;l&eacute;ments qui remplissent cette condition.</p>

<p>Les fonctions suppl&eacute;mentaires sont d&eacute;crites &agrave; la pages sur les <img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="fonctionsxpath.htm"><b>fonctions XPath</b></a> .</p>





<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height
="10" border="0" alt="vers le bas"></a>&#160;
</td></tr></table>

<h2 class="Sh2"><img src="../../src/xpath10.gif" width="30" height="30" border="0" alt="XPath1.0">&nbsp;<a class="an" name="typesnoeuds_axes_chemins">Types de n&#339;uds, axes et chemins</a></h2>

<p>Les documents conformes &agrave; XML sont construits comme la structure de fichiers et de r&eacute;pertoires sur un support de donn&eacute;es. Il y a l&agrave; un r&eacute;pertoire racine qui peut contenir des r&eacute;pertoires (classeurs) et des fichiers. Chaque r&eacute;pertoire subordonn&eacute; peut &agrave; son tour contenir d'autres sous-r&eacute;pertoires et fichiers etc... On parle aussi ici d'arborescence. &Agrave; la page sur l'<img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="../regles/arborescence.htm"><b>Arborescence et n&#339;uds d'un fichier XML</b></a> il y a un d&eacute;but d'explication de ce mod&egrave;le.</p>

<p>De la m&ecirc;me fa&ccedil;on que l'on parle, pour la structure de fichiers sur un support de donn&eacute;es, de r&eacute;pertoires ou classeurs, de fichiers et de mentions de chemin, on a besoin pour l'adressage des parties constitutives d'un document XML d'une terminologie appropri&eacute;e. Dans ce but, il y a dans XPath diff&eacute;rents types de n&#339;uds, axes et chemins. Les termes que l'on trouve ici sont pr&eacute;sent&eacute;s ci apr&egrave;s. Les termes semblent tout d'abord un peu acad&eacute;miques, mais ils sont importants pour la compr&eacute;hension de XPath. Les termes originaux en anglais sont d&eacute;terminants et sont (<i>&eacute;crits en italique</i>).</p>

<h3><a name="types_noeuds">Types de n&#339;ud</a></h3>

<p>Chaque partie constitutive d'une structure arborescente de fichier XML est d&eacute;sign&eacute;e comme &eacute;tant un n&#339;ud . &Eacute;tant donn&eacute; qu'il y a  en XML pourtant tout &agrave; fait renomm&eacute;, autant de parties constitutives &agrave; faire que d'&eacute;l&eacute;ments d'attributs etc..., on parle de types de n&#339;uds correspondants. Les types de n&#339;uds ne font pas partie &agrave; proprement parler de la syntaxe d'adressage de XPath, il est pourtant avis&eacute; de conna&icirc;tre les termes. XPath distingue 7 types de n&#339;uds:</p>

<table cellpadding="0" cellspacing="0" border="0"
bgcolor="#C0C0C0"><tr><td>
<table cellpadding="3" cellspacing="1" border="0"
>
<tr>
<th bgcolor="#EEEEEE" class="doc" align="left">Type de n&#339;ud</th>
<th bgcolor="#EEEEEE" class="doc" align="left">Signification</th>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top">N&#339;ud racine<br><i>(root node)</i></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">Ceci est la racine d'un document XML. Le n&#339;ud racine n'est pas lui-m&ecirc;me un &eacute;l&eacute;ment mais la racine d'origine abstraite de l'arborescence du document.</td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top">N&#339;ud d'&eacute;l&eacute;ment<br><i>(element node)</i></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">Chaque &eacute;l&eacute;ment (m&ecirc;me l'&eacute;l&eacute;ment-document ) repr&eacute;sente pour XPath un n&#339;ud d'&eacute;l&eacute;ment. Un &eacute;l&eacute;ment nomm&eacute; <code>a</code>, comprenant un rep&egrave;re d'ouverture et un rep&egrave;re de fermeture <code>&lt;a&gt;...&lt;/a&gt;</code>, est par exemple un n&#339;ud-&eacute;l&eacute;ment <i>element node</i>. Les &eacute;l&eacute;ments subordonn&eacute;s (appel&eacute;s aussi &eacute;l&eacute;ments-enfants) sont de la m&ecirc;me fa&ccedil;on des n&#339;uds d'&eacute;l&eacute;ments <i>element nodes</i>, ainsi par exemple un &eacute;l&eacute;ment nomm&eacute;  <code>b</code>, comprenant un rep&egrave;re d'ouverture et de fermeture  <code>&lt;b&gt;...&lt;/b&gt;</code>, qui peut &ecirc;tre plac&eacute; &agrave; l'int&eacute;rieur de <code>&lt;a&gt;...&lt;/a&gt;</code>.</td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top">N&#339;ud d'attribut<br><i>(attribute node)</i></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">Chaque attribut qui appartient &agrave; un &eacute;l&eacute;ment est d&eacute;sign&eacute; comme n&#339;ud d'attribut. Un attribut  <code>b=&quot;quelconque&quot;</code>, qui est plac&eacute; dans le rep&egrave;re d'ouverture d'un &eacute;l&eacute;ment <code>a</code> et qui est donc not&eacute; ensuite sous la forme <code>&lt;a b=&quot;quelconque&quot;&gt;</code>, est consid&eacute;r&eacute; comme n&#339;ud d'attribut <i>attribute node</i> de l'&eacute;l&eacute;ment <code>a</code>. Le n&#339;ud d'attribut comprend donc le n&#339;ud d'attribut et la valeur affect&eacute;e.</td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top">N&#339;ud de texte<br><i>(text node)</i></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">Chaque contenu de texte qui ne contient aucun autre n&#339;ud est d&eacute;sign&eacute; comme n&#339;ud de texte. Dans une notation telle que <code>&lt;a b=&quot;quelconque&quot;&gt; et un petit texte&lt;/a&gt;</code> le contenu de l'&eacute;l&eacute;ment est un n&#339;ud de texte <i>text node</i>.</td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top">N&#339;ud d'espace de nommage<br><i>(namespace node)</i></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">Aussi bien les &eacute;l&eacute;ments que les attributs peuvent contenir des espaces de nommage, si les espaces de nommage correspondants sont import&eacute;s dans un fichier XML. Un peu comme les n&#339;uds d'attribut sont affect&eacute;s &agrave; un n&#339;ud d'&eacute;l&eacute;ment, les n&#339;uds d'espace de nommage sont affect&eacute;s sont affect&eacute;s &agrave; un n&#339;ud d'&eacute;l&eacute;ment ou &agrave; un n&#339;ud d'attribut. Pour une notation telle que <code>&lt;x:a y:b=&quot;quelconque&quot;&gt;</code>, <code>x</code> et <code>y</code> sont des mentions d'espace de nommage. <code>x</code> est un n&#339;ud d'espace de nommage <i>namespace node</i>, qui est affect&eacute; &agrave; l'&eacute;l&eacute;ment <code>a</code>, et <code>y</code> est un n&#339;ud d'espace de nommage <i>namespace node</i>, qui est affect&eacute; &agrave; l'attribut <code>b</code>.</td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top">N&#339;uds d'instructions de traitement<br><i>(processing instruction node)</i></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">Les instructions de traitement, qui sont plac&eacute;es dans un document XML (elles commencent par <code>&lt;?</code> et se terminent par <code>?&gt;</code>), figurent en dehors de l'arborescence proprement-dite du document. Elles ne repr&eacute;sentent pas pour XPath un type de n&#339;ud distinct, o&ugrave; la cible de l'instruction de traitement formerait le nom du n&#339;ud et le reste son contenu. Dans une instruction de traitement telle que <code>&lt;?xml-stylesheet type=&quot;text/xsl&quot; href=&quot;representation.xsl&quot;?&gt;</code> la partie <code>xml-stylesheet</code> est le nom du n&#339;ud.<br>
La d&eacute;claration XML <code>&lt;?xml version=&quot;1.0&quot;?&gt;</code> qui doit &ecirc;tre not&eacute;e au d&eacute;but d'un fichier XML n'est pas toutefois une instruction de traitement &agrave; proprement parler, m&ecirc;me si sa syntaxe est exactement la m&ecirc;me.</td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top">N&#339;uds de commentaires<br><i>(comment node)</i></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">Les commentaires, donc les contenus inclus dans les cha&icirc;nes de caract&egrave;res <code>&lt;!--</code> et <code>--&gt;</code>, sont d&eacute;sign&eacute;s comme n&#339;uds de commentaires. Le n&#339;ud de commentaires est ici le contenu du commentaire. Pour un commentaire tel que <code>&lt;!--quelconque--&gt;</code> la cha&icirc;ne de caract&egrave;res <code>quelconque</code> est le n&#339;ud de commentaires <i>comment node</i>.</td>
</tr>
</table>
</td></tr></table>

<h3><a name="achsen">Axes</a></h3>

<p>Il r&eacute;sulte de l'arborescence d'un document XML pour les diff&eacute;rents n&#339;uds que ceux-ci ont diverses relations les uns avec les autres. Ainsi il y a des n&#339;uds qui d&eacute;pendent d'autres n&#339;uds qui se trouvent sur un m&ecirc;me niveau. &Agrave; cet effet XPath dispose de diff&eacute;rents termes qui viennent de la terminologie de la g&eacute;n&eacute;alogie et qui sont d&eacute;sign&eacute;s comme &eacute;tant des axes (<i>axes</i>). Les termes anglais (repr&eacute;sent&eacute;s <i>en italique</i> dans le tableau ci-apr&egrave;s) sont aussi utilis&eacute;s pour l'<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#notation"><b>adressage complet</b></a>. XPath distingue 13 Axes:</p>

<table cellpadding="0" cellspacing="0" border="0"
bgcolor="#C0C0C0"><tr><td>
<table cellpadding="3" cellspacing="1" border="0"
>
<tr>
<th bgcolor="#EEEEEE" class="doc" align="left">Axe</th>
<th bgcolor="#EEEEEE" class="doc" align="left">Signification</th>
<th bgcolor="#EEEEEE" class="doc" align="left">Visualisation</th>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top">Enfant<br><i>(child)</i></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">n&#339;ud imm&eacute;diatement subordonn&eacute;. Dans une structure comme <code>&lt;a&gt;&lt;b&gt;...&lt;/b&gt;&lt;/a&gt;</code> l'&eacute;l&eacute;ment <code>b</code> par rapport &agrave; l'&eacute;l&eacute;ment <code>a</code> un enfant <i>child</i>.</td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top" nowrap>voir <img src="../../src/docf.gif" width="15" height="10" border="0" alt="D&eacute;monstration - nouvelle fen&ecirc;tre">&nbsp;<a href="affichage/child.htm" target="_blank"><b>repr&eacute;sentation graphique</b></a></td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top">Parent<br><i>(parent)</i></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">Le n&#339;ud imm&eacute;diatement hi&eacute;rarchiquement sup&eacute;rieur. Dans une structure telle que <code>&lt;a&gt;&lt;b&gt;...&lt;/b&gt;&lt;/a&gt;</code> L'&eacute;l&eacute;ment <code>a</code> est par rapport &agrave; l'&eacute;l&eacute;ment <code>b</code> un parent <i>parent</i>.</td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top" nowrap>voir <img src="../../src/docf.gif" width="15" height="10" border="0" alt="D&eacute;monstration - nouvelle fen&ecirc;tre">&nbsp;<a href="affichage/parent.htm" target="_blank"><b>repr&eacute;sentation graphique</b></a></td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top">Descendant<br><i>(descendant)</i></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">N&#339;uds subordonn&eacute;s, m&ecirc;me ceux qui sont plus &eacute;loign&eacute;s dans la descendance que les enfants. Dans une structure telle que <code>&lt;a&gt;&lt;b&gt;&lt;c&gt;...&lt;/c&gt;&lt;/b&gt;&lt;/a&gt;</code> aussi bien l'&eacute;l&eacute;ment <code>b</code> que l'&eacute;l&eacute;ment <code>c</code> sont par rapport &agrave; l'&eacute;l&eacute;ments <code>a</code> un descendant <i>descendant</i>.</td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top" nowrap>voir <img src="../../src/docf.gif" width="15" height="10" border="0" alt="D&eacute;monstration - nouvelle fen&ecirc;tre">&nbsp;<a href="affichage/descendant.htm" target="_blank"><b>repr&eacute;sentation graphique</b></a></td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top">Anc&ecirc;tre<br><i>(ancestor)</i></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">N&#339;uds hi&eacute;rarchiquement sup&eacute;rieurs, m&ecirc;me ceux qui sont plus &eacute;loign&eacute;s dans l'ascendance que les parents. Dans une structure telle que <code>&lt;a&gt;&lt;b&gt;&lt;c&gt;...&lt;/c&gt;&lt;/b&gt;&lt;/a&gt;</code>, aussi bien l'&eacute;l&eacute;ment <code>b</code> que l'&eacute;l&eacute;ment <code>a</code> est par rapport &agrave; l'&eacute;l&eacute;ment <code>c</code> un anc&ecirc;tre <i>ancestor</i>.</td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top" nowrap>voir <img src="../../src/docf.gif" width="15" height="10" border="0" alt="D&eacute;monstration - nouvelle fen&ecirc;tre">&nbsp;<a href="affichage/ancestor.htm" target="_blank"><b>repr&eacute;sentation graphique</b></a></td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top">N&#339;uds suivants <br><i>(following)</i></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">N&#339;uds qui suivent le n&#339;ud actuel dans le reste du document XML ind&eacute;pendamment de la hi&eacute;rarchie des n&#339;uds. Dans une structure telle que <code>&lt;a&gt;&lt;b&gt;&lt;c&gt;...&lt;/c&gt;&lt;/b&gt;&lt;b&gt;&lt;c&gt;...&lt;/c&gt;&lt;/b&gt;&lt;/a&gt;</code> le deuxi&egrave;me &eacute;l&eacute;ment <code>b</code>, le deuxi&egrave;me &eacute;l&eacute;ment <code>c</code> et leur contenu ont par rapport au premier &eacute;l&eacute;ment <code>c</code> le statut de suivants <i>following</i>.</td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top" nowrap>voir <img src="../../src/docf.gif" width="15" height="10" border="0" alt="D&eacute;monstration - nouvelle fen&ecirc;tre">&nbsp;<a href="affichage/following.htm" target="_blank"><b>repr&eacute;sentation graphique</b></a></td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top">N&#339;uds pr&eacute;c&eacute;dents<br><i>(preceding)</i></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">n&#339;uds qui pr&eacute;c&egrave;dent le n&#339;ud actuel dans le document XML, ind&eacute;pendamment de la hi&eacute;rarchie des n&#339;uds. Dans une structure telle que <code>&lt;a&gt;&lt;b&gt;&lt;c&gt;...&lt;/c&gt;&lt;/b&gt;&lt;b&gt;&lt;c&gt;...&lt;/c&gt;&lt;/b&gt;&lt;/a&gt;</code> l'&eacute;l&eacute;ment <code>a</code> et le premier &eacute;l&eacute;ment <code>b</code> ont par rapport au premier &eacute;l&eacute;ment <code>c</code> le statut de pr&eacute;c&eacute;dents <i>preceding</i>.</td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top" nowrap>voir <img src="../../src/docf.gif" width="15" height="10" border="0" alt="D&eacute;monstration - nouvelle fen&ecirc;tre">&nbsp;<a href="affichage/preceding.htm" target="_blank"><b>repr&eacute;sentation graphique</b></a></td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top">N&#339;uds fr&egrave;res  suivants<br><i>(following-sibling)</i></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">N&#339;uds qui suivent le n&#339;ud actuel dans le reste du document XML et cela sur le m&ecirc;me niveau hi&eacute;rarchique. Dans une structure telle que <code>&lt;a&gt;&lt;b&gt;&lt;c&gt;...&lt;/c&gt;&lt;c&gt;...&lt;/c&gt;&lt;/b&gt;&lt;/a&gt;&lt;c&gt;...&lt;/c&gt;</code>  le deuxi&egrave;me &eacute;l&eacute;ment <code>c</code> a par rapport au premier &eacute;l&eacute;ment <code>c</code> le statut de n&#339;ud fr&egrave;re suivant <i>following-sibling</i>, le troisi&egrave;me &eacute;l&eacute;ment <code>c</code> par contre non.</td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top" nowrap>voir <img src="../../src/docf.gif" width="15" height="10" border="0" alt="D&eacute;monstration - nouvelle fen&ecirc;tre">&nbsp;<a href="affichage/following_sibling.htm" target="_blank"><b>repr&eacute;sentation graphique</b></a></td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top">N&#339;uds fr&egrave;res pr&eacute;c&eacute;dents<br><i>(preceding-sibling)</i></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">N&#339;uds qui figurent avant le n&#339;ud actuel dans le document, et cela sur le m&ecirc;me niveau hi&eacute;rarchique. Dans une structure telle que <code>&lt;c&gt;...&lt;/c&gt;&lt;a&gt;&lt;b&gt;&lt;c&gt;...&lt;/c&gt;&lt;c&gt;...&lt;/c&gt;&lt;/b&gt;&lt;/a&gt;</code>  le deuxi&egrave;me &eacute;l&eacute;ment <code>c</code> a  par rapport au troisi&egrave;me &eacute;l&eacute;ment <code>c</code> le statut de n&#339;ud fr&egrave;re pr&eacute;c&eacute;dent <i>preceding-sibling</i>, le premier &eacute;l&eacute;ment <code>c</code> par contre non.</td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top" nowrap>voir <img src="../../src/docf.gif" width="15" height="10" border="0" alt="D&eacute;monstration - nouvelle fen&ecirc;tre">&nbsp;<a href="affichage/preceding_sibling.htm" target="_blank"><b>repr&eacute;sentation graphique</b></a></td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top">Attribut<br><i>(attribute)</i></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">N&#339;ud d'attribut d'un &eacute;l&eacute;ment. Les attributs re&ccedil;oivent ainsi bien qu'ils aient leur place dans la hi&eacute;rarchie d'une structure de document XML une place &agrave; part et se sont pas ins&eacute;r&eacute;s dans le sch&eacute;ma de la terminologie <i>child</i>, <i>parent</i>, <i>descendant</i> et <i>ancestor</i>. Dans une structure telle que <code>&lt;a b=&quot;quelconque&quot;&gt;</code>,  <code>b</code> est par rapport &agrave;  <code>a</code> un attribut <i>attribute</i>.</td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top" nowrap>&nbsp;</td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top">Espace de nommage<br><i>(namespace)</i></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">N&#339;ud d'espace de nommage de l'&eacute;l&eacute;ment actuel. Dans une structure telle que <code>&lt;x:a&gt;...&lt;/x:a&gt;</code>  <code>x</code> est l'espace de nommage <i>namespace</i> par rapport &agrave; l'&eacute;l&eacute;ment <code>a</code> .</td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top" nowrap>&nbsp;</td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top">Le n&#339;ud actuel proprement-dit<br><i>(self)</i></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">Le n&#339;ud actuel. Quand, dans une structure telle que <code>&lt;a&gt;&lt;b&gt;&lt;c&gt;...&lt;/c&gt;&lt;c&gt;...&lt;/c&gt;&lt;/b&gt;&lt;/a&gt;</code> l'&eacute;l&eacute;ment  <code>b</code> est juste en train d'&ecirc;tre trait&eacute; par le processeur XSLT, alors, cet &eacute;l&eacute;ment a &agrave; ce moment pr&eacute;cis, a le statut de n&#339;ud actuel <i>self</i>.</td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top" nowrap>voir <img src="../../src/docf.gif" width="15" height="10" border="0" alt="D&eacute;monstration - nouvelle fen&ecirc;tre">&nbsp;<a href="affichage/self.htm" target="_blank"><b>repr&eacute;sentation graphique</b></a></td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top">Descendants ou n&#339;ud actuel proprement-dit<br><i>(descending-or-self)</i></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">Le n&#339;ud actuel ou ses descendants. Quand, dans une structure telle que <code>&lt;a&gt;&lt;b&gt;&lt;c&gt;...&lt;/c&gt;&lt;c&gt;...&lt;/c&gt;&lt;/b&gt;&lt;/a&gt;</code> l'&eacute;l&eacute;ment <code>b</code> est juste en train d'&ecirc;tre trait&eacute; par le processeur XSLT, alors cet &eacute;l&eacute;ment et l'&eacute;l&eacute;ment descendant <code>c</code> ont &agrave; ce moment pr&eacute;cis le statut de descendant ou n&#339;ud actuel <i>descending-or-self</i>.</td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top" nowrap>voir <img src="../../src/docf.gif" width="15" height="10" border="0" alt="D&eacute;monstration - nouvelle fen&ecirc;tre">&nbsp;<a href="affichage/descending_or_self.htm" target="_blank"><b>repr&eacute;sentation graphique</b></a></td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top">Anc&ecirc;tres ou n&#339;ud actuel proprement-dit<br><i>(ancestor-or-self)</i></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">Le n&#339;ud actuel ou ses anc&ecirc;tres. Quand, dans une structure telle que <code>&lt;a&gt;&lt;b&gt;&lt;c&gt;...&lt;/c&gt;&lt;c&gt;...&lt;/c&gt;&lt;/b&gt;&lt;/a&gt;</code> l'&eacute;l&eacute;ment <code>b</code> est juste en train d'&ecirc;tre trait&eacute; par le processeur XSLT, alors cet &eacute;l&eacute;ment et l'&eacute;l&eacute;ment ascendant <code>a</code> ont &agrave; ce moment pr&eacute;cis le statut d'anc&ecirc;tre ou n&#339;ud actuel <i>ancestor-or-self</i>.</td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top" nowrap>voir <img src="../../src/docf.gif" width="15" height="10" border="0" alt="D&eacute;monstration - nouvelle fen&ecirc;tre">&nbsp;<a href="affichage/ancestor_or_self.htm" target="_blank"><b>repr&eacute;sentation graphique</b></a></td>
</tr>
</table>
</td></tr></table>




<h3><a name="chemins">Chemins</a></h3>

<p>Xpath tient &agrave; disposition deux moyens syntaxiques pour noter le chemin &agrave; un ou plusieurs n&#339;uds:</p>

<table cellpadding="0" cellspacing="0" border="0"
bgcolor="#C0C0C0"><tr><td>
<table cellpadding="3" cellspacing="1" border="0"
>
<tr>
<th bgcolor="#EEEEEE" class="doc" align="left">Notation</th>
<th bgcolor="#EEEEEE" class="doc" align="left">Description</th>
<th bgcolor="#EEEEEE" class="doc" align="left">Signification</th>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top"><code>/</code></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">Simple barre oblique</td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">Signe de s&eacute;paration du chemin pour des noms effectifs de n&#339;uds. Dans une structure telle que <code>&lt;a&gt;&lt;b&gt;&lt;c&gt;...&lt;/c&gt;&lt;c&gt;...&lt;/c&gt;&lt;/b&gt;&lt;/a&gt;</code> la mention de chemin de l'&eacute;l&eacute;ment <code>c</code> peut &ecirc;tre repr&eacute;sent&eacute;e sous la forme <code>a/b/c</code>.</td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top"><code>::</code></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">Deux fois deux points</td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">Signe de s&eacute;paration du chemin pour des mentions de n&#339;uds avec des axes. Dans une structure telle que <code>&lt;a&gt;&lt;b&gt;&lt;c&gt;...&lt;/c&gt;&lt;c&gt;...&lt;/c&gt;&lt;/b&gt;&lt;/a&gt;</code> la mention de chemin de l'&eacute;l&eacute;ment <code>c</code>  peut &ecirc;tre repr&eacute;sent&eacute;e par exemple sous la forme <code>a/b/child::c</code>. Plus de d&eacute;tails &agrave; ce sujet dans le paragraphe suivant.</td>
</tr>
</table>
</td></tr></table>
<br>&nbsp;



<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;
</td></tr></table>

<h2 class="Sh2"><img src="../../src/xpath10.gif" width="30" height="30" border="0" alt="XPath1.0">&nbsp;<a class="an" name="notation">Notation compl&egrave;te et abr&eacute;g&eacute;e</a></h2>

<p>Pour l'adressage des n&#339;uds d'une structure de donn&eacute;es XML, il y a des expressions comme <code>/child::personne/child::yeux/attribute::couleur</code>. De telles expressions sont d&eacute;sign&eacute;es comme <b>notation compl&egrave;te</b>, parce qu'elles comportent les d&eacute;signations d'axes compl&egrave;tes. L'expression <code>/child::personne/child::yeux/attribute::couleur</code> peut tout aussi bien s'&eacute;crire sous la forme <code>/personne/yeux/@couleur</code> . C'est la <b>notation abr&eacute;g&eacute;e</b> qui renonce &agrave; la d&eacute;signation des axes <code>child::</code> et permet quelques autres &quot;&eacute;conomies&quot;. Dans les exemples plus bas, les deux variantes de notation seront montr&eacute;es chaque fois en parall&egrave;le.</p>



<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;
</td></tr></table>

<h2 class="Sh2"><img src="../../src/xpath10.gif" width="30" height="30" border="0" alt="XPath1.0">&nbsp;<a class="an" name="racine_document">Adressage de la racine du document</a></h2>

<p>Chaque document XML a une racine qui peut &eacute;galement &ecirc;tre adress&eacute;e.</p>

<h3 class="xmp">Exemple:</h3>

<table width="100%" cellpadding="10"><tr><td class="xmpcode" bgcolor="#FFFFE0"><pre>
&lt;xsl:template match=&quot;/&quot;&gt;
&lt;html&gt;&lt;head&gt;&lt;title&gt;Exemple&lt;/title&gt;&lt;/head&gt;
&lt;body&gt;
 &lt;xsl:apply-templates /&gt;
&lt;/body&gt;&lt;/html&gt;
&lt;/xsl:template&gt;
</pre></td></tr></table>

<h3 class="xpl">Explication:</h3>

<p>Le n&#339;ud racine du document XML est adress&eacute; avec une simple barre oblique (<code>/</code>). Dans l'exemple un mod&egrave;le est d&eacute;fini avec <img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="elementsxslt.htm#template"><b>xsl:template</b></a> pour la racine du document XML. Dans l'attribut <code>match</code> la racine du document est adress&eacute;e.</p>



<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;
</td></tr></table>

<h2 class="Sh2"><img src="../../src/xpath10.gif" width="30" height="30" border="0" alt="XPath1.0">&nbsp;<a class="an" name="mentions_chemin_absolu">Adressage avec mentions de chemin absolues</a></h2>

<p>Les n&#339;uds d'un document XML peuvent &ecirc;tre adress&eacute;s &agrave; l'aide d'une mention de chemin absolue.</p>

<h3 class="xmp">Exemple 1 (notation compl&egrave;te):</h3>

<table width="100%" cellpadding="10"><tr><td class="xmpcode" bgcolor="#FFFFE0"><pre>
&lt;xsl:template match=&quot;/child::adresse/child::prenom&quot;&gt;
&lt;b&gt;&lt;xsl:value-of select=&quot;/child::adresse/child::prenom&quot;&gt;&lt;/b&gt;
&lt;/xsl:template&gt;
</pre></td></tr></table>

<h3 class="xmp">Exemple 2 (notation abr&eacute;g&eacute;e):</h3>

<table width="100%" cellpadding="10"><tr><td class="xmpcode" bgcolor="#FFFFE0"><pre>
&lt;xsl:template match=&quot;/adresse/prenom&quot;&gt;
&lt;b&gt;&lt;xsl:value-of select=&quot;/adresse/prenom&quot;&gt;&lt;/b&gt;
&lt;/xsl:template&gt;
</pre></td></tr></table>

<h3 class="xpl">Explication:</h3>

<p>Les mentions de chemin absolues commencent par une barre oblique (<code>/</code>), qui repr&eacute;sente la racine du document. Les autres niveaux de la hi&eacute;rarchie sont marqu&eacute;s par d'autres barres obliques. Les n&#339;uds par lesquels passe le chemin sont, comme dans l'exemple 1, indiqu&eacute;s par leur axe et leur nom de n&#339;ud s&eacute;par&eacute;s par deux fois deux points (<code>::</code>). De la m&ecirc;me fa&ccedil;on est permise et malgr&eacute; tout utilis&eacute;e plus souvent, la notation abr&eacute;g&eacute;e sans d&eacute;signation d'axes montr&eacute;e dans l'exemple 2. Dans l'exemple un mod&egrave;le est d&eacute;fini pour un &eacute;l&eacute;ment nomm&eacute; <code>prenom</code> gr&acirc;ce &agrave; l'instruction <code>xsl:template</code>; cet &eacute;l&eacute;ment est un &eacute;l&eacute;ment enfant de l'&eacute;l&eacute;ment  <code>adresse</code> qui est lui-m&ecirc;me un &eacute;l&eacute;ment enfant de la racine du document. La syntaxe est m&ecirc;me employ&eacute;e dans l'attribut <code>select</code> de l'instruction <img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="elementsxslt.htm#value_of"><b>xsl:value-of</b></a>.</p>





<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;
</td></tr></table>

<h2 class="Sh2"><img src="../../src/xpath10.gif" width="30" height="30" border="0" alt="XPath1.0">&nbsp;<a class="an" name="mentions_chemin_relatif">Adressage avec mentions de chemin relatives</a></h2>

<p>Les n&#339;uds d'un document XML peuvent &ecirc;tre adress&eacute;s &agrave; l'aide d'une mention de chemin relative.</p>

<h3 class="xmp">Structure XML suppos&eacute;e:</h3>

<table width="100%" cellpadding="10"><tr><td class="xmpcode" bgcolor="#FFFFE0"><pre>
&lt;ligue&gt;
 &lt;element_ligue&gt;
  &lt;joueur&gt;...&lt;/joueur&gt;
   &lt;resultat&gt;
    &lt;points&gt;...&lt;/points&gt;
   &lt;/resultat&gt;
 &lt;/element_ligue&gt;
&lt;/ligue&gt;
</pre></td></tr></table>


<h3 class="xmp">Exemple 1 (notation compl&egrave;te):</h3>

<table width="100%" cellpadding="10"><tr><td class="xmpcode" bgcolor="#FFFFE0"><pre>
&lt;xsl:template match=&quot;./child::element_ligue/child::resultat&quot;&gt;
 &lt;span class=&quot;normal&quot;&gt;&lt;xsl:value-of select=&quot;parent::joueur&quot;&gt;&lt;/span&gt;
 &lt;span class=&quot;accent&quot;&gt;&lt;xsl:value-of select=&quot;./child::points&quot;&gt;&lt;/span&gt;
&lt;/xsl:template&gt;
</pre></td></tr></table>

<h3 class="xmp">Exemple 2 (notation abr&eacute;g&eacute;e):</h3>

<table width="100%" cellpadding="10"><tr><td class="xmpcode" bgcolor="#FFFFE0"><pre>
&lt;xsl:template match=&quot;element_ligue/resultat&quot;&gt;
 &lt;span class=&quot;normal&quot;&gt;&lt;xsl:value-of select=&quot;../joueur&quot;&gt;&lt;/span&gt;
 &lt;span class=&quot;accent&quot;&gt;&lt;xsl:value-of select=&quot;points&quot;&gt;&lt;/span&gt;
&lt;/xsl:template&gt;
</pre></td></tr></table>

<h3 class="xpl">Explication:</h3>

<p>L'exemple suppose une structure d'&eacute;l&eacute;ments imbriqu&eacute;s typiques. Il suppose qu'il y a une d&eacute;finition de mod&egrave;le pour l'&eacute;l&eacute;ment <code>ligue</code> dans laquelle les mod&egrave;les subordonn&eacute;s sont appel&eacute;s avec l'instruction <img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="elementsxslt.htm#apply_templates"><b>xsl:apply-templates</b></a>. De plus l'exemple suppose que pour l'&eacute;l&eacute;ment <code>element_ligue</code> aucune d&eacute;finition de mod&egrave;le n'existe, mais qu'il y en a une pour son &eacute;l&eacute;ment enfant <code>resultat</code>. Pour adresser cet &eacute;l&eacute;ment par rapport &agrave; l'&eacute;l&eacute;ment grand-p&egrave;re <code>ligue</code>, une mention de chemin relative dans l'attribut <code>match</code> de l'instruction <img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="elementsxslt.htm#template"><b>xsl:template</b></a> est n&eacute;cessaire. Dans la notation compl&egrave;te, cette mention de chemin s'&eacute;nonce <code>./child::element_ligue/child::resultat</code>, dans la notation abr&eacute;g&eacute;e, plus facilement lisible <code>element_ligue/resultat</code>. La cha&icirc;ne de caract&egrave;res <code>./</code> (point et barre oblique) figure pour &quot;n&#339;ud actuel&quot;. Cette cha&icirc;ne de caract&egrave;res peut aussi &ecirc;tre omise. Autrement la mention de chemin relative consiste simplement dans la suite les noms de n&#339;uds d&eacute;terminant la hi&eacute;rarchie. Pour la notation compl&egrave;te la d&eacute;signation d'axe <code>child::</code> est ici encore utilis&eacute;e, tandis que pour la notation abr&eacute;g&eacute;e suffisent les simples noms de n&#339;uds (Dans l'exemple les noms d'&eacute;l&eacute;ments <code>element_ligue</code> et <code>resultat</code>). Le signe de s&eacute;paration des niveaux de la hi&eacute;rarchie est la simple barre oblique (<code>/</code>).</p>

<p>&Agrave; l'int&eacute;rieur de la d&eacute;finition de mod&egrave;le pour l'&eacute;l&eacute;ment <code>resultat</code> est not&eacute; entre autre du code HTML pour un autre &eacute;l&eacute;ment des donn&eacute;es de sortie, &agrave; savoir pour l'&eacute;l&eacute;ment <code>joueur</code>. Cet &eacute;l&eacute;ment se trouve cependant sur le m&ecirc;me niveau hi&eacute;rarchique que l'&eacute;l&eacute;ment actuel <code>resultat</code> (n&#339;uds fr&egrave;res). Pour l'adresser par rapport &agrave;  <code>resultat</code>, il doit &ecirc;tre adress&eacute; par le biais de l'&eacute;l&eacute;ment parent commun. Dans la notation compl&egrave;te la d&eacute;signation d'axe <code>parent::</code> est disponible, suivie du nom de l'autre n&#339;ud enfant. Dans la notation abr&eacute;g&eacute;e, la mention de deux points suivie d'une barre oblique suffit (<code>../</code>), pour d&eacute;crire le chemin par l'&eacute;l&eacute;ment parent.</p>

<p>Pour la sortie HTML de l'&eacute;l&eacute;ment <code>points</code> est utilis&eacute; de la m&ecirc;me fa&ccedil;on un adressage relatif. &Eacute;tant donn&eacute; que l'&eacute;l&eacute;ment  <code>points</code> est par rapport &agrave; l'&eacute;l&eacute;ment actuel <code>resultat</code> simplement un &eacute;l&eacute;ment enfant, les mentions <code>./child::points</code> (notation compl&egrave;te) ou bien <code>points</code> (notation abr&eacute;g&eacute;e) suffisent pour l'adressage.</p>




<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;
</td></tr></table>

<h2 class="Sh2"><img src="../../src/xpath10.gif" width="30" height="30" border="0" alt="XPath1.0">&nbsp;<a class="an" name="attribute">Adressage d'attributs</a></h2>

<p>Les attributs d'&eacute;l&eacute;ments sont trait&eacute;s en  XPath comme des n&#339;uds d'attributs et adress&eacute;s comme tels.</p>

<h3 class="xmp">Exemple 1 (notation compl&egrave;te):</h3>

<table width="100%" cellpadding="10"><tr><td class="xmpcode" bgcolor="#FFFFE0"><pre>
&lt;xsl:template match=&quot;./child::yeux/attribute::couleur&quot;&gt;
  &lt;tr&gt;&lt;td&gt;&lt;b&gt;&lt;xsl:text&gt;couleur des yeux:&lt;/xsl:text&gt;&lt;/b&gt;&lt;/td&gt;
  &lt;td&gt;&lt;xsl:value-of select=&quot;.&quot; /&gt;&lt;/td&gt;&lt;/tr&gt;
&lt;/xsl:template&gt;
</pre></td></tr></table>

<h3 class="xmp">Exemple 2 (notation abr&eacute;g&eacute;e):</h3>

<table width="100%" cellpadding="10"><tr><td class="xmpcode" bgcolor="#FFFFE0"><pre>
&lt;xsl:template match=&quot;yeux/@couleur&quot;&gt;
  &lt;tr&gt;&lt;td&gt;&lt;b&gt;&lt;xsl:text&gt;couleur des yeux:&lt;/xsl:text&gt;&lt;/b&gt;&lt;/td&gt;
  &lt;td&gt;&lt;xsl:value-of select=&quot;.&quot; /&gt;&lt;/td&gt;&lt;/tr&gt;
&lt;/xsl:template&gt;
</pre></td></tr></table>

<h3 class="xpl">Explication:</h3>

<p>L'exemple suppose qu'il y a une notation XML <code>&lt;yeux couleur=&quot;...&quot;&gt;</code>. Un mod&egrave;le distinct est d&eacute;fini pour l'attribut. Pour cela une rang&eacute;e de tableau sur deux colonnes est cr&eacute;&eacute;e dans l'arbre de transformation HTML dans lequel l'expression statique <code>couleur des yeux:</code> figure dans la colonne de gauche tandis que dans la colonne de droite est sortie la valeur de l'attribut <code>couleur=</code>. L'attribut <code>match</code> de la d&eacute;finition de mod&egrave;le est adress&eacute; de telle fa&ccedil;on que le mod&egrave;le puisse &ecirc;tre appel&eacute; par un &eacute;l&eacute;ment parent de <code>yeux</code>  - par exemple de <code>personne</code>-. Le chemin s'intitule alors dans la notation compl&egrave;te <code>./child::yeux/attribute::couleur</code> et dans la notation abr&eacute;g&eacute;e plus courante <code>yeux/@couleur</code>. Pour la notation compl&egrave;te les d&eacute;signations d'axes  <code>child::</code> (pour l'&eacute;l&eacute;ment enfant <code>child</code> par rapport &agrave; <code>personne</code>) et <code>attribute::</code> pour le choix de son attribut <code>couleur</code> sont utilis&eacute;es. Dans la notation abr&eacute;g&eacute;e, la mention relative de l'&eacute;l&eacute;ment enfant <code>yeux</code> et du nom de l'attribut pr&eacute;c&eacute;d&eacute; du signe &quot;chez&quot; (<code>@</code>)suffit.</p>




<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;
</td></tr></table>

<h2 class="Sh2"><img src="../../src/xpath10.gif" width="30" height="30" border="0" alt="XPath1.0">&nbsp;<a class="an" name="wildcards">Adressage avec des jokers (caract&egrave;res de remplacement)</a></h2>

<p>L'adressage avec des jokers (caract&egrave;res de remplacement) permet de choisir plusieurs n&#339;uds en une seule fois.</p>

<h3 class="xmp">Structure XML suppos&eacute;e:</h3>

<table width="100%" cellpadding="10"><tr><td class="xmpcode" bgcolor="#FFFFE0"><pre>
&lt;codefichier&gt;
 &lt;signature&gt;474946383961&lt;/signature&gt;
 &lt;screen-descriptor&gt;10000200B30000&lt;/screen-descriptor&gt;
 &lt;color-map&gt;000000BF000000BF00BFBF00&lt;/color-map&gt;
 &lt;extension-block&gt;21F90401000000&lt;/extension-block&gt;
 &lt;!-- etc... --&gt;
&lt;/codefichier&gt;
</pre></td></tr></table>

<h3 class="xmp">Exemple 1 (notation compl&egrave;te):</h3>

<table width="100%" cellpadding="10"><tr><td class="xmpcode" bgcolor="#FFFFE0"><pre>
&lt;xsl:template match=&quot;codefichier&quot;&gt;
 &lt;xsl:value-of select=&quot;child::*&quot; /&gt;
&lt;/xsl:template&gt;
</pre></td></tr></table>

<h3 class="xmp">Exemple 2 (notation abr&eacute;g&eacute;e):</h3>

<table width="100%" cellpadding="10"><tr><td class="xmpcode" bgcolor="#FFFFE0"><pre>
&lt;xsl:template match=&quot;codefichier&quot;&gt;
 &lt;xsl:value-of select=&quot;*&quot; /&gt;
&lt;/xsl:template&gt;
</pre></td></tr></table>

<h3 class="xpl">Explication:</h3>

<p>L'exemple suppose qu'&agrave; l'aide d'&eacute;l&eacute;ments XML la construction d'un fichier binaire est d&eacute;crite (dans l'exemple: le format GIF). Dans la sortie, les contenus de tous les &eacute;l&eacute;ments enfants de <code>codefichier</code> doivent &ecirc;tre &eacute;crits simplement sur une lanc&eacute;e. Dans la d&eacute;finition de mod&egrave;le de  <code>codefichier</code> ceci est obtenu dans l'attribut <code>select</code> de l'instruction <img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="elementsxslt.htm#value_of"><b>xsl:value-of</b></a> par la mention du caract&egrave;re de remplacement <code>*</code> (ast&eacute;risque). Dans la notation compl&egrave;te la mention de l'axe  <code>child::</code>est not&eacute;e, elle peut &ecirc;tre omise dans la notation abr&eacute;g&eacute;e.</p>

<h3 class="inf">Attention:</h3>

<p>Le caract&egrave;re de remplacement <code>*</code> (ast&eacute;risque) ne choisit que sur le niveau imm&eacute;diatement subordonn&eacute; hi&eacute;rarchiquement. Une forme accentu&eacute;e est la suite de caract&egrave;res <code>//</code> (deux barres obliques). Avec elle, le choix se porte sur tous les niveaux subordonn&eacute;s dans la hi&eacute;rarchie peu importe, le nombre d'embranchements &agrave; venir dans l'arborescence.</p>




<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;
</td></tr></table>

<h2 class="Sh2"><img src="../../src/xpath10.gif" width="30" height="30" border="0" alt="XPath1.0">&nbsp;<a class="an" name="position_conditions">Adressage avec des mentions de position et des conditions</a></h2>

<p>Par l'adressage absolu et relatif, il n'est pas encore possible d'adresser chaque &eacute;l&eacute;ment de son choix. Admettons qu'un &eacute;l&eacute;ment nomm&eacute; <code>liste</code> ait  25 &eacute;l&eacute;ments-enfants nomm&eacute;s <code>element_liste</code>, alors un adressage tel que <code>liste/element_liste</code> n'acc&egrave;de qu'au premier de ces &eacute;l&eacute;ments. Ce genre de probl&egrave;mes peut certes &eacute;galement &ecirc;tre ma&icirc;tris&eacute; par des boucles <img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="elementsxslt.htm#foreach"><b>xsl:for-each</b></a>, toutefois il arrive que l'on ne veuille adresser qu'un &eacute;l&eacute;ment bien pr&eacute;cis des &eacute;l&eacute;ments-enfants et non pas tous &agrave; la suite. Les exemples suivants montrent des adressages avec des mentions de position et des conditions pour adresser certains &eacute;l&eacute;ments distincts. Ici sont mises &eacute;galement en &#339;uvre en partie des  <img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="fonctionsxpath.htm"><b>fonctions XPath</b></a>.</p>

<p>Les parties composant la syntaxe plac&eacute;es entre crochets (<code>[]</code>) font partie &eacute;galement de l'&eacute;ventail des mentions pour l'adressage avec des mentions de position et des conditions. Ces parties constitutives sont d&eacute;sign&eacute;es par le terme <b>Pr&eacute;dicats</b>. Nombre des exemples qui suivent utilisent ces pr&eacute;dicats.</p>

<table cellpadding="0" cellspacing="0" border="0"
bgcolor="#C0C0C0"><tr><td>
<table cellpadding="3" cellspacing="1" border="0"
>
<tr>
<th bgcolor="#EEEEEE" class="doc" align="left">Exemple</th>
<th bgcolor="#EEEEEE" class="doc" align="left">Notation</th>
<th bgcolor="#EEEEEE" class="doc" align="left">Explication</th>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top"><code>self::liste</code></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">abr&eacute;g&eacute;e</td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">adresse l'&eacute;l&eacute;ment actuel seulement cependant lorsqu'il est du type <code>liste</code>.</td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top"><code>child::element_liste[position() = 3]</code></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">compl&egrave;te</td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">adresse le 3&egrave;me &eacute;l&eacute;ment-enfant du type <code>element_liste</code> &agrave; l'aide de la fonction XPath  <img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="fonctionsxpath.htm#position"><b>position()</b></a>.</td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top"><code>element_liste[3]</code></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">abr&eacute;g&eacute;e</td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">adresse le 3&egrave;me &eacute;l&eacute;ment-enfant du type <code>element_liste</code>.</td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top"><code>child::element_liste[position = last()]</code></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">compl&egrave;te</td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">adresse le dernier &eacute;l&eacute;ment-enfant du type <code>element_liste</code> &agrave; l'aide de la fonction XPath <img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="fonctionsxpath.htm#last"><b>last()</b></a>.</td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top"><code>element_liste[last()]</code></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">abr&eacute;g&eacute;e</td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">adresse le dernier &eacute;l&eacute;ment-enfant du type <code>element_liste</code> &agrave; l'aide de la fonction XPath <img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="fonctionsxpath.htm#last"><b>last()</b></a>.</td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top"><code>element_liste[last()-1]</code></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">abr&eacute;g&eacute;e</td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">adresse l'avant-dernier &eacute;l&eacute;ment-enfant du type <code>element_liste</code> &agrave; l'aide de la fonction XPath <img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="fonctionsxpath.htm#last"><b>last()</b></a>.</td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top"><code>/livre/chapitre[2]/partie[4]/paragraphe[17]</code></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">abr&eacute;g&eacute;e</td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">adresse dans un livre de fa&ccedil;on absolue le 17&egrave;me paragraphe de la 4&egrave;me partie du chapitre 2  (sous r&eacute;serve que les noms correspondants d'&eacute;l&eacute;ments correspondent en XML).</td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top"><code>child::yeux[attribute::couleur=&quot;bleu&quot;]</code></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">compl&egrave;te</td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">adresse l'&eacute;l&eacute;ment-enfant <code>yeux</code>, toutefois seulement s'il a un attribut <code>couleur=</code> qui a la valeur <code>bleu</code>.</td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top"><code>yeux[@couleur=&quot;bleu&quot;]</code></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">abr&eacute;g&eacute;e</td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">adresse l'&eacute;l&eacute;ment-enfant <code>yeux</code>, toutefois seulement s'il a un attribut <code>couleur=</code> qui a la valeur <code>bleu</code>.</td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top"><code>child::yeux[attribute::couleur and attribute::vision]</code></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">compl&egrave;te</td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">adresse l'&eacute;l&eacute;ment-enfant <code>yeux</code>, toutefois seulement s'il a aussi bien un attribut  <code>couleur=</code> qu'il a un attribut <code>vision=</code> (peu importe leurs valeurs affect&eacute;es).</td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top"><code>yeux[@couleur and @vision]</code></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">abr&eacute;g&eacute;e</td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">adresse l'&eacute;l&eacute;ment-enfant <code>yeux</code>, toutefois seulement s'il a aussi bien un attribut  <code>couleur=</code> qu'il a un attribut <code>vision=</code> (peu importe leurs valeurs affect&eacute;es).</td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top"><code>/child::*[self::index_contenu or self::index_motscles]</code></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">compl&egrave;te</td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">adresse de fa&ccedil;on absolue dans un livre tous les &eacute;l&eacute;ments-enfants sous la racine, seulement ceux cependant qui ont pour nom d'&eacute;l&eacute;ment <code>index_contenu</code> oui bien <code>index_motscles</code>.</td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top"><code>.</code></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">abr&eacute;g&eacute;e</td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">adresse le n&#339;ud actuel.</td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top"><code>..</code></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">abr&eacute;g&eacute;e</td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">adresse le n&#339;ud parent du n&#339;ud actuel.</td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top"><code>chapitre//paragraphe</code></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">abr&eacute;g&eacute;e</td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">adresse tous les &eacute;l&eacute;ments du type <code>paragraphe</code>, qui se trouvent par rapport &agrave; un n&#339;ud actuel, sous les &eacute;l&eacute;ments du type <code>chapitre</code>. La syntaxe <code>//</code> est &eacute;galement d&eacute;sign&eacute;e comme <i>recursive descent operator</i>. <code>//X</code> d&eacute;signe la m&ecirc;me chose que <code>/descendant-or-self::node()/X</code>.</td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top"><code>livre//chapitre[&lt; 5]</code></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">abr&eacute;g&eacute;e</td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">adresse les quatre premiers &eacute;l&eacute;ments-enfants du type <code>chapitre</code> &agrave; l'int&eacute;rieur d'un &eacute;l&eacute;ment du type <code>livre</code>.</td>
</tr>
</table>
</td></tr></table>
<br>&nbsp;










<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;
</td></tr></table>

<h2 class="Sh2"><img src="../../src/xpath10.gif" width="30" height="30" border="0" alt="XPath1.0">&nbsp;<a class="an" name="operateurs"><b>Op&eacute;rateurs XPath</b></a></h2>

<p>XPath propose une s&eacute;rie d'op&eacute;rateurs qui permettent de comparer des valeurs, d'effectuer des op&eacute;rations ou d'&eacute;valuer des expressions. Ces attributs peuvent &ecirc;tre plac&eacute;s dans les attributs de certains <img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="elementsxslt.htm"><b>&Eacute;l&eacute;ments XSLT</b></a>. L&agrave; ils aident &agrave; formuler des conditions, &agrave; calculer les positions d'&eacute;l&eacute;ment et plus encore. XPath conna&icirc;t les op&eacute;rateurs suivants:</p>



<table cellpadding="0" cellspacing="0" border="0"
bgcolor="#C0C0C0"><tr><td>
<table cellpadding="3" cellspacing="1" border="0"
>
<tr>
<th bgcolor="#EEEEEE" class="doc" align="left">Op&eacute;rateur</th>
<th bgcolor="#EEEEEE" class="doc" align="left">Signification</th>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top"><code>+</code></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">Addition</td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top"><code>-</code></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">Soustraction</td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top"><code>*</code></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">Multiplication - seulement cependant quand aucun des signes suivants n'est plac&eacute; devant l'op&eacute;rateur ni aucune des cha&icirc;nes de caract&egrave;res suivantes: <code>@ :: ( [ ) ,</code></td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top"><code>=</code></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">&eacute;gal (comparaison de deux valeurs)</td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top"><code>!=</code></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">diff&eacute;rent (comparaison de deux valeurs)</td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>&lt;</code> ou <code>&amp;lt;</code></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">plus petit que (comparaison de deux valeurs). Il est indispensable de masquer dans XSLT .</td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>&gt;</code> ou <code>&&amp;gt;</code></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">plus grand que (comparaison de deux valeurs). Il est recommand&eacute; de masquer dans XSLT.</td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>&lt;=</code> ou <code>&amp;lt;=</code></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">plus petit ou &eacute;gal &agrave; (comparaison de deux valeurs). Il est indispensable de masquer dans XSLT.</td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top" nowrap><code>&gt;=</code> ou <code>&amp;gt;=</code></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">plus grand ou &eacute;gal &agrave; (comparaison de deux valeurs). Il est recommand&eacute; de masquer dans XSLT.</td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top"><code>and</code></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">relation logique ET (les deux expressions)</td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top"><code>or</code></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">relation logique OU (une des deux expressions)</td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top"><code>div</code></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">division avec virgule flottante</td>
</tr>
<tr>
<td class="code" bgcolor="#FFFFE0" valign="top"><code>mod</code></td>
<td class="tabxpl" bgcolor="#E4EEFF" valign="top">reste de la division avec virgule flottante</td>
</tr>
</table>
</td></tr></table>
<br>&nbsp;












<table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr><td colspan="2" bgcolor="#EEEEEE" class="doc">
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a>
</td></tr>
<tr><td bgcolor="#EEEEEE" class="doc" align="right"><a href="fonctionsxpath.htm"><img src="../../src/suivant.gif" width="10" height="10" border="0" hspace="10" alt="page suivante"></a></td>
<td bgcolor="#FFFFFF"><img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information"> <a href="fonctionsxpath.htm"><b>Fonctions XPath</b></a>
</td></tr>
<tr>
<td bgcolor="#EEEEEE" class="doc" align="right"><a href="elementsxslt.htm"><img src="../../src/precedent.gif" width="10" height="10" border="0" hspace="10" alt="page pr&eacute;c&eacute;dente"></a></td>
<td bgcolor="#FFFFFF" width="100%"><img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information"> <a href="elementsxslt.htm"><b>&Eacute;l&eacute;ments XSLT</b></a>
</td>
</tr>
<tr><td colspan="2" bgcolor="#EEEEEE" class="doc">&#160;</td></tr>
</table><table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr>
<td bgcolor="#FFEEDD" class="nav"><a class="an" name="bottom"><img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"></a> <a href="../../index.htm"><b>SELFHTML</b></a>/<a href="../../navigation/index.htm" target="_parent">Aides &agrave; la navigation</a> <img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="../index.htm"><b>XML/DTD</b></a> <img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="index.htm"><b>Repr&eacute;sentation de donn&eacute;es XML</b></a></td>
</tr>
</table>

<p>&copy; 2001 Stefan M&uuml;nz / &copy; 2003 Traduction <img src="../../src/courriel.gif" width="15" height="10" border="0" alt="Adresse &eacute;lectronique">&nbsp;<a href="mailto:13405@free.fr">Serge Fran&ccedil;ois, 13405@free.fr</a><br><img src="../../src/courriel.gif" width="15" height="10" border="0" alt="Adresse &eacute;lectronique">&nbsp;<a href="mailto:selfhtml@selfhtml.com.fr">selfhtml@selfhtml.com.fr</a></p>



</body>
</html>
