<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>SELFHTML: Gestion de projets Web / Planification de projets Web</title>
<link rel="stylesheet" type="text/css" href="../src/selfhtml.css">
<meta name="description"    content="Ce &agrave; quoi vous devez veiller, avant de publier des projets sur Internet ou sur des Intranet.">
<meta name="keywords"       content="SELFHTML, Gestion de projets Web, gestion du site, planification de projets, d&eacute;finition de la cible, groupes cibl&eacute;s, travail de r&eacute;daction, &eacute;ch&eacute;ancier, calcul des co&ucirc;ts, hypertexte, coception Web, marque de fabrique, conception Web">
<meta name="author"         content="Stefan M&uuml;nz, selfhtml@teamone.de">
<meta http-equiv="content-type" content="text/html; charset=ISO-8859-1">
<meta name="DC.Publisher"   content="Serge Fran&ccedil;ois, selfhtml@selfhtml.com.fr">
<meta name="DC.Date"        content="2003-01-27T08:00+00:00">
<meta name="DC.Identifier"  content="http://selfhtml.selfhtml.com.fr/projet/planifier.htm">
<meta name="DC.Language"    content="fr">
<meta name="DC.Rights"      content="../editorial/copyright.htm">
<meta name="DC.Date.Create" content="2003-01-27T08:00+00:00">
<meta name="SELF.Version"   content="1">
<meta name="SELF.Pagetype"  content="Information">
<meta name="SELF.Path"      content="SELFHTML == ../index.htm // Gestion de projets Web == index.htm">
<!-- Matomo -->
<script type="text/javascript">
  var _paq = window._paq = window._paq || [];
  /* tracker methods like "setCustomDimension" should be called before "trackPageView" */
  _paq.push(['trackPageView']);
  _paq.push(['enableLinkTracking']);
  (function() {
    var u="//matomo.boitasite.com/";
    _paq.push(['setTrackerUrl', u+'matomo.php']);
    _paq.push(['setSiteId', '1']);
    var d=document, g=d.createElement('script'), s=d.getElementsByTagName('script')[0];
    g.type='text/javascript'; g.async=true; g.src=u+'matomo.js'; s.parentNode.insertBefore(g,s);
  })();
</script>
<!-- End Matomo Code -->
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#AA5522" vlink="#772200" alink="#000000">


<table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr>
<td bgcolor="#FFEEDD" class="nav"><a class="an" name="top"><img src="../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"></a> <a href="../index.htm"><b>SELFHTML</b></a>/<a href="../navigation/index.htm" target="_parent">Aides &agrave; la navigation</a> <img src="../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="index.htm"><b>Planification de projets Web</b></a></td>
</tr>
</table><table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr>
<td bgcolor="#EEEEEE" class="doc" width="110"><img src="../src/logo.gif" width="106" height="109" border="0" alt="SELFHTML"></td>
<td bgcolor="#EEEEEE" class="doc" valign="bottom" width="100%"><h2>Planification de projets Web</h2></td>
</tr>
<tr>
<td bgcolor="#EEEEEE" class="doc" valign="top" align="center">
<img src="../src/docx.gif" width="30" height="20" vspace="6" border="0" alt="Page d'information: vue d'ensemble">
</td>
<td bgcolor="#FFFFFF" valign="top" nowrap>
<p>
<img src="../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#generalites"><b>G&eacute;n&eacute;ralit&eacute;s sur les projets Web</b></a><br>
<img src="../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#cible"><b>Cible du projet</b></a><br>
<img src="../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#groupe_cible"><b>Groupe cibl&eacute; par le projet</b></a><br>
<img src="../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#environnement_projet"><b>Rechercher l'environnement du projet sur le Web</b></a><br>
<img src="../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#contenus"><b>Contenus et r&eacute;daction</b></a><br>
<img src="../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#couts"><b>Co&ucirc;ts</b></a><br>
<img src="../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#echeancier"><b>&Eacute;ch&eacute;ancier et annonce</b></a><br>
<img src="../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#articulation"><b>Articulation et structure</b></a><br>
<img src="../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#marque_fabrique"><b>Marque de fabrique (Corporate Design)</b></a><br>
<img src="../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#conception_web"><b>Conception Web</b></a><br>
</p>
</td>
</tr><tr><td colspan="2" bgcolor="#EEEEEE" class="doc">&#160;<a href="#bottom"><img src="../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;</td></tr>
</table>



<h2 class="Sh2"><a class="an" name="generalites">G&eacute;n&eacute;ralit&eacute;s sur les projets Web</a></h2>

<p>Les projets sur le WWW devraient toujours satisfaire &agrave; deux exigences: ils devraient d'une part former un tout et appara&icirc;tre comme tel &agrave; l'utilisateur sur le navigateur; d'autre part ils devraient aussi tenir compte de la r&eacute;alit&eacute; &agrave; savoir qu'ils font partie d'une plate-forme &agrave; l'&eacute;chelle du monde c'est &agrave; dire offrir la possibilit&eacute; &agrave; l'utilisateur sur son navigateur Web, de changer par des liens pour d'autres projets apparent&eacute;s au sujet sur la toile.</p>

<p>Ils ne sont pas rares ceux qui cherchent sur la toile un succ&egrave;s rapide ou tout au moins l'admiration des visiteurs de leurs page devant leurs exploits de programmeurs. Apr&egrave;s avoir pein&eacute; des jours &agrave; piquer ici et l&agrave; des tuyaux pour la mises en page et les effets sans se soucier du contenu, ils d&eacute;boulent finalement dans des forums sp&eacute;cialis&eacute;s pour demander comment ils peuvent prot&eacute;ger leur texte source de la curiosit&eacute; des visiteurs. Mais &ccedil;a ne marche pas comme &ccedil;a sur la toile et heureusement, celui qui ne veut que profiter sans rien donner, s'y condamne lui-m&ecirc;me.</p>

<p>Il n'y a certes aucune recette brevet&eacute;e pour des projets Web r&eacute;ussis et qui ont du succ&egrave;s, mais il y a entre-temps tout &agrave; fait des valeurs et recommandations empiriques pour une publication conviviale et rentable sur le Web. Le succ&egrave;s ne doit pas non plus toujours se traduire par une entr&eacute;e d'argent. Un ou deux nouveaux contacts int&eacute;ressants qui s'acqui&egrave;rent au fil du temps par un projet Web peuvent &quot;apporter&quot; beaucoup plus que des pages tapiss&eacute;es de bandeaux publicitaires, dont les fournisseurs ne pensent qu'en nombre de clics. Et finalement, une page d'accueil peut aussi tout simplement faire plaisir.</p>

<p>&Ecirc;tre sur la toile, c'est &ecirc;tre &quot;dans le vent&quot;. Mais la publicit&eacute; futile ou l'information banale  n'apportent rien ni &agrave; la toile, ni dans votre poche. Le Web a besoin d'orf&egrave;vres pour continuer &agrave; faire sensation. Et les orf&egrave;vres sont chers. &Agrave; vrai dire seuls les mordus peuvent apporter autant.</p>

<p>Cette partie rassemble des r&eacute;flexions que vous devez placer en t&ecirc;te d'un projet. Car une conception claire et une ligne de conduite r&eacute;fl&eacute;chie sont d&eacute;j&agrave; le premier pas pour r&eacute;ussir un projet.</p>




<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;</td></tr></table>
<h2 class="Sh2"><a class="an" name="cible">Cible du projet</a></h2>

<p>Exemples pour des cibles possibles d'un projet:</p>

<ul>
<li>Nous en tant que firme pr&eacute;sentons nous et nos produits/prestations   (communication)</li>
<li>Nous en tant que firme proposons une prestation directement gr&acirc;ce &agrave; ces pages Web (transactions, interaction, participation)</li>
<li>Moi en tant que particulier pr&eacute;sente mes activit&eacute;s dans ma sp&eacute;cialit&eacute; ou dans mes loisirs</li>
<li>Moi en tant que particulier organise sur ces pages WWW un &eacute;v&eacute;nement personnel </li>
<li>Nous en tant qu'institution/organisation/groupe ou club vous pr&eacute;sentons nos buts et nos activit&eacute;s</li>
<li>Nous en tant qu'institution/organisation/groupe ou club vous donnons la possibilit&eacute; dans ces pages Web de participer &agrave; une action d&eacute;termin&eacute;e </li>
<li>Je/Nous mets/mettons &agrave; la disposition g&eacute;n&eacute;rale sur ces pages WWW un gros volume d'informations sur un domaine sp&eacute;cialis&eacute; d&eacute;termin&eacute; </li>
<li>Je/nous collectionnons en vrac sur ces pages Web tout ce qui appartient &agrave; un domaine sp&eacute;cialis&eacute; d&eacute;termin&eacute; </li>
</ul>

<p>Cette liste d'exemples veut montrer d'abord qu'il peut y avoir des buts tr&egrave;s diff&eacute;rents , et qu'ensuite un m&ecirc;me fournisseur de pages Web peut suivre diff&eacute;rents buts.</p>

<p>Il est important que soient clairs pour vous dans la phase de conception le ou les buts d'un projet hypertexte pour le Web et que vous puissiez &eacute;clairer l'utilisateur qui appelle vos pages et ce, d&eacute;s la page d'accueil sur le but que vous poursuivez. Cela peut se faire de fa&ccedil;on explicite par des phrases telles que: &quot;<i>XY vous salue. Dans ces pages nous nous pr&eacute;sentons, nous et notre technique d'avant-garde etc...</i>&quot;, ou bien &quot;<i>Light your fire and feel free to loose yourself into this hyperspace</i>&quot;. Cela peut se passer aussi lors de l'ouverture de la page d'accueil. Ainsi une page d'accueil construite de fa&ccedil;on neutre (sans images d'arri&egrave;re plan, de graphiques anim&eacute;s de JavaScript etc...) fait passer le s&eacute;rieux du scientifique; une page styl&eacute;e &agrave; l'immobilisme &eacute;tudi&eacute; sugg&egrave;re chez l'utilisateur une grande firme ou institution bien &eacute;tablie ou un projet de dimensions monumentales. Une page bien en chair qui appelle l'attention en criant r&eacute;v&egrave;le par contre une petite entreprise faisant de la publicit&eacute; ou un projet d'amateur ne devant pas trop &ecirc;tre pris au s&eacute;rieux.</p>






<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;</td></tr></table>
<h2 class="Sh2"><a class="an" name="groupe_cible">Groupe cibl&eacute; par le projet</a></h2>

<p>Il est tout &agrave; fait aussi important que d&eacute;terminer la cible, de d&eacute;terminer le groupe cibl&eacute; par le projet. Des groupes potentiels cibl&eacute;s par le projet sont par exemple:</p>

<ul>
<li>Clients ou acheteurs potentiels </li>
<li>Amateurs ou milieux de passionn&eacute;s </li>
<li>Scientifiques/Experts</li>
<li>Enfants et adolescents </li>
<li>Familles </li>
<li>Passionn&eacute;s d'informatique et pirates en informatique </li>
<li>Ceux qui sont avides de plaisir</li>
<li>Curieux</li>
<li>Ceux qui sont &agrave; la recherche d'un sens</li>
</ul>

<p>Bien s&ucirc;r, vous pouvez essayer de satisfaire tous les visiteurs de vos pages Web. Mais c'est assez difficile et vous courez le risque de ne satisfaire personne compl&egrave;tement. Il est pr&eacute;f&eacute;rable de penser comment des personnes d&eacute;termin&eacute;es en butant sur vos pages les ajouteront imm&eacute;diatement &agrave; leurs favoris parce qu'ils reconna&icirc;tront tout de suite que ce sont des pages qui partagent leur centre d'int&eacute;r&ecirc;t, leur soif de connaissances, leur art de vivre ou leurs souhaits, pens&eacute;es ou esp&eacute;rance. Il y a par exemple des pages Web, sur lesquelles des personnes concern&eacute;es parlent d'une maladie peu courante dont ils souffrent. Celui maintenant qui lui-m&ecirc;me est concern&eacute; par cette maladie et qui cherche des informations la concernant sur la toile, et qui tombe sur ces pages, les d&eacute;vorera et elles seront tr&egrave;s importantes pour lui. Ces pages ont un groupe cible assez limit&eacute; mais de ce fait elles valent de l'or pour leur groupe cible.</p>

<p>De la m&ecirc;me fa&ccedil;on que le but de votre projet, il faut que l'utilisateur voit aussi &agrave; quel groupe celui-ci s'adresse. Pour cela conviennent des phrases explicites comme: &quot;<i>&Agrave; tous les cyclotouristes ces pages proposent des nouveaut&eacute;s techniques et des id&eacute;es d'excursions</i>&quot;. . Mais m&ecirc;me l'ouverture de la page d'accueil s&eacute;lectionne le public. Tout d&eacute;pend dans ce domaine de la relation des &eacute;l&eacute;ments entre eux. Un sombre ciel &eacute;toil&eacute; en arri&egrave;re plan visera aussi bien les cybernautes fanas de la manette de jeu que les &eacute;sot&eacute;riques perdus dans l'abstraction. Ce n'est que la symbolique de premier plan (par exemple des rayons aux couleurs agressives tir&eacute;s par des armes laser qui frappent un monstre ou bien un voile blanc qui est souffl&eacute; sur une pyramide) qui permet &agrave; l'intuition de conserver des rapports clairs.</p>





<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160</td></tr></table>
<h2 class="Sh2"><a class="an" name="environnement_projet">Rechercher l'environnement du projet sur le Web</a></h2>

<p>Avant tout, si vous voulez vendre quelque chose sur la toile ou si voulez que votre id&eacute;e ait du succ&egrave;s, vous devez d&eacute;j&agrave; rechercher dans la premi&egrave;re phase de planification s'il y a quelque chose concernant cette id&eacute;e sur le Web et si oui, quoi et avec quel succ&egrave;s. R&eacute;fl&eacute;chissez &agrave; cette fin &agrave; quelques mots cl&eacute;s caract&eacute;risant votre projet. Cherchez ces mots cl&eacute;s avec des grands moteurs de recherche.</p>

<p>&Eacute;valuez les r&eacute;sultats de la recherche d'apr&egrave;s les crit&egrave;res suivants:</p>
<ul>
<li><b>S'il n'y a rien concernant les termes recherch&eacute;s?</b> Cela peut vouloir dire que le monde attend justement ce que vous proposez. Cela peut aussi vouloir dire que &ccedil;a n'int&eacute;resse personne dans le monde. Dans ce cas, il est indiqu&eacute; de commencer avec une petite version du projet pas si d&eacute;velopp&eacute;e et d'attendre l'&eacute;cho qu'elle renvoie.</li>
<li><b>Si vous &ecirc;tes submerg&eacute; par les r&eacute;sultats concernant les termes recherch&eacute;s?</b> Cela peut aussi vouloir dire que vos projets sont dans le vent mais aussi qu'il n'y a pas grand chose de neuf &agrave; proposer. Suivez les liens des r&eacute;sultats des recherches et analysez soigneusement ce qui existe d&eacute;j&agrave; et comment vous pouvez vous distinguer nettement des offres existantes (par exemple &quot; premi&egrave;re offre de ce genre dans le SUD-EST &quot).</li>
</ul>








<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;</td></tr></table>
<h2 class="Sh2"><a class="an" name="contenus">Contenus et r&eacute;daction</a></h2>

<p>Les d&eacute;butants pensent souvent, &agrave; tort, qu'une &quot;mise en page exub&eacute;rante&quot; ou que quelques gadgets sensationnels rendent un projet Web int&eacute;ressant. L'exp&eacute;rience prouve le contraire: Les utilisateurs visitent des nouveaux projets Web, &eacute;trangers non pas parce qu'ils sont ivres de joie devant tous les machins multicolores &agrave; l'&eacute;cran, mais au contraire parce qu'ils cherchent quelque chose de bien d&eacute;termin&eacute; et qu'ils ont choisi le projet visit&eacute; comme candidat r&eacute;pondant &agrave; leur attente pour leur question. Ces visiteurs attendent bien une pr&eacute;sentation avenante, mais avant tout, ils veulent atteindre leur but le plus vite possible. Leur but n'est pas de &quot;contempler&quot; vos pages en y &quot;s&eacute;journant&quot;, mais la plupart du temps ils en visent la substance. Les visiteurs veulent des informations. M&ecirc;me quand il s'agit d'une boutique &eacute;lectronique, la plupart des visiteurs veulent en apprendre plus sur les produits sans se contenter du num&eacute;ro d'article et du prix. Et m&ecirc;me quand il s'agit simplement d'une page d'accueil priv&eacute;e, les visiteurs veulent apprendre quelque chose sur vous, sur vos pens&eacute;es etc... Le Web est avant tout un m&eacute;dia diffusant des informations et les projets Web doivent en tenir compte.</p>

<p>Cependant cr&eacute;er des contenus prend du temps, en assurer le maintenance et l'actualisation n'en prend pas moins. Pour le faire, le travail de r&eacute;daction est indispensable. Nombre de ceux qui publient sur le Web n'ont jamais auparavant &eacute;t&eacute; confront&eacute;s &agrave; des activit&eacute;s de r&eacute;daction ou n'ont fait que les effleurer. Le dicton de d&eacute;part du consortium W3 &quot;Everyone's a publisher!&quot; ne contient pas seulement les nouvelles possibilit&eacute;s techniques attrayantes de toucher un public mais aussi tout le travail d'un  &quot;Publishers&quot;, qui va avec. Le travail du texte est beaucoup trop souvent sous-estim&eacute; par rapport au travail de programmation d'un projet Web. Et c'est exactement la raison pour laquelle beaucoup de projets Web tr&egrave;s bien programm&eacute;s &eacute;chouent.</p>

<p>Au stade de planification d'un projet Web, vous devez absolument, pour cette raison r&eacute;fl&eacute;chir sur les points suivants:</p>

<ul>
<li><b>Contenus de d&eacute;part:</b> D'o&ugrave; doivent provenir les premiers contenus? Existe-t il des textes pr&ecirc;ts qui soient appropri&eacute;s? Y a t-il par exemple un prospectus de la firme, des articles scientifiques, des archives de documents, des bases de donn&eacute;es? Est-ce que ces sources sont vraiment appropri&eacute;es - ne contiennent elles pas par exemple de donn&eacute;es confidentielles qui ne sont pas destin&eacute;es au public? Les sources doivent elles donc &ecirc;tre r&eacute;&eacute;valu&eacute;es? Et quand aucune source existe - qui donc va cr&eacute;er les contenus? Et pour le faire, des recherches sont elles indispensables? Qui va relire?</li>
<li><b>En permanence des nouveaux contenus:</b> D'o&ugrave; doivent provenir les nouveaux contenus? Les visiteurs de projets Web ne deviennent des visiteurs attitr&eacute;s que lorsqu'il y a r&eacute;guli&egrave;rement quelque chose de nouveau &agrave; d&eacute;couvrir sur ses pages. Les r&eacute;dacteurs ou fournisseurs s'occupent ils des nouveaux contenus? Ou les nouveaux contenus doivent ils &ecirc;tre assur&eacute;s par les visiteurs eux-m&ecirc;mes, par exemple en proposant un forum de discussion?</li>
<li><b>Actualit&eacute;:</b> Qui surveille si les contenus sont actuels et exacts? Qui s'occupe de la modification des &eacute;l&eacute;ments modifi&eacute;s dans le stock de donn&eacute;es Web, par exemple les informations relatives aux produits retir&eacute;s du march&eacute;, &quot;nouvelles d'hier&quot; etc...? Qui r&eacute;pare les liens qui ne fonctionnent plus, soit &agrave; d'autres pages du projet, soit &agrave; d'autres adresse Web qui n'existent plus?</li>
</ul>




<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;</td></tr></table>
<h2 class="Sh2"><a class="an" name="couts">Co&ucirc;ts</a></h2>

<p>Les co&ucirc;ts d'un projet WWW se r&eacute;partissent dans les domaines suivants:</p>
<ul>
<li>Conception et planification </li>
<li>r&eacute;alisation</li>
<li>Maintenance</li>
</ul>
<p>Dans tous les cas il s'agit d'un investissement en temps qu'il ne faut pas sous-estimer. Si vous travaillez par enthousiasme ou comme passionn&eacute; vous ne ressentirez pas tellement la formule temps=argent, mais si vous travaillez commercialement vous devrez faire des calculs pour les trois domaines cit&eacute;s.</p>

<p>Si vous devez investir de l'argent pour le projet, les estimations suivantes sont importantes:</p>
<ul>
<li><b>Travail &agrave; fa&ccedil;on ou travail personnel:</b> est-il meilleur march&eacute; de prendre le temps (=argent) soi-m&ecirc;me pour se former en conception et r&eacute;alisation (savoir-faire technique sp&eacute;cialis&eacute;), ou est-il mieux de mandater quelqu'un (= &ccedil;a co&ucirc;te aussi), qui s'y conna&icirc;t et prend &ccedil;a en charge?</li>
<li><b>Rentabilit&eacute;:</b> pouvez vous supporter sans douleur les frais encourus? Pouvez vous vous permettre que le projet soit un &quot;bide&quot;? Si un &quot;bide&quot; signifie votre faillite, essayez peut-&ecirc;tre d'abord des investissements moins risqu&eacute;s.
.</li>
</ul>

<p>Pour les projets Web commerciaux, s'est instaur&eacute;e entre-temps cette r&egrave;gle que le plus souvent la premi&egrave;re cr&eacute;ation est confi&eacute;e comme commande &agrave; des agences Web. L'entretien permanent des contenus confi&eacute; &agrave; une telle agence s'est av&eacute;r&eacute; par contre non-rentable. Cela signifie: &agrave; la passation de commande, vous devez d&eacute;j&agrave; avoir pris des dispositions en tant que donneur d'ordre sur la fa&ccedil;on o&ugrave; par la suite la maintenance du contenu du projet sera assur&eacute;e. Il est toujours plus fr&eacute;quent que les donneurs d'ordre demandent aux agences Web pour cette raison m&ecirc;me l'impl&eacute;mentation de ce qu'on appelle un <b>Content Management Systems (CMS)</b> (syst&egrave;me de maintenance du contenu). Un tel syst&egrave;me permet &agrave; des collaborateurs responsables du donneur d'ordre, inexp&eacute;riment&eacute;s dans les techniques du Web mais comp&eacute;tents quant &agrave; la r&eacute;daction et au contenu de travailler sur de nouveaux contenus dans le projet par une interface Internet conviviale (souvent des solutions bas&eacute;es sur le Web). Il existe des solutions logicielles toutes pr&ecirc;tes pour le CMS, mais souvent, ce sont aussi des solutions individuelles qui sont programm&eacute;es. Le logiciel professionnel CMS contient par rapport aux solutions simples des propri&eacute;t&eacute;s telles que &quot;&eacute;tape pr&eacute;liminaire de r&eacute;daction&quot; et &quot;validation d&eacute;finitive par la direction de la r&eacute;daction&quot; etc...</p>

<p>Dans l'index des liens de l'offre en ligne de SELFHTML actuel vous trouverez  des liens sur le th&egrave;me &quot;Content Management Systeme&quot;:</p>

<p><img src="../src/serverdoc.gif" width="15" height="10" border="0" alt="Page d'information: gonnexion exig&eacute;e">&nbsp;
<a href="http://www.selfhtml.com.fr/liens/software_cms.htm"><b>Liens WWW: Content-Management-Systeme</b></a></p>





<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;</td></tr></table>
<h2 class="Sh2"><a class="an" name="echeancier">&Eacute;ch&eacute;ancier et annonce</a></h2>

<p>Peu importe que vous planifiez un projet Web priv&eacute; ou professionnel - une chose est &agrave; faire dans tous les cas: vous fixer des d&eacute;lais. Car sans d&eacute;lais &agrave; respecter un projet n'est jamais termin&eacute;. Les d&eacute;lais, il est vrai, doivent &ecirc;tre r&eacute;alistes. Un d&eacute;lai qui ne peut pas &ecirc;tre tenu, n'a gu&egrave;re plus de valeur que pas de d&eacute;lai du tout. Pour des projets simples une simple &eacute;ch&eacute;ance (&quot;Deadline&quot;) suffit. Pour des projets plus complexes &agrave; la r&eacute;alisation desquels plusieurs personnes ou sections ind&eacute;pendantes travaillent une coordination des d&eacute;lais avec un logiciel de planification de projets peut &ecirc;tre n&eacute;cessaire semblable &agrave; celle utilis&eacute;e pour la r&eacute;alisation de produits ou pour les projets de construction.</p>

<p>En m&ecirc;me temps se pose la question d'une annonce pr&eacute;liminaire. Souvent est r&eacute;serv&eacute; un  <img src="../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="publier.htm#eigene_domain"><b>nom de domaine</b></a> d&egrave;s qu'une id&eacute;e de projet voit le jour. Rien ne s'y oppose non plus. Mais peu de temps apr&egrave;s la place lou&eacute;e est mise &agrave; disposition sur le Web et l'adresse peut &ecirc;tre appel&eacute;e par le public. &Agrave; cette phase, beaucoup de t&ecirc;tes chaudes ont tendance &agrave; publier des annonces pr&eacute;alables fanfaronnes quelconques pour faire savoir en agr&eacute;mentant le tout avec des panneaux de chantier anim&eacute;s et amusants ou  des bandes annonces Flash plus modernes et le tout est ensuite annonc&eacute; dans la foul&eacute;e &agrave; tous les moteurs de recherche connus.</p>

<p>Les annonces pr&eacute;alables se justifient dans certaines conditions, ainsi par exemple pour signaler d'avance une certaine marque r&eacute;serv&eacute;e. Dans la plupart des cas, les annonces pr&eacute;alables sont irritantes. Les moteurs de recherche sont gav&eacute;s inutilement de d&eacute;chets avec de telles pages et les visiteurs qui ne connaissent pas le fournisseur ne s'en laisseront pas conter par leurs annonces emphatiques. Au lieu de cela, ils cliqueront agac&eacute;s pour d'autres sites, d&egrave;s qu'ils auront compris qu'&agrave; nouveau ce n'est qu'un de ces vantards qui fait des siennes.</p>

<p>Les annonces pr&eacute;liminaires doivent &ecirc;tre comme le projet Web planifi&eacute;: fond&eacute;, orient&eacute; sur l'information et convivial. Donc pas d'animations inconsid&eacute;r&eacute;es qui augmentent les temps de chargement et plut&ocirc;t quelques phrases ou plus sur le projet en cours.</p>




<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;</td></tr></table>
<h2 class="Sh2"><a class="an" name="articulation">Articulation et structure</a></h2>

<p>Un projet WWW est constitu&eacute; par au moins un, souvent par de nombreux, quelquefois par d'innombrables fichiers HTML. Plus le projet comprend de fichiers, plus il est important de fixer sur le papier la structure des fichiers et des liens. Mais m&ecirc;me dans de petits projets qui ne comprennent que peu de fichiers vous devez r&eacute;fl&eacute;chir auparavant qu'est-ce qui va dans quel fichier et comment relier les fichiers entre eux.</p>

<p>Ne perdez pas de vue que le Web est un m&eacute;dia hypertexte. L'hypertexte ne vous oblige pas &agrave; des formes d&eacute;termin&eacute;es. L'hypertexte est un m&eacute;dia qui n'est pas lin&eacute;aire. L'utilisateur ne doit pas lire dans l'ordre mais choisir ce qui l'int&eacute;resse. C'est une grande libert&eacute; qui cache toutefois le danger de l'impression d'&ecirc;tre perdu dans le labyrinthe de l'&quot;hyperespace&quot;.</p>

<p>La plupart des utilisateurs sur le WWW ne sont pas des pilotes hypertexte exp&eacute;riment&eacute;s. Pour des projets qui comportent plus d'une poign&eacute;e de pages vous devez essayer de proposer &agrave; l'utilisateur une &quot;m&eacute;taphore&quot; &agrave; laquelle il puisse se tenir. M&eacute;taphores possibles:</p>

<ul>
<li><b>m&eacute;taphore du livre:</b> le projet a le caract&egrave;re d'un document, comprend une table des mati&egrave;res et &eacute;ventuellement un index des mots cl&eacute;s, les fichiers correspondent &agrave; des chapitres etc... Cette m&eacute;taphore se pr&ecirc;te bien pour des informations limit&eacute;es sur des th&egrave;mes d&eacute;termin&eacute;s pour lesquelles les donn&eacute;es sont rarement mises &agrave; jour.</li>
<li><b>m&eacute;taphore de r&eacute;pertoires ou d'arborescence:</b> Le projet fait l'effet pour l'utilisateur d'un gestionnaire de fichiers. Il y a des fichiers avec des listes de liens signalis&eacute;s par le symbole r&eacute;pertoire ainsi que des fichiers avec des informations signalis&eacute;s par le symbole document. Cette m&eacute;taphore se pr&ecirc;te bien pour de grandes quantit&eacute;s de donn&eacute;es avec des acc&egrave;s nouveaux fr&eacute;quents pour lesquels pourtant le domaine d'informations couvert est connu de prime abord.</li>
<li><b>la m&eacute;taphore d'index:</b> un grand index de liens tri&eacute;s alphab&eacute;tiquement ou d'apr&egrave;s d'autres crit&egrave;res (date et heure par exemple) forme l'acc&egrave;s &agrave; l'information. Cette m&eacute;taphore se pr&ecirc;te bien pour des projets dont le domaine d'information ne peut &ecirc;tre d&eacute;limit&eacute; pr&eacute;cis&eacute;ment et pour lesquels des nouvelles donn&eacute;es sont souvent ajout&eacute;es.</li>
</ul>

<p>D&egrave;s que l'utilisateur reconna&icirc;t la m&eacute;taphore que vous avez choisie, il peut se faire une id&eacute;e de l'&quot;espace couvert&quot; par votre projet. C'est une chose tr&egrave;s importante la sympathie de l'utilisateur pour le projet d&eacute;pend en r&eacute;alit&eacute; pour une grande partie du fait qu'il a ou non ce fil conducteur.</p>







<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;</td></tr></table>
<h2 class="Sh2"><a class="an" name="marque_fabrique">Marque de fabrique (Corporate Design)</a></h2>

<p>Tout aussi important que l'articulation est un concept marque de fabrique. Ce qui signifie que tous les fichiers qui appartiennent &agrave; un projet proposent une unit&eacute; dans l'apparence, de fa&ccedil;on &agrave; ce que l'utilisateur reconnaisse intuitivement qu'il se trouve dans le m&ecirc;me projet. Vous construisez votre marque de fabrique en r&eacute;utilisant toujours certains &eacute;l&eacute;ments de structuration pour chacun des fichier du projet. Cela peut &ecirc;tre:</p>
<ul>
<li><b>un logo:</b> Il doit toujours &ecirc;tre &agrave; la m&ecirc;me place sur la page, par exemple en haut &agrave; gauche au d&eacute;but de la page. Si vous travaillez avec la technique des cadres, vous pouvez aussi placer le logo &agrave; un endroit fixe de l'&eacute;cran.</li>
<li><b>des symboles graphiques:</b> Ce sont de petits graphiques GIF ou JPEG qui se trouvent &agrave; des endroits d&eacute;termin&eacute;s et qui ont pour l'utilisateur une signification imm&eacute;diatement reconnaissable voire localisable. Des symboles peuvent par exemple signifier: &quot;ceci est un exemple&quot;, ou bien &quot;ceci est l'un de nos produits&quot; ou encore &quot;ceci est un lien par lequel l'utilisateur quitte le projet&quot;.</li>
<li><b>Des formats de texte:</b> En font partie par exemple, repr&eacute;sentation des exemples en texte pr&eacute;-format&eacute;.</li>
</ul>

<p>La marque de fabrique sugg&egrave;re l'harmonie. Particuli&egrave;rement pour des projets commerciaux &agrave; savoir pour des firmes qui se pr&eacute;sentent ou proposent directement quelque chose; l'identit&eacute; de la firme donne &agrave; l'utilisateur l'impression qu'il a &agrave; faire &agrave; des professionnels exp&eacute;riment&eacute;s.</p>

<p>La marque de fabrique est quelque chose d'autre que la conception Web, mais la conception Web doit tenir compte des facteurs prescrits pas la marque de fabrique, dans la conception de la mise en page, de la navigation, du formatage de texte etc... Pr&eacute;cis&eacute;ment quand vous mandatez quelqu'un, il est important de faire au preneur d'ordres des prescriptions pr&eacute;cises concernant la marque de fabrique. Soyez attentif d'autre part aux arguments qui peuvent lui &ecirc;tre oppos&eacute;s. La marque de fabrique ne doit pas g&ecirc;ner l'ergonomie lors de l'&quot;utilisation&quot; des pages.</p>





<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;</td></tr></table>
<h2 class="Sh2"><a class="an" name="conception_web">Conception Web</a></h2>

<p>Dans les milieux sp&eacute;cialis&eacute;s, on discute sans fin de la bonne et de la mauvaise conception Web, de la correcte ou de la fausse. Les r&egrave;gles suivantes regroupent les points importants:</p>

<ul>
<li><b>La forme sans le fond est creuse:</b> Sans information &agrave; d&eacute;livrer, sans v&eacute;ritable dialogue,  la page Web a beau avoir une esth&eacute;tique parfaite - elle est cependant une proposition impudente et aucun de ceux qui la visitent ne reviendra. Celui qui n'a rien d'autre &agrave; proposer que quelques jolis remplissages d'&eacute;cran, ne se fera pas d'amis durables sur la toile.</li>
<li><b>Le fond sans la forme est ennuyeux:</b> Sans une structuration r&eacute;fl&eacute;chie en petites unit&eacute;s d'information et sans a&eacute;rer le tout par des graphiques ou des &eacute;l&eacute;ments multim&eacute;dia agissant comme signaux, symboles ou illustrations, la prise d'informations &agrave; l'&eacute;cran est fatigante et &eacute;prouvante pour les nerfs. Les pages d'&eacute;cran ne peuvent se comparer &agrave; des pages de livre.</li>
<li><b>La navigation est pr&eacute;vue:</b> Un projet Web avec un contenu d'informations important est tout d'abord un projet hypertexte, et l'impression qu'il laissera chez l'utilisateur d&eacute;pend en grande partie de la facilit&eacute; d'y trouver les informations d&eacute;sir&eacute;es de l'agr&eacute;ment d'y suivre ses propres traces, et de la facilit&eacute; &agrave; tout moment de bifurquer rapidement &agrave; d'autres endroits importants du projet. La conception Web est donc au moins autant de la conception hypertexte que de la conception graphique.</li>
<li><b>L'ind&eacute;pendance &agrave; la plate-forme est pr&eacute;vue:</b> Alors qu'un concepteur courant sait d'avance si son projet aboutira sur un carton de bi&egrave;re ou sur une affiche murale, un concepteur Web ne peut pas savoir, sur quel support d'affichage ses pages Web doivent en fin de compte d&eacute;velopper leurs effets. Dans la plupart des cas des conceptions sans probl&egrave;me qui pr&eacute;sentent des formes simples et claires et qui poss&egrave;dent de bons contrastes de couleurs, sont pr&eacute;f&eacute;rables et sans imposer de largeurs ou hauteurs excessives. Il faut &eacute;galement penser &agrave; ces groupes d'utilisateurs marginaux que sont les mal voyants et ce quelle qu'en soit la forme.</li>
<li><b>Le Web fait partie d'Internet:</b> Une page Web ne doit pas seulement avoir le meilleur aspect possible, elle doit aussi compter le moins d'octets possibles. Que les largeurs de bande pour la transmission de donn&eacute;es s'am&eacute;liorent peu &agrave; peu chez l'utilisateur moyen ne veut pas dire qu'il faille alourdir ici et maintenant sans tenir compte du trafic du r&eacute;seau. M&ecirc;me d'autres choses doivent &ecirc;tre prises en consid&eacute;ration. Des bons mots cl&eacute; &eacute;vocateurs rt des br&egrave;ves descriptions dans les <img src="../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="../html/entete/meta.htm"><b>mentions Meta</b></a> sont aussi importantes pour le succ&egrave;s d'une page Web que son effet optique. Car une page Web n'est pas seulement visit&eacute;e par des humains mais aussi par des programmes qui les indexent pour les moteurs de recherche sur Internet.</li>
</ul>






<table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr><td colspan="2" bgcolor="#EEEEEE" class="doc">
&#160;<a href="#top"><img src="../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a>
</td></tr>
<tr><td bgcolor="#EEEEEE" class="doc" align="right"><a href="publier.htm"><img src="../src/suivant.gif" width="10" height="10" border="0" hspace="10" alt="page suivante"></a></td>
<td bgcolor="#FFFFFF"><img src="../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information"> <a href="publier.htm"><b> Publier des projets Web</b></a>
</td></tr>
<tr>
<td bgcolor="#EEEEEE" class="doc" align="right"><a href="../graphisme/gifs_animes.htm"><img src="../src/precedent.gif" width="10" height="10" border="0" hspace="10" alt="page pr&eacute;c&eacute;dente"></a></td>
<td bgcolor="#FFFFFF" width="100%"><img src="../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information"> <a href="../graphisme/gifs_animes.htm"><b>Graphiques GIF anim&eacute;s</b></a>
</td>
</tr>
<tr><td colspan="2" bgcolor="#EEEEEE" class="doc">&#160;</td></tr>
</table><table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr>
<td bgcolor="#FFEEDD" class="nav"><a class="an" name="bottom"><img src="../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"></a> <a href="../index.htm"><b>SELFHTML</b></a>/<a href="../navigation/index.htm" target="_parent">Aides &agrave; la navigation</a> <img src="../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="index.htm"><b>Gestion de projets Web</b></a></td>
</tr>
</table>

<p>&copy; 2001 Stefan M&uuml;nz / &copy; 2003 Traduction <img src="../src/courriel.gif" width="15" height="10" border="0" alt="Adresse &eacute;lectronique">&nbsp;<a href="mailto:13405@free.fr">Serge Fran&ccedil;ois, 13405@free.fr</a><br><img src="../src/courriel.gif" width="15" height="10" border="0" alt="Adresse &eacute;lectronique">&nbsp;<a href="mailto:selfhtml@selfhtml.com.fr">selfhtml@selfhtml.com.fr</a></p>



</body>
</html>
