<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>SELFHTML: Gestion de projets Web / Publier des projets Web</title>
<link rel="stylesheet" type="text/css" href="../src/selfhtml.css">
<meta name="description"    content="Ce &agrave; quoi vous devez veillez quand vous voulez publier des projets sur Internet ou sur des Intranets.">
<meta name="keywords"       content="SELFHTML, gestion de projets Web, Conduite du site, publication, espace Web, h&eacute;bergement, Hosting, Virtual Hosting, Server-Hosting, Server-Houwing, Domain-Adressen, Sub-Domains">
<meta name="author"         content="Stefan M&uuml;nz, selfhtml@teamone.de">
<meta http-equiv="content-type" content="text/html; charset=ISO-8859-1">
<meta name="DC.Publisher"   content="Serge Fran&ccedil?ois, selfhtml@selfhtml.com.fr">
<meta name="DC.Date"        content="2003-01-27T08:00+00:00">
<meta name="DC.Identifier"  content="http://selfhtml.selfhtml.com.fr/projet/publier.htm">
<meta name="DC.Language"    content="fr">
<meta name="DC.Rights"      content="../editorial/copyright.htm">
<meta name="DC.Date.Create" content="2003-01-27T08:00+00:00">
<meta name="SELF.Version"   content="1">
<meta name="SELF.Pagetype"  content="Information">
<meta name="SELF.Path"      content="SELFHTML == ../index.htm // Gestion de projets Web == index.htm">
<!-- Matomo -->
<script type="text/javascript">
  var _paq = window._paq = window._paq || [];
  /* tracker methods like "setCustomDimension" should be called before "trackPageView" */
  _paq.push(['trackPageView']);
  _paq.push(['enableLinkTracking']);
  (function() {
    var u="//matomo.boitasite.com/";
    _paq.push(['setTrackerUrl', u+'matomo.php']);
    _paq.push(['setSiteId', '1']);
    var d=document, g=d.createElement('script'), s=d.getElementsByTagName('script')[0];
    g.type='text/javascript'; g.async=true; g.src=u+'matomo.js'; s.parentNode.insertBefore(g,s);
  })();
</script>
<!-- End Matomo Code -->
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#AA5522" vlink="#772200" alink="#000000">


<table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr>
<td bgcolor="#FFEEDD" class="nav"><a class="an" name="top"><img src="../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"></a> <a href="../index.htm"><b>SELFHTML</b></a>/<a href="../navigation/index.htm" target="_parent">Aides &agrave; la navigation</a> <img src="../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="index.htm"><b>Gestion de projets Web</b></a></td>
</tr>
</table><table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr>
<td bgcolor="#EEEEEE" class="doc" width="110"><img src="../src/logo.gif" width="106" height="109" border="0" alt="SELFHTML"></td>
<td bgcolor="#EEEEEE" class="doc" valign="bottom" width="100%"><h2>Publier des projets Web</h2></td>
</tr>
<tr>
<td bgcolor="#EEEEEE" class="doc" valign="top" align="center">
<img src="../src/docx.gif" width="30" height="20" vspace="6" border="0" alt="Page d'information: vue d'ensemble">
</td>
<td bgcolor="#FFFFFF" valign="top" nowrap>
<p>
<img src="../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#generalites"><b>G&eacute;n&eacute;ralit&eacute;s sur la publication de projets Web</b></a><br>
<img src="../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#services_en_ligne"><b>Pages d'accueil dans les services en ligne
</b></a><br>
<img src="../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#gratuits"><b>Pages d'accueil gratuites</b></a><br>
<img src="../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#domaine_propre"><b>Adresse domaine en propre
</b></a><br>
<img src="../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#hebergement_virtuel"><b>H&eacute;bergement virtuel avec domaine en propre (Virtual Hosting)</b></a><br>
<img src="../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#hebergement_serveur"><b>H&eacute;bergement serveur avec domaine en propre</b></a><br>
<img src="../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#hebergement_materiel_serveur"><b>H&eacute;bergement mat&eacute;riel serveur avec domaine en propre</b></a><br>
<img src="../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#ftp"><b>Publier avec FTP</b></a><br>
</p>
</td>
</tr><tr><td colspan="2" bgcolor="#EEEEEE" class="doc">&#160;<a href="#bottom"><img src="../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;</td></tr>
</table>



<h2 class="Sh2"><a class="an" name="generalites">G&eacute;n&eacute;ralit&eacute;s sur la publication de projets Web</a></h2>

<p>Pour publier vos projets individuels sur le Web vous avez besoin de:</p>
<ul>
<li><b>un acc&egrave;s Internet:</b> Si vous n'avez pas encore d'acc&egrave;s Internet, il vous faut chercher un fournisseur d'acc&egrave;s qui vous procure l'acc&egrave;s. Pour le choix d'un fournisseur d'acc&egrave;s appropri&eacute;, diff&eacute;rents facteurs entrent en ligne de compte, par exemple les tarifs des fournisseurs d'acc&egrave;s, les conditions particuli&egrave;res, les limitations en volume ou en temps etc... Apr&egrave;s vous &ecirc;tre annonc&eacute; (inscrit) chez un fournisseur d'acc&egrave;s (chez les fournisseurs d'acc&egrave;s Call-by-Call entre temps, aucune inscription n'est plus  indispensable), vous recevez un num&eacute;ro d'identification d'utilisateur et un mot de passe. Avec ces deux donn&eacute;es vous pouvez ensuite, par ligne t&eacute;l&eacute;phonique, c&acirc;ble t&eacute;l&eacute;, r&eacute;seau &eacute;lectrique, satellite t&eacute;l&eacute;phone portable ou une autre technique de transmission, vous connecter &agrave; Internet. Le condition pr&eacute;alable en est toutefois que votre ordinateur supporte Internet. Pour cela, il faut un logiciel d'interface de connexion Internet (sous  Windows par exemple le fichier <var>winsock.dll</var>) ainsi que des programmes Internet client appropri&eacute;s (par exemple un navigateur Web et un programme de courriels).</li>
<li><b>un emplacement sur le disque dur d'un ordinateur serveur:</b>. Cela doit &ecirc;tre un ordinateur qui est reli&eacute; en permanence &agrave; Internet et cette liaison doit &ecirc;tre tr&egrave;s rapide, qui soutient au moins les protocoles Internet HTTP et FTP et dont l'&eacute;quipement de base mat&eacute;riel et logiciel est tel qu'il permette la visite simultan&eacute;e de nombreux visiteurs. En r&egrave;gle g&eacute;n&eacute;rale vous louerez l'emplacement  correspondant sur le Web chez un fournisseur d'acc&egrave;s d'h&eacute;bergement qui dispose de la technique n&eacute;cessaire. Il y a une quantit&eacute; de fournisseurs qui louent de le place sur le Web. Les prestations et les prix varient beaucoup. Il vous faut savoir de quelles prestations vous avez besoin et o&ugrave; vous pouvez les obtenir au meilleur prix. Dans de nombreux cas vous pouvez louer chez le fournisseur d'acc&egrave;s chez qui vous avez votre acc&egrave;s &agrave; Internet un emplacement pour vos propres projets Web.</li>
<li><b>une adresse Web:</b> Il y en a diff&eacute;rents types. Chez des services en ligne ou des fournisseurs bon march&eacute; vous aurez par exemple une adresse du type <var>http://www.votrefournisseurdacc&egrave;s.com/votrer&eacute;pertoire/</var>. En principe, vous pouvez choisir le nom du r&eacute;pertoire en vous inscrivant. Si vous voulez avoir votre propre adresse domaine par exemple une adresse du type  <var>http://www.votrenom.com/</var>, , celle-ci doit &ecirc;tre demand&eacute;e &agrave; une administration d'attribution sur Internet. Les fournisseurs d'acc&egrave;s chez lesquels vous pouvez louer une telle adresse s'en chargent.</li>
<li><b>un acc&egrave;s  &agrave; l'emplacement lou&eacute; sur l'ordinateur serveur:</b> Pour cela vous recevez du fournisseur d'acc&egrave;s chez qui vous louez l'emplacement une identification. Elle comprend en principe un num&eacute;ro d'identification et un mot de passe. Dans la plupart des cas vous pouvez changer le mot de passe vous m&ecirc;me.
<li><b>un logiciel pour transf&eacute;rer et g&eacute;rer vos fichiers personnels sur l'ordinateur serveur:</b> Le service Internet classique pour transmettre des fichiers et ex&eacute;cuter des op&eacute;rations simples de fichiers sur l'ordinateur serveur (effacer, copier, d&eacute;placer, prot&eacute;ger l'acc&egrave;s etc...) s'appelle le File Transfer Protocol (FTP). Pour cela il existe des logiciels FTP, que vous devez installer sur votre ordinateur. Chez certains fournisseurs vous pouvez ou devez utiliser un logiciel sp&eacute;cial que le fournisseur d'acc&egrave;s met &agrave; votre disposition.</li>
</ul>

<p>L'emplacement sur le Web, appel&eacute; aussi espace Web, doit &ecirc;tre choisi avec circonspection. Quelle offre vous devez choisir, d&eacute;pend d'une part du genre et des exigences techniques du projet, d'autre part des co&ucirc;ts que vous &ecirc;tes pr&ecirc;ts &agrave; supporter. En r&egrave;gle g&eacute;n&eacute;rale pr&eacute;vaut ceci: ne fa&icirc;tes pas de fausses &eacute;conomies! Beaucoup pensent qu'il peuvent obtenir gratuitement un emplacement et avoir pour ce &quot;prix&quot; les perfectionnements sensationnels qu'ils voient ailleurs. Il n'en va cependant pas ainsi. Pour le prix d'un abonnement mensuel &agrave; une revue, vous avez d&eacute;j&agrave; des offres valables qui suffisent pour la plupart des projets. Il y a pourtant malheureusement sur le march&eacute; des fournisseurs d'acc&egrave;s encore toujours certains bousilleurs qui attirent non sans succ&egrave;s avec des promesses mais qui sont sur le plan technique compl&egrave;tement incomp&eacute;tents. C'est avant tout l'assistance qui cloche chez de nombreux fournisseurs d'acc&egrave;s. Recherchez et comparez, de pr&eacute;f&eacute;rence un peu plus longtemps, questionnez d'autres initiateurs de projet sur leurs exp&eacute;riences, et ne vous d&eacute;cidez pas syst&eacute;matiquement pour la premi&egrave;re offre qui fait sa r&eacute;clame avec les tailles de polices les plus tape &agrave; l'&#339;il et les slogans les plus agressifs.</p>

<p>Dans l'index des liens de l'offre en ligne de SELFHTML actuel vous trouverez des liens &agrave; des pages Web sur lesquelles les offres de fournisseurs d'acc&egrave;s de tous les types pr&eacute;sent&eacute;s ici sont list&eacute;es et compar&eacute;es:</p>

<p><img src="../src/serverdoc.gif" width="15" height="10" border="0" alt="Page d'information: connexion exig&eacute;e">&nbsp;
<a href="http://www.selfhtml.com.fr/liens/recapitulatif_fournisseurs.htm"><b>Liens WWW: fournisseurs d'acc&egrave;s</b></a></p>


<p>Dans cette partie, les offres typiques et leurs caract&eacute;ristiques sont pr&eacute;sent&eacute;es.</p>



<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160</td></tr></table>
<h2 class="Sh2"><a class="an" name="services_en_ligne">Pages d'accueil dans les services en ligne</a></h2>

<p>Vous pouvez envisager cette solution si vous disposez d&eacute;j&agrave; d'un acc&egrave;s &agrave; Internet chez un service en ligne (France Telecom, CompuServe, AOL etc...) et que vous voulez simplement publier une page d'accueil priv&eacute;e ou ax&eacute;e sur un centre d'int&eacute;r&ecirc;t. L'avantage en est que vous n'avez aucun frais suppl&eacute;mentaire, parce que l'offre est comprise dans le co&ucirc;t de l'acc&egrave;s &agrave; Internet.</p>

<p>Chez les services en ligne nomm&eacute;s vous recevez, en r&egrave;gle g&eacute;n&eacute;rale plusieurs M&eacute;ga octets d'emplacement sur l'ordinateur serveur du service en ligne. Vous pouvez y mettre des fichiers HTML, des graphiques et &eacute;galement la plupart du temps des fichiers multim&eacute;dia qui sont ensuite accessibles publiquement en tant que pages Web. Il y a pourtant aussi des restrictions. Ainsi les services en ligne ne proposent-ils pas en r&egrave;gle g&eacute;n&eacute;rale la possibilit&eacute; d'une interface CGI propre o&ugrave; vous pouvez placer vos propres scripts. Si vous voulez utiliser des choses comme compteur d'acc&egrave;s, livre de visites ou forum de nouvelles, vous devrez vous orienter vers des  <img src="../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="../introduction/aide/services.htm#cgi"><b>services CGI</b></a> publics. Les prestations suppl&eacute;mentaires avanc&eacute;es comme les statistiques, la possibilit&eacute; de r&eacute;pertoires prot&eacute;g&eacute;s etc..., ne sont g&eacute;n&eacute;ralement pas compris dans ces offres.</p>

<p>Si vous avez d&eacute;j&agrave; un acc&egrave;s &agrave; un service en ligne et envisagez de publier votre page d'accueil chez ce fournisseur, veuillez vous renseigner aupr&egrave;s de ce fournisseur de ce dont vous avez besoin et de la fa&ccedil;on dont &ccedil;a fonctionne dans le d&eacute;tail. Chez CompuServe et AOL il y a des forums appropri&eacute;s aupr&egrave;s desquels vous pouvez poser ces questions.</p>





<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;</td></tr></table>
<h2 class="Sh2"><a class="an" name="gratuits">Pages d'accueil gratuites</a></h2>

<p>Cette solution est judicieuse si vous avez d&eacute;j&agrave; un acc&egrave;s Internet et que votre fournisseur d'acc&egrave;s ne vous donne pas la possibilit&eacute; de mettre votre propre page d'acc&egrave;s sur le Web. Si vous ne voulez pas proposer d'information commerciale mais permettre l'acc&egrave;s &agrave; des informations instructives, concernant votre passe temps etc... il est absolument impensable d'envisager de devoir en plus payer pour un travail b&eacute;n&eacute;vole. Cette possibilit&eacute; n'est cependant &agrave; envisager s&eacute;rieusement que pour des pages d'accueil priv&eacute;es sans exigence particuli&egrave;re ainsi que pour les projets d&eacute;di&eacute;s purement aux loisirs. Car chez presque tous les fournisseurs d'espace Web gratuits, de la r&eacute;clame est affich&eacute;e automatiquement &agrave; l'appel des pages. La plupart des visiteurs des pages trouvent cette publicit&eacute; p&eacute;nible et ne s&eacute;journent pas plus longtemps sur ce genre de pages. Vous ne pouvez pas non plus faire quoique ce soit contre, &eacute;tant donn&eacute; que les pages, avant d'arriver chez l'utilisateur sont dirig&eacute;es sur un script qui y &quot;ins&egrave;re&quot; automatiquement la publicit&eacute; int&eacute;gr&eacute;e dans la fen&ecirc;tre d&eacute;roulante ou dans le jeu de cadres.</p>

<p>Chez les fournisseurs gratuits vous recevez, en r&egrave;gle g&eacute;n&eacute;rale plusieurs m&eacute;ga octets d'emplacement, ce qui suffit amplement pour des projets priv&eacute;s. Les restrictions sont semblables &agrave; celles des <img src="../src/haut.gif" width="14" height="10" border="0" alt="vers le haut">&nbsp;<a href="#services_en_ligne"><b>services en ligne</b></a>.</p>







<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;</td></tr></table>
<h2 class="Sh2"><a class="an" name="domaine_propre">Adresse domaine en propre</a></h2>

<p>Quand vous d&eacute;sirez avoir une adresse domaine en propre pour votre projet, vous devez vous trouver un nom appropri&eacute;.</p>

<p>Pour les adresses du type &quot;Top-Level Domain&quot; <var>.fr</var> (adresses fran&ccedil;aises), <var>.be</var> (adresses belges), <var>.ch</var> (adresses suisses), <var>.com</var> (adresses commerciales), <var>.net</var> (adresses relatives &agrave; Internet) ou bien <var>.org</var> (organisations) Il vous faut maintenant beaucoup d'imagination car presque tous les noms simples sont attribu&eacute;s depuis longtemps. C'est la raison pour laquelle, les noms compos&eacute;s y sont maintenant appr&eacute;ci&eacute;s, comme par exemple <var>ce-soir-je-vais_au cinema.fr</var>. Ou il vous faut opter pour les nouvelles adresse du type <var>.info</var> ou bien <var>.nom</var>. Posez &eacute;ventuellement la question au fournisseur d'acc&egrave;s de votre choix.</p>

<p>Le fournisseur d'acc&egrave;s prend en charge dans la plupart des cas la demande de nom de domaine. Souvent, les fournisseurs d'acc&egrave;s offrent aussi la possibilit&eacute; d'am&eacute;nager des sous-domaines. Quand par exemple, vous avez un domaine du nom de  <var>je-voudrais-bien.fr</var>, alors vous pouvez faire am&eacute;nager des sous-domaines comme <var>cela.je-voudrais-bien.fr</var> ou <var>aimer.je-voudrais-bien.fr</var>. Les pages Web correspondantes pourraient alors &ecirc;tre appel&eacute;es par exemple par <var>http://cela.je-voudrais-bien.fr/</var>.<br>
C'est justement pour les noms de sous-domaines que l'on peut avoir, en faisant preuve d'un peu d'imagination, de plusieurs bons noms d'adresses attrayants et facile &agrave; retenir. Les sous-domaines peuvent &ecirc;tre am&eacute;nag&eacute;s sans probl&egrave;me technique pour les fournisseurs d'acc&egrave;s et il n'exigent pas d'autre inscription. Posez &eacute;ventuellement la question au fournisseur d'acc&egrave;s de votre choix pour les sous-domaines!</p>







<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;</td></tr></table>
<h2 class="Sh2"><a class="an" name="hebergement_virtuel">H&eacute;bergement virtuel avec domaine en propre (Virtual Hosting)</a></h2>

<p>Avec l'h&eacute;bergement virtuel, vous louez un emplacement d'une  taille d&eacute;termin&eacute;e. L'ordinateur qui se trouve normalement chez votre fournisseur d'acc&egrave;s et sur lequel vous pouvez transf&eacute;rer ensuite vos pages Web, est normalement partag&eacute; avec d'autres clients du fournisseur d'acc&egrave;s qui ont choisi la m&ecirc;me offre.
Cette forme est dite &quot;virtuelle&quot; parce que pour ces offres Web, il n'y a pas de rapport 1:1 entre l'adresse IP de l'ordinateur et le nom de domaine, justement du fait que plusieurs offres Web toutes avec leur avec leur propre nom de domaine se trouvent sur le m&ecirc;me ordinateur.</p>

<p>L'h&eacute;bergement virtuel est bien appropri&eacute; et la plupart du temps suffisant pour les pages d'accueil simples &agrave; plus cons&eacute;quentes sans publicit&eacute;, avec leur propre adresse de domaine, donc des cartes de visite &eacute;lectroniques et des portraits de firmes mais aussi des publications sp&eacute;cialis&eacute;es s&eacute;rieuses ou des pages sp&eacute;cialis&eacute;es sur un th&egrave;me pr&eacute;cis.</p>

<p>Pour les offres de ce genre, vous recevez en r&egrave;gle g&eacute;n&eacute;rale, outre l'emplacement &eacute;galement votre propre r&eacute;pertoire CGI pour cr&eacute;er des pages Web de fa&ccedil;on dynamique c&ocirc;t&eacute; serveur, ainsi que des prestations suppl&eacute;mentaires telles que les statistiques sur les visiteurs de vos pages, ou un espace support dans lequel vous pouvez - la plupart du temps sur une base Web et sans connaissances suppl&eacute;mentaires - modifier vos donn&eacute;es d'identification personnelle, prot&eacute;ger des r&eacute;pertoires, recevoir de l'aide en ligne etc... Par ailleurs, ces offres donnent droit, en r&egrave;gle g&eacute;n&eacute;rale &agrave; une assistance si des probl&egrave;mes techniques devaient survenir (Une telle assistance ne couvre pas vos probl&egrave;mes JavaScript ou HTML). Les prestations suppl&eacute;mentaires de ce genre ne sont pas fournies en principe par les services en ligne ni par les offres gratuites d'emplacement Web.</p>






<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;</td></tr></table>
<h2 class="Sh2"><a class="an" name="hebergement_serveur">H&eacute;bergement serveur avec domaine en propre</a></h2>

<p>Pour l'h&eacute;bergement serveur, le fournisseur d'acc&egrave;s met &agrave; votre disposition un ordinateur complet, sur lequel il n'y a pas d'autre offre Web. Avec l'h&eacute;bergement serveur, vous avez &eacute;galement en r&egrave;gle g&eacute;n&eacute;rale l'acc&egrave;s complet au syst&egrave;me d'exploitation de l'ordinateur serveur, vous pouvez y  installer vous m&ecirc;me des utilisateurs, installer des nouveaux logiciels etc... Par les services Internet comme <img src="../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="../introduction/internet/services.htm#telnet_ssh"><b>Telnet ou SSH</b></a> vous pouvez alors vous identifier sur l'ordinateur et y travailler. Pour cela, il vous faut les programmes Telnet- ou SSH correspondants. Pour pouvoir travailler intelligemment sur un ordinateur serveur, des connaissances approfondies du syst&egrave;me d'exploitation qui y est install&eacute; sont indispensables. Quand par exemple l'ordinateur serveur a un syst&egrave;me d'exploitation Linux, vous devez bien conna&icirc;tre Linux pour mettre &agrave; profit les possibilit&eacute;s offertes par votre propre ordinateur serveur.</p>

<p>L'h&eacute;bergement serveur est indispensable pour les offres Web qui sont tr&egrave;s volumineuses et/ou qui ont de tr&egrave;s forts taux de fr&eacute;quentation et/ou qui mettent en &#339;uvre des moyens techniques peu banals pour lesquels par exemple un logiciel sp&eacute;cial est n&eacute;cessaire sur le serveur. Il peut s'agir de types de serveur sp&eacute;ciaux par exemple pour le clavardage ou le multim&eacute;dia ou &eacute;galement de logiciels sp&eacute;ciaux de bases de donn&eacute;es.</p>

<p>&Eacute;tant donn&eacute; que pour de tels projets Web, plusieurs personnes ont la plupart du temps l'acc&egrave;s et les comp&eacute;tences, beaucoup de choses doivent &ecirc;tre organis&eacute;es. Ainsi il doit y avoir par exemple un &quot;webmestre&quot; qui conna&icirc;t l'ordinateur serveur, ses logiciels, les contenus qui y sont sauvegard&eacute;s, les configurations etc... et qui puisse juger quelles extensions mat&eacute;rielles ou logicielles sont n&eacute;cessaires par rapport &agrave; la charge de l'ordinateur serveur. Les donn&eacute;es de configuration et les concepts de structure de donn&eacute;es etc... doivent &ecirc;tre suffisamment document&eacute;s.</p>

<p>Pour l'h&eacute;bergement serveur, vous devez veiller &agrave; l'assistance plus encore que pour l'h&eacute;bergement virtuel. Il existe des fournisseurs d'acc&egrave;s qui proposent certes un bon prix pour des ordinateurs serveurs en propre, mais qui ne sont plus l&agrave; quand il y a urgence.</p>




<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160</td></tr></table>
<h2 class="Sh2"><a class="an" name="hebergement_materiel_serveur">H&eacute;bergement mat&eacute;riel serveur avec domaine en propre</a></h2>

<p>Pour l'h&eacute;bergement mat&eacute;riel serveur, vous mettez vous m&ecirc;me l'ordinateur serveur &agrave; disposition, et le fournisseur d'acc&egrave;s le met en fin de compte &quot;chez lui&quot;. La raison en est que vous ne disposez normalement pas de liaisons Internet aussi puissantes et ch&egrave;res que le fournisseur d'acc&egrave;s.</p>

<p>L'avantage de l'h&eacute;bergement mat&eacute;riel serveur par rapport &agrave; l'h&eacute;bergement serveur est que vous pouvez assembler le mat&eacute;riel composant l'ordinateur selon vos souhaits. Un inconv&eacute;nient est qu'en principe, le fournisseur d'acc&egrave;s ne fournit aucune assistance en cas de probl&egrave;mes qui n'ont rien &agrave; voir avec la connexion Internet. C'est davantage le cas pour l'h&eacute;bergement serveur o&ugrave; le fournisseur d'acc&egrave;s met le mat&eacute;riel &agrave; disposition.</p>

<p>Sinon les m&ecirc;mes remarques que celles pour l'h&eacute;bergement serveur s'appliquent &agrave; l'h&eacute;bergement mat&eacute;riel serveur.</p>




<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&#160;</td></tr></table>
<h2 class="Sh2"><a class="an" name="ftp">Publier avec FTP</a></h2>

<p>Si vous n'&ecirc;tes pas assis vous-m&ecirc;me devant la console du serveur, vous devez assurer la gestion des fichiers (transmettre des fichiers sur le serveur, effacer des fichiers etc...) sur le serveur &agrave; partir de n'importe quel ordinateur muni d'un simple acc&egrave;s Internet. Le protocole Internet usuel aujourd'hui est le <img src="../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="../introduction/internet/services.htm#ftp"><b>FTP (File Transfer Protocol)</b></a>. Pour la gestion pure de donn&eacute;es ( sans transmission ou t&eacute;l&eacute;chargement de fichiers), les services Internet <img src="../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="../introduction/internet/services.htm#telnet_ssh"><b>Telnet ou SSH</b></a> sont encore mieux appropri&eacute;s, &eacute;tant donn&eacute; qu'ils assurent pratiquement une &quot;simulation de console&quot;, en permettant donc le travail  sur l'ordinateur serveur &eacute;loign&eacute; comme si on &eacute;tait install&eacute; devant son &eacute;cran.</p>

<p>Vous recevez de votre fournisseur d'acc&egrave;s tous les renseignements indispensables dont vous avez besoin pour pouvoir g&eacute;rer vos donn&eacute;es sur le serveur. Ensuite vous avez encore besoin d'un programme FTP performant pour transmettre. .</p>

<p>Dans l'index des liens de l'offre en ligne de SELFHTML actuel, vous trouverez des liens aux programmes FTP:</p>

<p><img src="../src/serverdoc.gif" width="15" height="10" border="0" alt="Page d'information: connexion exig&eacute;e">&nbsp;
<a href="http://www.selfhtml.com.fr/liens/logiciels_ftp.htm"><b>Liens WWW: programmes FTP</b></a></p>

<p>La plupart des programmes FTP modernes sont pourvus d'une interface graphique similaire &agrave; celle des &quot;gestionnaires de fichiers&quot; ou &quot;commandeurs de fichiers&quot; connus. Pour leur emploi vous n'avez pas besoin de connaissances approfondies. Pour acc&eacute;der &agrave; l'ordinateur serveur vous avez besoin de l'adresse FTP de votre emplacement, d'une identification utilisateur et d'un mot de passe. Ces donn&eacute;es vous sont fournies par votre fournisseur d'acc&egrave;s. Les donn&eacute;es peuvent &ecirc;tre, dans la plupart des programmes FTP modernes, d&eacute;finitivement sauvegard&eacute;es dans un gestionnaire  de site FTP int&eacute;gr&eacute;.</p>

<p>Encore quelques tuyaux:</p>
<ul>
<li>Si votre projet comporte des sous-r&eacute;pertoires, nommez les r&eacute;pertoires sur l'ordinateur local sur lequel vous &eacute;tablissez le projet exactement comme sur l'ordinateur serveur. Vous pourrez ainsi mieux contr&ocirc;ler o&ugrave; se trouve quoi. D'autre part les liens et r&eacute;f&eacute;rences dans le projet doivent fonctionner exactement de la m&ecirc;me fa&ccedil;on localement que sur le serveur. Veillez &agrave; respecter la casse pour les noms de fichiers et de r&eacute;pertoires. La plupart des ordinateurs serveurs tournent avec des syst&egrave;mes d'exploitation  qui diff&eacute;rencient les minuscules et les majuscules (&agrave; la diff&eacute;rence de Windows). Le plus simple pour &eacute;viter les probl&egrave;mes est d'&eacute;crire tous les noms de fichiers et de r&eacute;pertoires  en minuscules.</li>
<li>Si vous avez ajout&eacute; des fichiers individuels ou en avez actualis&eacute; d'autres sur votre ordinateur local, affichez vous avant le transfert sur le serveur la liste des fichiers tri&eacute;e par date. Il est ainsi plus facile de voir quels sont les fichiers neufs ou modifi&eacute;s pour ne rien oublier lors de la transmission.</li>
<li>V&eacute;rifiez apr&egrave;s chaque transfert de fichiers le protocole d'ex&eacute;cution &eacute;tabli par le programme FTP. Si vous y trouvez des erreurs mentionn&eacute;es survenues lors de la transmission, transmettez ces fichiers encore une fois.</li>
<li>Apr&egrave;s chaque transmission visualisez le contenu actualis&eacute; sur l'ordinateur serveur pour v&eacute;rifier si les nouveaux fichiers s'affichent. attention: L'affichage de la date et de l'heure sur l'ordinateur serveur ne doit pas forc&eacute;ment correspondre &agrave; la date et l'heure que vous avez localement. Beaucoup d'ordinateurs serveurs se trouvent aux USA et utilisent comme heure syst&egrave;me l'heure locale de l&agrave; bas. M&ecirc;me pour les tailles de fichiers, peuvent &ecirc;tre affich&eacute;es des diff&eacute;rences entre la version locale et la version du serveur. Ce qui ne veut pas dire pour autant que le fichier a souffert lors de sa transmission.</li>
<li>Appelez ensuite les nouveaux fichiers avec un navigateur Web pour contr&ocirc;ler si tout fonctionne normalement.</li>
</ul>








<table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr><td colspan="2" bgcolor="#EEEEEE" class="doc">
&#160;<a href="#top"><img src="../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a>
</td></tr>
<tr><td bgcolor="#EEEEEE" class="doc" align="right"><a href="divulguer.htm"><img src="../src/suivant.gif" width="10" height="10" border="0" hspace="10" alt="page suivante"></a></td>
<td bgcolor="#FFFFFF"><img src="../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information"> <a href="divulguer.htm"><b> Faire conna&icirc;tre des projets Web</b></a>
</td></tr>
<tr>
<td bgcolor="#EEEEEE" class="doc" align="right"><a href="planifier.htm"><img src="../src/precedent.gif" width="10" height="10" border="0" hspace="10" alt="page pr&eacute;c&eacute;dente"></a></td>
<td bgcolor="#FFFFFF" width="100%"><img src="../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information"> <a href="planifier.htm"><b>Planification de projets Web</b></a>
</td>
</tr>
<tr><td colspan="2" bgcolor="#EEEEEE" class="doc">&#160;</td></tr>
</table><table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr>
<td bgcolor="#FFEEDD" class="nav"><a class="an" name="bottom"><img src="../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"></a> <a href="../index.htm"><b>SELFHTML</b></a>/<a href="../navigation/index.htm" target="_parent">Aides &agrave; la navigation</a> <img src="../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="index.htm"><b>Gestion de projets Web</b></a></td>
</tr>
</table>

<p>&copy; 2001 Stefan M&uuml;nz / &copy; 2003 Traduction <img src="../src/courriel.gif" width="15" height="10" border="0" alt="Adresse &eacute;lectronique">&nbsp;<a href="mailto:13405@free.fr">Serge Fran&ccedil;ois, 13405@free.fr</a><br><img src="../src/courriel.gif" width="15" height="10" border="0" alt="Adresse &eacute;lectronique">&nbsp;<a href="mailto:selfhtml@selfhtml.com.fr">selfhtml@selfhtml.com.fr</a></p>



</body>
</html>
