<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>SELFHTML: HTML/XHTML / XHTML et HTML / Diff&eacute;rences entre  XHTML et HTML</title>
<link rel="stylesheet" type="text/css" href="../../src/selfhtml.css">
<meta name="description"    content="xxxxx">
<meta name="keywords"       content="SELFHTML, HTML,  XHTML, modularisation, diff&eacute;rences, ">
<meta name="author"         content="Stefan M&uuml;nz, selfhtml@teamone.de">
<meta http-equiv="content-type" content="text/html; charset=ISO-8859-1">
<meta name="DC.Publisher"   content="Serge Fran&ccedil;ois, selfhtml@selfhtml.com.fr">
<meta name="DC.Date"        content="2003-01-27T08:00+00:00">
<meta name="DC.Identifier"  content="http://selfhtml.selfhtml.com.fr/html/xhtml/differences.htm">
<meta name="DC.Language"    content="fr">
<meta name="DC.Rights"      content="../../editorial/copyright.htm">
<meta name="DC.Date.Create" content="2003-01-27T08:00+00:00">
<meta name="SELF.Version"   content="1">
<meta name="SELF.Pagetype"  content="Information">
<meta name="SELF.Path"      content="SELFHTML == ../../index.htm // HTML/XHTML == ../index.htm // XHTML et HTML == index.htm">
<link rel="stylesheet" type="text/css" href="../../src/selfhtml.css">
<!-- Matomo -->
<script type="text/javascript">
  var _paq = window._paq = window._paq || [];
  /* tracker methods like "setCustomDimension" should be called before "trackPageView" */
  _paq.push(['trackPageView']);
  _paq.push(['enableLinkTracking']);
  (function() {
    var u="//matomo.boitasite.com/";
    _paq.push(['setTrackerUrl', u+'matomo.php']);
    _paq.push(['setSiteId', '1']);
    var d=document, g=d.createElement('script'), s=d.getElementsByTagName('script')[0];
    g.type='text/javascript'; g.async=true; g.src=u+'matomo.js'; s.parentNode.insertBefore(g,s);
  })();
</script>
<!-- End Matomo Code -->
</head>

<body bgcolor="#FFFFFF" text="#000000" link="#AA5522" vlink="#772200" alink="#000000">

<table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr><td bgcolor="#FFEEDD" class="nav"><a class="an" name="top"><img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"></a> <a href="../../index.htm"><b>SELFHTML</b></a>/<a href="../../navigation/index.htm" target="_parent">Aides &agrave; la navigation</a> <img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="../index.htm"><b>HTML/XHML</b></a> <img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="index.htm"><b>XHTML et HTML</b></a></td>
</tr></table>

<table cellpadding="4" cellspacing="0" border="0" width="100%">

<tr>
<td bgcolor="#EEEEEE" class="doc" width="110"><img src="../../src/logo.gif" width="106" height="109" border="0" alt="SELFHTML"></td>
<td bgcolor="#EEEEEE" class="doc" valign="bottom" width="100%"><h2>Diff&eacute;rences entre  XHTML et HTML</h2></td>
</tr>

<tr>
<td bgcolor="#EEEEEE" class="doc" valign="top" align="center">
<img src="../../src/docx.gif" width="30" height="20" vspace="6" border="0" alt="Page d'information: vue d'ensemble">
</td>

<td bgcolor="#FFFFFF" valign="top" nowrap>
<p>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#generalites"><b>G&eacute;n&eacute;ralit&eacute;s sur XHTML</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#types_mime"><b>Diff&eacute;rence: types Mime</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#noms_fichiers"><b>Diff&eacute;rence: noms de fichiers</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#declaration_xml"><b>Diff&eacute;rence: la d&eacute;claration XML</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#type_document"><b>Diff&eacute;rence: mentions de type de document</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#element_racine"><b>Diff&eacute;rence: &eacute;l&eacute;ment HTML racine avec mention de l'espace de nommage</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#ossature"><b>Diff&eacute;rence: respect strict de l'ossature HTML</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#minuscules"><b>Diff&eacute;rence: minuscules</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#elements_vides"><b>Diff&eacute;rence: &eacute;l&eacute;ments vides</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#repere_fermeture_option"><b>Diff&eacute;rence: &eacute;l&eacute;ments avec rep&egrave;re de fermeture facultatif</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#attributs_vides"><b>Diff&eacute;rence: rep&egrave;res autonomes (vides)</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#espaces_valeurs"><b>Diff&eacute;rence: espaces dans les affectations de valeur</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#ancre_liens"><b>Diff&eacute;rence: liens &agrave; des ancres</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#lang"><b>Diff&eacute;rence: l'attribut universel lang=</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#script_style"><b>Diff&eacute;rence: contenu de passages script et de style</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#imbrication"><b>Diff&eacute;rence: exceptions dans les r&egrave;gles d'imbrication</b></a><br>
<img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas">&nbsp;<a href="#exemple"><b>Exemple d'un document XHTML conforme</b></a><br>
</p>
</td>
</tr>

<tr><td colspan="2" bgcolor="#EEEEEE" class="doc">&#160;<a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&nbsp;</td></tr>
</table>




<h2 class="Sh2"><a class="an" name="generalites">G&eacute;n&eacute;ralit&eacute;s sur XHTML</a></h2>

<p>Le concept des langages de marquage dont HTML est un parmi beaucoup d'autres mais toutefois le plus populaire et le plus connu dans le monde jusqu'alors - ce concept donc est d&eacute;j&agrave; plus ancien. Une particularit&eacute; du concept de ce genre de langages de marquage est que ses composantes ne sont pas simplement &quot;invent&eacute;es&quot;, mais qu'il y a des langages Meta &agrave; l'aide desquels sont d&eacute;finies les r&egrave;gles et les composantes de tels langages de marquage.</p>

<p>Depuis 1986 d&eacute;j&agrave; existe le langage Meta standardis&eacute; sous l'appellation ISO 8879 <b>SGML</b> (<i>Standard Generalized Markup Language = langage de marquage g&eacute;n&eacute;ralis&eacute; standard</i>). Ce  langage Meta permet la d&eacute;finition de langages de marquage &agrave; l'aide de ce qu'on appelle les <b>DTDs</b> (<i>Document Type Definitions = d&eacute;finitions de type de document</i>). Dans les DTDs sont fix&eacute;s quels &eacute;l&eacute;ments un langage de marquage a, quels attributs ils comprennent ainsi que les r&egrave;gles qui fixent quels &eacute;l&eacute;ments peuvent &ecirc;tre plac&eacute;s dans quels autres etc... Maintenant SGML est bien rod&eacute; et passe g&eacute;n&eacute;ralement pour assez &quot;sophistiqu&eacute;&quot;. Ainsi on prit la d&eacute;cision d'&eacute;tablir une variante r&eacute;duite de SGML et cela sous le nom de  <b>XML</b> (<i>Extensible Markup Language = langage de marquage extensible</i>). XML permet de la m&ecirc;me fa&ccedil;on que SGML la d&eacute;finition de langages de marquage &agrave; l'aide de  DTDs.</p>

<p>HTML, qui apparut au d&eacute;but des ann&eacute;es 1990, a &eacute;t&eacute; d&eacute;fini avec SGML. Jusqu'&agrave; HTML 4.x inclus, c'est encore aujourd'hui le cas. Sur la lanc&eacute;e de XML et de son importance croissante pour toujours plus de formats de fichier qui sont aussi utilis&eacute;s sur la toile, le souhait se fit jour de d&eacute;finir aussi HTML &agrave; l'aide de XML plut&ocirc;t qu'avec SGML comme c'&eacute;tait le cas jusqu'alors. Afin que cela ne donne pas lieu &agrave; une confusion dans les versions, on se d&eacute;cida &agrave; doter ce nouveau HTML bas&eacute; sur XML d'un nouveau nom et de son propre contr&ocirc;le de versions. Ce qui donna naissance &agrave;  <b>XHTML</b> (<i>Extensible HyperText Markup Language = langage de marquage hypertexte extensible</i>).</p>

<p>Depuis janvier 2000  XHTML 1.0 se trouve dans les recommandations du consortium W3 et a de ce fait la m&ecirc;me place officielle que HTML 4.0 par exemple. XHTML 1.0 n'est rien d'autre que la tentative de faire &eacute;voluer HTML 4.0 bas&eacute; sur SGML &agrave; l'aide de XML. Ce n'est pas une simple lubie de concepteurs de langages artificiels, mais il y a de bonnes raisons qui plaident pour le faire:</p>

<ul>
<li>XHTML est sur le plan de la syntaxe compatible &agrave; 100% avec des <img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="../../xml/intro.htm#langages_standard"><b>langages standard XML importants</b></a> tels que SVG, WML, SMIL etc...</li>
<li>C'est ainsi que XHTML peut &ecirc;tre incorpor&eacute; comme <img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="../../xml/regles/espaces_nom.htm#dateninseln"><b>&icirc;lot de donn&eacute;es</b></a> dans d'autres langages et que de la m&ecirc;me fa&ccedil;on, il est possible d'incorporer ces autres langages comme &icirc;lots de donn&eacute;es en XHTML. Ainsi par exemple, il est possible sans probl&egrave;me d'incorporer un fichier graphique SVG comme &icirc;lot de donn&eacute;es dans un fichier XHTML. Le fichier graphique SVG ne doit plus de ce fait &ecirc;tre r&eacute;f&eacute;renc&eacute; mais fait partie int&eacute;grante du fichier  XHTML.</li>
<li>&Eacute;tant donn&eacute; la syntaxe de base commune sur la base de XML, il est &eacute;galement possible d'uniformiser les langages script. C'est exactement ce qui se passe avec les <b>DOM</b> (<i>Document Object Model = mod&egrave;le objet du document</i>). Le mod&egrave;le DOM d&eacute;finit des objets, des propri&eacute;t&eacute;s et des m&eacute;thodes pour l'acc&egrave;s aux &eacute;l&eacute;ments de langages bas&eacute;s sur XML. Une telle application n'est toutefois possible que parce que tous ces langages suivent le m&ecirc;me sch&eacute;ma de syntaxe impos&eacute; par XML. &Eacute;tant donn&eacute; que les sch&eacute;mas de syntaxe HTML sont tr&egrave;s proches de ceux de XHTML, le mod&egrave;le DOM n'est dans la pratique applicable qu'avec HTML. Pourtant le d&eacute;sir d'avoir du HTML qui s'en tienne exactement &agrave; la syntaxe de XML, est justifi&eacute;.</li>
<li>Ce qui s'applique aux langages script s'applique aussi aux langages de feuilles de style. Le langage de feuilles de style g&eacute;n&eacute;ral bas&eacute; lui m&ecirc;me sur XML <b>XSL</b> (<i>Extensible Stylesheet Language = langage de feuilles de style extensible</i>) a &eacute;t&eacute; d&eacute;velopp&eacute; exactement dans ce but. Il met une base uniforme &agrave; disposition pour tous les langages bas&eacute;s sur XML.</li>
</ul>

<p>XHTML est donc du HTML conforme &agrave; XML. L'&quot;&eacute;volution&quot; de HTML 4.0 en XHTML 1.0 est &agrave; ce point r&eacute;ussie qu'existent en XHTML les m&ecirc;mes &eacute;l&eacute;ments, attributs et r&egrave;gles d'imbrication qu'en HTML. Il y a toutefois quelques diff&eacute;rences de d&eacute;tail impos&eacute;es par la syntaxe de XML et qu'il vous faut conna&icirc;tre si vous voulez &eacute;crire vos pages en XHTML plut&ocirc;t qu'en HTML.</p>

<p>En ce qui concerne la compatibilit&eacute; des navigateurs, il n'y a pas de probl&egrave;me majeur. Les navigateurs qui s'en sortent avec HTML 4.0, peuvent aussi traiter les documents &eacute;crits en XHTML, et les affichent &agrave; l'&eacute;cran exactement de la m&ecirc;me fa&ccedil;on qu'avec HTML. Des probl&egrave;mes ponctuels, en particulier avec les navigateurs plus anciens, ne sont par contre pas &agrave; exclure.</p>




<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&nbsp;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="types_mime">Diff&eacute;rence: Types Mime</a></h2>

<p>Le <img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="../../divers/typesmime.htm"><b>Type Mime</b></a>
pour des documents HTML ordinaires est toujours <code>text/html</code>.
Les documents XHTML peuvent &eacute;galement avoir ce type Mime. En m&ecirc;me temps, les types Mime <code>text/xml</code> ou <code>application/xml</code> sont cependant &eacute;galement permis. Pour l'&eacute;tablissement de fichiers  XHTML c'est sans importance. &Ccedil;a l'est pourtant pour la communication entre le navigateur Web et le serveur Web. Au cas o&ugrave; le serveur Web propose, dans un environnement HTTP, le fichier appel&eacute; en tant que fichier du type <code>text/xml</code> ou bien <code>application/xml</code>, la navigateur doit accepter ce type Mime et se sentir en mesure d'afficher des fichiers de ce type &agrave; l'&eacute;cran. Dans le cas contraire, il peut arriver par exemple que le navigateur propose &agrave; l'utilisateur de t&eacute;l&eacute;charger le fichier au lieu de le charger pour affichage &agrave; l'&eacute;cran.</p>





<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&nbsp;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="noms_fichiers">Diff&eacute;rence: noms de fichiers</a></h2>

<p>Les navigateurs plus r&eacute;cents supportant XML  (Explorer Internet &agrave; partir de la version 5.x, Netscape &agrave; partir de la version 6.x) traitent les fichiers diff&eacute;remment selon leur extension, s'ils n'ont pas d'indications (type Mime). Quand vous respectez dans un fichier toutes les r&egrave;gles de XHTML mais sauvegardez le fichier avec les extensions typiques <var>.htm</var> ou bien <var>.html</var>, ces navigateurs utilisent leur  <img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="../generalites/marquertexte.htm#html_parser"><b>analyseur syntaxique HTML</b></a>. Sauvegardez par contre le fichier avec une autre extension, par exemple  <var>.xhtml</var>, alors les navigateurs utilisent leur <img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="../../xml/intro.htm#parser"><b>analyseur syntaxique XML</b></a>. La diff&eacute;rence se fait avant tout sentir quand le document contient des erreurs de syntaxe. Les  analyseurs syntaxiques HTML habituels aujourd'hui laissent tout simplement passer des fautes de syntaxe dans le document et tentent d'afficher le document &quot;tant bien que mal&quot;. Les  analyseurs syntaxiques XML par contre interrompent avec un message d'erreur d&egrave;s qu'ils butent sur une faute de syntaxe. Dans la fen&ecirc;tre d'affichage du navigateur appara&icirc;t alors un message d'erreur &agrave; la place du document.</p>

<p>Pour la repr&eacute;sentation de documents XHTML sans erreur et contr&ocirc;l&eacute;s par l'analyseur de syntaxe XML, sans CSS ou autres feuilles de style, les navigateurs r&eacute;agissent diff&eacute;remment. Netscape 6.x affiche le document comme un document HTML donc avec les repr&eacute;sentations par d&eacute;faut pour les titres, paragraphes, listes, tableaux etc... L'Explorer Internet repr&eacute;sente par contre ces documents comme une pure arborescence d'&eacute;l&eacute;ments. Ce n'est que lorsque vous avez format&eacute; les &eacute;l&eacute;ments employ&eacute;s avec des feuilles de style CSS que l'Explorer Internet affiche le document autrement que sous forme d' organigramme.</p>

<p>Donc aussi longtemps que vous enregistrez des fichiers conformes &agrave; XHTML avec la terminaison typique <var>.htm</var> ou bien  <var>.html</var> , vous obtenez une repr&eacute;sentation &quot;normale&quot; dans le navigateur, mais emp&ecirc;chez aussi que les fichiers dans le navigateur ne soient trait&eacute;s sur la base de XML. Enregistrez par contre les fichiers avec une autre terminaison inconnue du navigateur ou associ&eacute;e au type Mime <code>text/xml</code>, alors les fichiers seront certes trait&eacute;s sur la base de XML mais ne devront contenir aucune faute de syntaxe, et si dans la fen&ecirc;tre d'affichage de l'Explorer Internet doit appara&icirc;tre quelque chose d'autre qu'une structure arborescente, il vous faut utiliser les feuilles de style pour formater les &eacute;l&eacute;ments.</p>




<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&nbsp;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="declaration_xml">Diff&eacute;rence: la d&eacute;claration XML</a></h2>

<p>La toute premi&egrave;re chose qui doit &ecirc;tre not&eacute;e au d&eacute;but d'un fichier XHTML est ce qu'on appelle une d&eacute;claration XML. Vous sp&eacute;cifiez ainsi que le fichier qui suit contient des donn&eacute;es conformes &agrave; XML. Une telle d&eacute;claration n'existe pas en HTML 4.0 et est donc sp&eacute;cifique &agrave; XHTML.</p>

<h3 class="xmp">Exemple pour XHTML 1.0:</h3>

<table width="100%" cellpadding="10"><tr><td class="xmpcode" bgcolor="#FFFFE0"><pre>
&lt;?xml version=&quot;1.0&quot; encoding=&quot;UTF-8&quot;?&gt;
</pre></td></tr></table>

<p>Notez cette mention telle qu'elle est indiqu&eacute;e dans l'exemple: dans la premi&egrave;re ligne du fichier XHTML, en respectant le point d'interrogation, les minuscules et les majuscules. Pour l'instant n'est pertinente pour l'attribut  <code>version=</code> que la valeur <code>1.0</code>. Pour l'attribut <code>encoding=</code> vous pouvez mentionner un jeu de caract&egrave;res d'apr&egrave;s lequel les donn&eacute;es du fichier doivent &ecirc;tre interpr&eacute;t&eacute;es.<br>
<code>encoding=&quot;UTF-8&quot;</code> exprime le jeu de caract&egrave;res international sur la base de la norme ISO/IEC-10646 (Unicode) avec une largeur de caract&egrave;re de 8 bits c'est &agrave; dire qu'un octet  correspond &agrave; un caract&egrave;re dans le fichier.<br>
<code>encoding=&quot;UTF-16&quot;</code> exprime le jeu de caract&egrave;res international sur la base de la la norme ISO/IEC-10646 (Unicode) avec une largeur de caract&egrave;re de 16 bits c'est &agrave; dire que deux octets  correspondent &agrave; un caract&egrave;re dans le fichier.</p>








<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&nbsp;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="type_document">Diff&eacute;rence: mentions de type de document</a></h2>

<p>XHTML 1.0 et HTML 4.0 ont des <img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="../generalites/ossature.htm#type_document"><b>mentions de type de document</b></a> diff&eacute;rentes. La mention de type de fichier se r&eacute;f&egrave;re &agrave; la DTD et &agrave; la langue que vous employez dans le fichier et auxquelles vous voulez vous tenir. Un  <img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="../../xml/intro.htm#parser"><b>analyseur syntaxique</b></a> rigoureux peut emp&ecirc;cher l'affichage du fichier par exemple dans le navigateur, quand le fichier contient des erreurs de syntaxe. Une erreur de syntaxe typique ici est la DTD &agrave; laquelle vous vous r&eacute;f&eacute;rez dans la mention du type de document.</p>

<h3 class="xmp">Exemple pour HTML 4.01:</h3>

<table width="100%" cellpadding="10"><tr><td class="xmpcode" bgcolor="#FFFFE0"><pre>
&lt;!DOCTYPE HTML PUBLIC &quot;-//W3C//DTD HTML 4.01 Strict//EN&quot;
       &quot;http://www.w3.org/TR/html4/strict.dtd&quot;&gt;
</pre></td></tr></table>

<h3 class="xmp">Exemple correspondant pour XHTML 1.0:</h3>

<table width="100%" cellpadding="10"><tr><td class="xmpcode" bgcolor="#FFFFE0"><pre>
&lt;!DOCTYPE html PUBLIC &quot;-//W3C//DTD XHTML 1.0 Strict//EN&quot;
       &quot;http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd&quot;&gt;
</pre></td></tr></table>

<h3 class="xpl">Explication:</h3>

<p>Les exemples montrent comment sont not&eacute;s les types de document pour HTML 4.01 et XHTML 1.0 pour la <img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="../reference/variantes.htm"><b>variante HTML</b></a> &quot;Strict&quot;. M&ecirc;me en XHTML 1.0 existent les trois variantes &quot;Strict&quot;, &quot;Transitional&quot; et &quot;Frameset&quot;, exactement comme en  HTML 4.0. Les deux autres variantes  pour XHTML sont:<br>
<code>&lt;!DOCTYPE html PUBLIC &quot;-//W3C//DTD XHTML 1.0 Transitional//EN&quot; &quot;http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd&quot;&gt;</code><br>
et<br>
<code>&lt;!DOCTYPE html PUBLIC &quot;-//W3C//DTD XHTML 1.0 Frameset//EN&quot; &quot;http://www.w3.org/TR/xhtml1/DTD/xhtml1-frameset.dtd&quot;&gt;</code></p>

<h3 class="inf">Attention:</h3>

<p>Ainsi qu'il est not&eacute; ci-dessus, un analyseur syntaxique XML rigoureux &eacute;tablira une connexion Internet pour charger la DTD de l'adresse Web indiqu&eacute;e pour comparer le document avec les r&egrave;gles contenues dans la DTD. Vous pouvez int&eacute;grer les DTD dans votre propre projet. &Agrave; supposer que vous ayiez un fichier de d&eacute;part du nom de <var>index.htm</var> et que vous ayiez enregistr&eacute; le fichier <var>xhtml1-strict.dtd</var> dans un r&eacute;pertoire distinct du nom de <var>html-dtd</var>, alors vous pouvez noter dans le fichier <var>index.htm</var> :<br>
<code>&lt;!DOCTYPE html PUBLIC &quot;-//W3C//DTD XHTML 1.0 Strict//EN&quot; &quot;html-dtd/xhtml1-strict.dtd&quot;&gt;</code>.<br>
Vous pouvez   <img src="../../src/zip.gif" width="12" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="affichage/xhtml_dtds.zip"><b>t&eacute;l&eacute;charger les DTD n&eacute;cessaires pour  XHTML </b></a>. Le fichier Zip (31 Koctets) contient les DTD pour les trois variantes &quot;Strict&quot;, &quot;Transitional&quot; et &quot;Frameset&quot; ainsi que trois fichiers suppl&eacute;mentaires avec des d&eacute;finitions pour les signes nomm&eacute;s.</p>







<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&nbsp;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="element_racine">Diff&eacute;rence: &eacute;l&eacute;ment HTML racine avec mention de l'espace de nommage</a></h2>

<p>Le rep&egrave;re d'introduction <code>&lt;html&gt;</code> en HTML n'a en principe aucun attribut. En XHTML pourtant, vous devez mentionner explicitement le nom d'espace de nommage pour XHTML.</p>

<h3 class="xmp">Exemple pour HTML 4.01:</h3>

<table width="100%" cellpadding="10"><tr><td class="xmpcode" bgcolor="#FFFFE0"><pre>
&lt;html&gt;
&lt;!-- contenu du fichier --&gt;
&lt;/html&gt;
</pre></td></tr></table>

<h3 class="xmp">Exemple correspondant pour XHTML 1.0:</h3>

<table width="100%" cellpadding="10"><tr><td class="xmpcode" bgcolor="#FFFFE0"><pre>
&lt;html xmlns=&quot;http://www.w3.org/1999/xhtml&quot;&gt;
&lt;!-- contenu du fichier --&gt;
&lt;/html&gt;
</pre></td></tr></table>

<h3 class="xpl">Explication:</h3>

<p>En XHTML notez toujours dans le rep&egrave;re d'ouverture <code>&lt;html&gt;</code> l'attribut <code>xmlns=</code> qui d&eacute;signe un espace de nommage XML et affectez lui la valeur <code>http://www.w3.org/1999/xhtml</code>. C'est une URI sp&eacute;ciale qui n'est pas con&ccedil;ue comme la mention d'une adresse Web &agrave; appeler mais qui se sert en fin de compte du sch&eacute;ma de l'adressage Web, pour affecter un nom sans ambigu&iuml;t&eacute; &agrave; l'&eacute;chelle du monde pour l'espace de nommage. L'adresse Web existe certes, parce que le consortium W3 a &eacute;t&eacute; assez gentil pour &eacute;viter l'accumulation d'appels erron&eacute;s sur leur serveur - pourtant l'adresse ne signifie rien d'autre que si l'on avait fix&eacute; comme nom: &quot;Specification-XHTML-Superdupe&quot;.</p>




<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&nbsp;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="ossature">Diff&eacute;rence: respect strict de l'ossature HTML</a></h2>

<p>Quand en HTML vous omettez les &eacute;l&eacute;ments <code>head</code> et <code>body</code> et que sinon entre <code>&lt;html&gt;</code> et <code>&lt;/html&gt;</code> vous notez du code HTML valide, il s'agit alors du point de vue de HTML d'un document sans faute. Cette licence n'existe pas en XHTML. L&agrave; un fichier HTML doit imp&eacute;rativement respecter l'ossature habituelle et contenir un rep&egrave;re <code>head</code> et un rep&egrave;re <code>body</code>. Par ailleurs l'&eacute;l&eacute;ment <code>title</code> dans l'&eacute;l&eacute;ment  <code>head</code> est imp&eacute;rativement n&eacute;cessaire et doit &ecirc;tre not&eacute; comme premier &eacute;l&eacute;ment du rep&egrave;re <code>head</code>.</p>

<h3 class="xmp">Exemple pour HTML 4.01:</h3>

<table width="100%" cellpadding="10"><tr><td class="xmpcode" bgcolor="#FFFFE0"><pre>
&lt;html&gt;
&lt;h1&gt;Texte&lt;/h1&gt;
&lt;/html&gt;
</pre></td></tr></table>

<h3 class="xmp">Exemple correspondant pour XHTML 1.0:</h3>

<table width="100%" cellpadding="10"><tr><td class="xmpcode" bgcolor="#FFFFE0"><pre>
&lt;html xmlns=&quot;http://www.w3.org/1999/xhtml&quot;&gt;
&lt;head&gt;
&lt;title&gt;Texte&lt;/title&gt;
&lt;!-- le cas �ch�ant autres �l�ments de l'ent�te --&gt;
&lt;/head&gt;
&lt;body&gt;
&lt;h1&gt;Texte&lt;/h1&gt;
&lt;/body&gt;
&lt;/html&gt;
</pre></td></tr></table>

<h3 class="xpl">Explication:</h3>

<p>La forme indiqu&eacute;e pour noter un document HTML 4.0 est certes loin d'&ecirc;tre recommand&eacute;e pour la pratique mais au moins elle n'est pas fausse. Pour un document XHTML par contre l'ossature compl&egrave;te, y compris l'&eacute;l&eacute;ment <code>title</code> doit toujours &ecirc;tre not&eacute;e.</p>







<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&nbsp;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="minuscules">Diff&eacute;rence: minuscules</a></h2>

<p>En HTML 4.0, peu importe si vous notez <code>&lt;TABLE BORDER=&quot;0&quot;&gt;</code>, <code>&lt;TABLE border=&quot;0&quot;&gt;</code> ou bien <code>&lt;Table Border=&quot;0&quot;&gt;</code>. HTML ne fait pas de distinction entre les majuscules et les minuscules pour les noms de rep&egrave;res HTML ou pour les noms d'attributs. Seule la distinction entre minuscules et majuscules est faite pour l'affectation de valeur de certains attributs - mais ce n'est aussi que par &eacute;gard pour les langages script. Pour les attributs avec des valeurs permises fixes, comme par exemple <code>align=</code>, peu importe que vous notiez <code>CENTER</code> ou bien <code>center</code>. Il n'en va pas de m&ecirc;me pour XHTML. XML diff&eacute;rencie &agrave; vrai dire strictement les minuscules des majuscules. Ce qui veut dire que <code>&lt;TABLE&gt;</code> est quelque chose d'autre que <code>&lt;table&gt;</code>. Pour XHTML il a &eacute;t&eacute; fix&eacute; que <b>tous les noms d'&eacute;l&eacute;ments et d'attributs sont &eacute;crits en minuscules</b>. Il en va de m&ecirc;me aussi pour les affectations de valeurs fixes comme <code>center</code>.</p>

<h3 class="xmp">Exemple pour HTML 4.01:</h3>

<table width="100%" cellpadding="10"><tr><td class="xmpcode" bgcolor="#FFFFE0"><pre>
&lt;OBJECT DATA=&quot;Video.mpg&quot; TYPE=&quot;video/mpeg&quot; ALIGN=&quot;LEFT&quot;&gt;&lt;/OBJECT&gt;
</pre></td></tr></table>

<h3 class="xmp">Exemple correspondant pour XHTML 1.0:</h3>

<table width="100%" cellpadding="10"><tr><td class="xmpcode" bgcolor="#FFFFE0"><pre>
&lt;object data=&quot;Paris.mpg&quot; type=&quot;video/mpeg&quot; align=&quot;left&quot;&gt;&lt;/object&gt;
</pre></td></tr></table>

<h3 class="xpl">Explication:</h3>

<p>En XHTML, &eacute;crivez toujours tous les noms d'&eacute;l&eacute;ments comme <code>object</code> ou d'attribut comme <code>data</code> ou bien <code>type</code> en minuscules. En cas de doute, &eacute;crivez de la m&ecirc;me mani&egrave;re les affectations de valeurs toujours en minuscules, donc par exemple pour <code>align=&quot;left&quot;</code>. Il n'y a que l&agrave; o&ugrave;, dans une affectation de valeur, certaines majuscules sont n&eacute;cessaires comme par exemple pour le nom de fichier  <code>Paris.mpg</code>, que vous pouvez &eacute;crire la valeur comme il est correct de le faire.</p>



<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&nbsp;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="elements_vides">Diff&eacute;rence: &eacute;l&eacute;ments vides</a></h2>

<p>En HTML 4.0 existent diff&eacute;rents  &eacute;l&eacute;ments vides. Ce sont les &eacute;l&eacute;ments sans rep&egrave;re de fermeture. Le rep&egrave;re de fermeture est interdit parce que les &eacute;l&eacute;ments sont d&eacute;finis comme &eacute;tant vides. Exemples:<br>
<code>&lt;img&gt;</code>, <code>&lt;br&gt;</code>, <code>&lt;input&gt;</code>, <code>&lt;hr&gt;</code>.<br>
Dans les langages bas&eacute;s sur XML, donc &eacute;galement en  XHTML, ces &eacute;l&eacute;ments vides doivent &ecirc;tre marqu&eacute;s sp&eacute;cialement.</p>

<h3 class="xmp">Exemple pour HTML 4.01:</h3>

<table width="100%" cellpadding="10"><tr><td class="xmpcode" bgcolor="#FFFFE0"><pre>
&lt;p&gt;Texte avec&lt;br&gt;passage � la ligne&lt;/p&gt;
&lt;p&gt;&lt;img src=&quot;image.gif&quot; alt=&quot;une image&quot;&gt;&lt;/p&gt;
</pre></td></tr></table>

<h3 class="xmp">Exemple correspondant pour XHTML 1.0:</h3>

<table width="100%" cellpadding="10"><tr><td class="xmpcode" bgcolor="#FFFFE0"><pre>
&lt;p&gt;Texte avec&lt;br /&gt;passage � la ligne&lt;/p&gt;
&lt;p&gt;&lt;img src=&quot;image.gif&quot; alt=&quot;une image&quot; /&gt;&lt;/p&gt;
</pre></td></tr></table>

<h3 class="xpl">Explication:</h3>

<p>Notez tout de suite avant la parenth&egrave;se pointue de fermeture (&amp;gt;) du rep&egrave;re autonome une barre oblique de fa&ccedil;on &agrave; ce que la cha&icirc;ne de caract&egrave;res <code>/&gt;</code> soit &agrave; la fin. Avant la barre oblique, doit figurer un espace. Une autre possibilit&eacute; est de noter un rep&egrave;re d'ouverture et un rep&egrave;re de fermeture par exemple <code>&lt;br&gt;&lt;/br&gt;</code>. Cependant rien ne doit figurer (ni espace, ni passage &agrave; la ligne)entre le rep&egrave;re d'ouverture et le rep&egrave;re de fermeture, sinon ce serait du XHTML invalide.</p>

<p>Si vous utilisez sans contenu des &eacute;l&eacute;ments qui peuvent avoir du contenu par exemple  <code>&lt;p&gt;&lt;/p&gt;</code>, alors notez les en XHTML toujours sous cette forme et jamais sous la forme <code>&lt;p&nbsp;/&gt;</code>.</p>



<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&nbsp;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="repere_fermeture_option">Diff&eacute;rence: &eacute;l&eacute;ments avec rep&egrave;re de fermeture facultatif</a></h2>

<p>En HTML 4.0 existent diff&eacute;rents &eacute;l&eacute;ments avec rep&egrave;re de fermeture facultatif. exemples:<br>
<code>&lt;body&gt;</code>, <code>&lt;td&gt;</code>, <code>&lt;dd&gt;</code>, <code>&lt;dt&gt;</code>, <code>&lt;option&gt;</code>.<br>
Notez toujours ces &eacute;l&eacute;ments en XHTML avec rep&egrave;res d'ouverture et de fermeture.</p>

<h3 class="xmp">Exemple pour HTML 4.01:</h3>

<table width="100%" cellpadding="10"><tr><td class="xmpcode" bgcolor="#FFFFE0"><pre>
&lt;select name=&quot;choix&quot; size=&quot;1&quot;&gt;
&lt;option&gt;1er enregistrement
&lt;option&gt;2�me enregistrement
&lt;option&gt;3�me enregistrement
&lt;/select&gt;
</pre></td></tr></table>

<h3 class="xmp">Exemple correspondant pour XHTML 1.0:</h3>

<table width="100%" cellpadding="10"><tr><td class="xmpcode" bgcolor="#FFFFE0"><pre>
&lt;select name=&quot;choix&quot; size=&quot;1&quot;&gt;
&lt;option&gt;1er enregistrement&lt;/option&gt;
&lt;option&gt;2�me enregistrement&lt;/option&gt;
&lt;option&gt;3�me enregistrement&lt;/option&gt;
&lt;/select&gt;
</pre></td></tr></table>

<h3 class="xpl">Explication:</h3>

<p>Tous les &eacute;l&eacute;ments qui peuvent avoir un contenu doivent en XHTML &ecirc;tre marqu&eacute;s par un rep&egrave;re d'ouverture et un rep&egrave;re de fermeture.</p>





<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&nbsp;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="attributs_vides">Diff&eacute;rence: rep&egrave;res autonomes (vides)</a></h2>

<p>En HTML 4.0 existent diff&eacute;rents attributs qui ne se voient pas affecter la moindre valeur. exemples:<br>
<code>&lt;hr noshade&gt;</code>, <code>&lt;td nowrap&gt;</code>, <code>&lt;script defer&gt;</code>.<br>
Dans les langages bas&eacute;s sur XML ce type d'attributs n'existe pas. Tous les attributs doivent recevoir une valeur. En XHTML vous devez donc attribuer &agrave; ces attributs une valeur quelconque. On s'est mis d'accord pour attribuer comme valeur tout simplement le nom de l'attribut.</p>

<h3 class="xmp">Exemple pour HTML 4.01:</h3>

<table width="100%" cellpadding="10"><tr><td class="xmpcode" bgcolor="#FFFFE0"><pre>
&lt;td nowrap&gt;contenu&lt;/td&gt;
&lt;p&gt;Texte avec&lt;hr noshade&gt;Ligne de s�paration&lt;/p&gt;
</pre></td></tr></table>

<h3 class="xmp">Exemple correspondant pour XHTML 1.0:</h3>

<table width="100%" cellpadding="10"><tr><td class="xmpcode" bgcolor="#FFFFE0"><pre>
&lt;td nowrap=&quot;nowrap&quot;&gt;contenu&lt;/td&gt;
&lt;p&gt;Texte avec&lt;hr noshade=&quot;noshade&quot; /&gt;Ligne de s�paration&lt;/p&gt;
</pre></td></tr></table>

<h3 class="xpl">Explication:</h3>

<p>Affectez comme valeur aux attributs vides en XHTML simplement leur propre nom. Pour la plupart des navigateurs connus, cela ne pose aucun probl&egrave;me.</p>







<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&nbsp;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="espaces_valeurs">Diff&eacute;rence: espaces dans les affectations de valeur</a></h2>

<p>Pour les affectations de valeur aux attributs, vous devez faire plus attention en XHTML qu'en HTML. Les espaces sont permis l&agrave; o&ugrave; ils sont n&eacute;cessaires, pourtant il vous faut absolument &eacute;viter les passages &agrave; la ligne. </p>

<h3 class="xmp">Exemple pour du XHTML 1.0 correct:</h3>

<table width="100%" cellpadding="10"><tr><td class="xmpcode" bgcolor="#FFFFE0"><pre>
&lt;p title=&quot;Commencement de l'histoire&quot;&gt;Texte Texte Texte&lt;/p&gt;
</pre></td></tr></table>

<h3 class="xmp">Exemple pour du XHTML 1.0 probl&eacute;matique:</h3>

<table width="100%" cellpadding="10"><tr><td class="xmpcode" bgcolor="#FFFFE0"><pre>
&lt;p title=&quot;Commencement
de
l'histoire&quot;&gt;Texte Texte Texte&lt;/p&gt;
</pre></td></tr></table>

<h3 class="xpl">Explication:</h3>

<p>&Eacute;vitez ce genre de notations.</p>







<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&nbsp;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="ancre_liens">Diff&eacute;rence: liens &agrave; des ancres</a></h2>

<p>En  HTML vous pouvez noter des liens &agrave; des ancres par exemple:<br>
<code>&lt;a href=&quot;#ancre&quot;&gt;Lien&lt;/a&gt;</code><br>
L'ancre correspondante est alors not&eacute;e avec:<br>
<code>&lt;a name=&quot;ancre&quot;&gt;quelque chose&lt;/a&gt;</code><br>
M&ecirc;me les autres attributs comme par exemple l'attribut <code>usemap</code> dans le rep&egrave;re <code>&lt;img&gt;</code> pour mener &agrave; un &eacute;l&eacute;ment <code>map</code> pour lequel un attribut correspondant <code>name</code> est d'autre part not&eacute; utilisent cette technique.</p>

<p>En XHTML ces liens ne fonctionnent pas. XML a besoin de noms du type &quot;ID&quot;, donc d'indicateurs sans ambigu&iuml;t&eacute; pour tout le document, pour &ecirc;tre en mesure de r&eacute;soudre de telles relations. En  XHTML vous pouvez utiliser l'<img src="../../src/chap.gif" width="15" height="13" border="0" alt="Chapitre: vue d'ensemble">&nbsp;<a href="../attributs/index.htm"><b>attribut universel</b></a> <code>id=</code> pour r&eacute;aliser ce genre de liens. Afin que m&ecirc;me les navigateurs qui ne supportent pas XHTML s'en sortent eux aussi, il vous faut noter les deux attributs.</p>

<h3 class="xmp">Exemple pour HTML 4.01:</h3>

<table width="100%" cellpadding="10"><tr><td class="xmpcode" bgcolor="#FFFFE0"><pre>
&lt;a href=&quot;#ancre&quot;&gt;lien&lt;/a&gt;
&lt;p&gt;beaucoup de contenu&lt;/p&gt;
&lt;a name=&quot;ancre&quot;&gt;quelque chose&lt;/a&gt;
</pre></td></tr></table>

<h3 class="xmp">Exemple correspondant pour XHTML 1.0:</h3>

<table width="100%" cellpadding="10"><tr><td class="xmpcode" bgcolor="#FFFFE0"><pre>
&lt;a href=&quot;#ancre&quot;&gt;Lien&lt;/a&gt;
&lt;p&gt;beaucoup de contenu&lt;/p&gt;
&lt;a id=&quot;ancre&quot; name=&quot;ancre&quot;&gt;quelque chose&lt;/a&gt;
</pre></td></tr></table>

<h3 class="xpl">Explication:</h3>

<p>Notez dans l'&eacute;l&eacute;ment <code>a</code> pour l'ancre les deux attributs <code>id=</code> et <code>name=</code>. Affectez aux deux attributs exactement le m&ecirc;me nom. Cela n'occasionne aucun probl&egrave;me &eacute;tant donn&eacute; que les deux attributs ont des &quot;espaces de nommage diff&eacute;rents&quot;. Un navigateur qui veut ex&eacute;cuter le lien d'apr&egrave;s la syntaxe XHTML a besoin de l'attribut <code>id</code> tandis qu'un navigateur qui ex&eacute;cute le lien d'apr&egrave;s la syntaxe HTML utilise l'attribut <code>name</code> pour rechercher l'ancre.</p>







<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&nbsp;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="lang">Diff&eacute;rence: l'attribut universel lang=</a></h2>

<p>Les langages bas&eacute;s sur XML utilisent normalement &agrave; la place de <code>lang=</code> l'attribut universel XML <code>xml:lang=</code>. &Eacute;tant donn&eacute; que l'attribut <code>lang</code> est pourtant &eacute;galement disponible en XHTML, existent deux attributs pour la m&ecirc;me chose. Les analyseurs syntaxiques XHTML pr&eacute;f&egrave;rent pour lever toute ambigu&iuml;t&eacute; l'attribut <code>xml:lang=</code>, qui n'est pas reconnu par les analyseurs syntaxiques purement HTML. Notez toujours pour cette raison dans la pratique les deux variantes au cas o&ugrave; vous utilisez l'attribut.</p>

<h3 class="xmp">Exemple pour HTML 4.01:</h3>

<table width="100%" cellpadding="10"><tr><td class="xmpcode" bgcolor="#FFFFE0"><pre>
&lt;p lang=&quot;fr&quot;&gt;beaucoup de contenu&lt;/p&gt;
</pre></td></tr></table>

<h3 class="xmp">Exemple correspondant pour XHTML 1.0:</h3>

<table width="100%" cellpadding="10"><tr><td class="xmpcode" bgcolor="#FFFFE0"><pre>
&lt;p xml:lang=&quot;fr&quot; lang=&quot;fr&quot;&gt;beaucoup de contenu&lt;/p&gt;
</pre></td></tr></table>

<h3 class="xpl">Explication:</h3>

<p>Notez les deux attributs. L'ordre n'a pas d'importance.</p>







<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&nbsp;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="script_style">Diff&eacute;rence: contenu de passages script et de style</a></h2>

<p>En HTML 4.0 le contenu des &eacute;l&eacute;ments <code>script</code> et <code>style</code> est fix&eacute; en tant que &quot;CDATA&quot;, tandis qu'il est trait&eacute; en tant que &quot;PCDATA&quot; en XHTML. En clair, cela veut dire que pour HTML 4.0 dans un passage script ou de style les signes propres &agrave; HTML comme <code>&lt;</code>, <code>&gt;</code>, <code>&amp;</code> et <code>&quot;</code> ne doivent pas &ecirc;tre masqu&eacute;s. Il n'en va pas de m&ecirc;me pour XHTML. Quand par exemple vous comparez dans une condition si une valeur est plus petite ou plus grande qu'une autre valeur, vous devez noter les parenth&egrave;ses pointues (plus grand que, plus petit que) hors d'une cha&icirc;ne de caract&egrave;res et ne pouvez donc pas les masquer &agrave; cet endroit. Pour r&eacute;soudre le probl&egrave;me, vous pouvez forcer le passage script lui m&ecirc;me en tant que passage  &quot;CDATA&quot;. Pour ce faire, il vous faut employer la notation XML typique correspondante. Ainsi le probl&egrave;me n'est toutefois r&eacute;solu que pour les analyseurs syntaxiques XML. Les interpr&eacute;teurs JavaScript normaux pensent &agrave; peu pr&egrave;s pour cette syntaxe qu'ils ont affaire &agrave; du JavaScript et g&eacute;n&egrave;rent une erreur car il ne s'agit pas de JavaScript valide. Dans ce cas il ne reste plus qu'&agrave; enregistrer le script dans un fichier externe.</p>

<h3 class="xmp">Exemple pour HTML 4.01:</h3>

<table width="100%" cellpadding="10"><tr><td class="xmpcode" bgcolor="#FFFFE0"><pre>
&lt;script type=&quot;text/javascript&quot;&gt;
&lt;!--
  /* Commentaire JavaScript: maintenant suit un petit script */
  if(parseInt(navigator.appVersion) &lt; 4)
    alert(&quot;Oh, un tr�s vieux navigateur&quot;);
  /* et avec cela le script est d�j� termin� */
//--&gt;
&lt;/script&gt;
</pre></td></tr></table>

<h3 class="xmp">Exemple correspondant pour XHTML 1.0:</h3>

<table width="100%" cellpadding="10"><tr><td class="xmpcode" bgcolor="#FFFFE0"><pre>
&lt;script type=&quot;text/javascript&quot;&gt;
&lt;!--
&lt;![CDATA[
  /* Commentaire JavaScript: maintenant suit un petit script */
  if(parseInt(navigator.appVersion) &lt; 4)
    alert(&quot;Oh, un tr�s vieux navigateur&quot;);
  /* et avec cela le script est d�j� termin� */
]]&gt;
//--&gt;
&lt;/script&gt;
</pre></td></tr></table>

<h3 class="xpl">Explication:</h3>

<p>La d&eacute;claration &quot;CDATA&quot; commence avec <code>&lt;![CDATA[</code> et se termine avec <code>]]&gt;</code>. Notez cela pour XHTML en plus dans le commentaire HTML, dans lequel vous voulez placer les contenus des passages script ou de style. Dans le cas contraire un analyseur syntaxique XML signalerait le signe <code>&lt;</code> comme erreur, s'il se trouvait dans le script.</p>

<p>Pour &eacute;viter les erreurs pour les interpr&eacute;teurs JavaScript, reste la possibilit&eacute; de noter les <img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="../../javascript/intro.htm#fichiers_javascript"><b>scripts JavaScript dans des fichiers s&eacute;par&eacute;s</b></a> . M&ecirc;me pour les feuilles de style CSS il est possible de  <img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information">&nbsp;<a href="../../css/formats/incorporer.htm#separe"><b>d&eacute;finir un format global dans un fichier CSS s&eacute;par&eacute; </b></a>.</p>





<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&nbsp;
</td></tr></table>
<h2 class="Sh2"><a class="an" name="imbrication">Diff&eacute;rence: exceptions dans les r&egrave;gles d'imbrication</a></h2>

<p>En HTML 4.0 sont d&eacute;finies quelques exceptions pour les r&egrave;gles d'imbrication d'&eacute;l&eacute;ments. Il est arr&ecirc;t&eacute; par exemple qu'un rep&egrave;re <code>a</code> ne peut contenir d'autre rep&egrave;re <code>a</code>. &Agrave; l'aide de SGML la formulation de telles exceptions est possible. XML ne propose aucune possibilit&eacute; de formuler ces exceptions. Dans les DTD (d&eacute;finitions de type de document) bas&eacute;s sur XML  de XHTML, ces interdictions sp&eacute;ciales d'imbrication manquent pour cette raison. &Eacute;tant donn&eacute; qu'une compatibilit&eacute; &agrave; 100% entre HTML et XML doit &ecirc;tre atteinte, la seule issue pour le consortium W3 &eacute;tait de d&eacute;clarer ces interdictions officieusement comme &quot;annexe officielle&quot; aux DTD de XHTML.</p>

<p>Les r&egrave;gles d'imbrication suivantes sont concern&eacute;es:</p>

<ul>
<li>L'&eacute;l&eacute;ment <code>a</code> ne doit contenir aucun autre &eacute;l&eacute;ment <code>a</code>.</li>
<li>L'&eacute;l&eacute;ment <code>pre</code> ne doit contenir aucun  &eacute;l&eacute;ment <code>img</code>, <code>object</code>, <code>big</code>, <code>small</code>, <code>sub</code> ou bien <code>sup</code>.</li>
<li>L'&eacute;l&eacute;ment <code>button</code> ne doit contenir aucun  &eacute;l&eacute;ment <code>input</code>, <code>select</code>, <code>textarea</code>, <code>label</code>, <code>button</code>, <code>form</code>, <code>fieldset</code>, <code>iframe</code> ou bien <code>isindex</code>.</li>
<li>L'&eacute;l&eacute;ment <code>label</code> ne doit contenir aucun autre &eacute;l&eacute;ment <code>label</code>.</li>
<li>L'&eacute;l&eacute;ment <code>form</code> ne doit contenir aucun autre &eacute;l&eacute;ment <code>form</code>.</li>
</ul>





<table bgcolor="#EEEEEE" class="doc" width="100%"><tr><td>
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a><a href="#bottom"><img src="../../src/bas.gif" width="14" height="10" border="0" alt="vers le bas"></a>&nbsp;
</td></tr></table>
<h2 class="Sh2"><img src="../../src/xhtml10.gif" width="30" height="30" border="0" alt="XHTML 1.0">&nbsp;<a class="an" name="exemple">Exemple d'un document XHTML conforme</a></h2>

<p>L'exemple suivant montre un document XHTML complet dans lequel les  diff&eacute;rences avec HTML peuvent encore &ecirc;tre vues dans un contexte. Vous pouvez appeler l'aper&ccedil;u correspondant d'abord en tant que fichier avec l'extension <var>.htm</var>, une fois en tant que fichier avec l'extension <var>.xhtml</var> et une fois en tant que fichier avec l'extension <var>.xml</var> pour tester par vous-m&ecirc;me ce qui se passe alors dans votre navigateur. Il s'agit exactement du m&ecirc;me contenu, seuls les noms de fichier sont diff&eacute;rents.</p>

<h3 class="xmp">Exemple:</h3>

<p><img src="../../src/docf.gif" width="15" height="10" border="0" alt="D&eacute;monstration - nouvelle fen&ecirc;tre">&nbsp;<a href="affichage/exemple.htm" target="_blank"><b>Exemple d'affichage: aper&ccedil;u</b></a> (<var>exemple<b>.htm</b></var>)<br>
<img src="../../src/docf.gif" width="15" height="10" border="0" alt="D&eacute;monstration - nouvelle fen&ecirc;tre">&nbsp;<a href="affichage/exemple.xhtml" target="_blank"><b>Exemple d'affichage: aper&ccedil;u</b></a> (<var>exemple<b>.xhtml</b></var>)<br>
<img src="../../src/docf.gif" width="15" height="10" border="0" alt="D&eacute;monstration - nouvelle fen&ecirc;tre">&nbsp;<a href="affichage/exemple.xml" target="_blank"><b>Exemple d'affichage: aper&ccedil;u</b></a> (<var>exemple<b>.xml</b></var>)</p>

<table width="100%" cellpadding="10"><tr><td class="xmpcode" bgcolor="#FFFFE0"><pre>
&lt;?xml version=&quot;1.0&quot; encoding=&quot;UTF-8&quot;?&gt;
&lt;!DOCTYPE html PUBLIC &quot;-//W3C//DTD XHTML 1.0 Strict//EN&quot; &quot;xhtml1-strict.dtd&quot;&gt;
&lt;html xmlns=&quot;http://www.w3.org/1999/xhtml&quot;&gt;
&lt;head&gt;
&lt;title&gt;Quand du HTML devient du XHTML&lt;/title&gt;
&lt;/head&gt;
&lt;body&gt;
&lt;h1&gt;&lt;a name=&quot;Start&quot; id=&quot;Start&quot;&gt;Quand du HTML devient du XHTML&lt;/a&gt;&lt;/h1&gt;
&lt;p&gt;Alors tous les &amp;eacute;l&amp;eacute;ments avec un contenu doivent avoir un rep&amp;egrave;re de fermeture.&lt;/p&gt;
&lt;p&gt;Les &amp;eacute;l&amp;eacute;ments vides&lt;br /&gt;
doivent se terminer par une barre oblique.&lt;/p&gt;
&lt;hr noshade=&quot;noshade&quot; /&gt;
&lt;p&gt;Les attributs vides re&amp;ccedil;oivent comme affectation de valeur leur propre nom.&lt;/p&gt;
&lt;p&gt;&lt;a href=&quot;#Start&quot;&gt;Les liens &amp;agrave; des ancres&lt;/a&gt; m&amp;egrave;nent &amp;agrave; la cible en raison de l'attribut id et non pas de l'attribut name.&lt;/p&gt;
&lt;script type=&quot;text/javascript&quot; src=&quot;horodateur.js&quot;&gt;&lt;/script&gt;
&lt;!-- c'est la fa&amp;ccedil;on la plus s&amp;ucirc;re pour des scripts --&gt;
&lt;/body&gt;
&lt;/html&gt;
</pre></td></tr></table>

<h3 class="xpl">Explication:</h3>

<p>L'exemple montre un document XHTML complet typique avec diff&eacute;rentes particularit&eacute;s . la DTD nomm&eacute;e <var>xhtml1-strict.dtd</var> se trouve dans le m&ecirc;me r&eacute;pertoire que le document lui-m&ecirc;me, c'est pour cette raison que pour la mention du type de document n'est not&eacute; comme URI que <code>xhtml1-strict.dtd</code> sans autre adresse Web, ni mention de chemin.</p>







<table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr><td colspan="2" bgcolor="#EEEEEE" class="doc">
&#160;<a href="#top"><img src="../../src/haut.gif" width="14" height="10" border="0" alt="vers le haut"></a>
</td></tr>

<tr><td bgcolor="#EEEEEE" class="doc" align="right"><a href="modularisation.htm"><img src="../../src/suivant.gif" width="10" height="10" border="0" hspace="10" alt="page suivante"></a></td>
<td bgcolor="#FFFFFF"><img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information"> <a href="modularisation.htm"><b>Modularisation de XHTML</b></a>
</td></tr>

<tr>
<td bgcolor="#EEEEEE" class="doc" align="right"><a href="../attributs/gestevenements.htm"><img src="../../src/precedent.gif" width="10" height="10" border="0" hspace="10" alt="page pr&eacute;c&eacute;dente"></a></td>
<td bgcolor="#FFFFFF" width="100%"><img src="../../src/doc.gif" width="15" height="10" border="0" alt="Autre page d'information"> <a href="../attributs/gestevenements.htm"><b>Gestionnaire d'&eacute;v&eacute;nements pour les scripts</b></a>
</td>

</tr>
<tr><td colspan="2" bgcolor="#EEEEEE" class="doc">&nbsp;</td></tr>
</table>

<table cellpadding="4" cellspacing="0" border="0" width="100%">
<tr><td bgcolor="#FFEEDD" class="nav"><a class="an" name="bottom"><img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"></a> <a href="../../index.htm"><b>SELFHTML</b></a>/<a href="../../navigation/index.htm" target="_parent">Aides &agrave; la navigation</a> <img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="../index.htm"><b>HTML/XHML</b></a> <img src="../../src/refchap.gif" width="16" height="13" border="0" alt="Renvoie au chapitre d'origine"> <a href="index.htm"><b>XHTML et HTML</b></a></td>
</tr></table>

<p>&copy; 2001 Stefan M&uuml;nz / &copy; 2003 Traduction <img src="../../src/courriel.gif" width="15" height="10" border="0" alt="Adresse &eacute;lectronique">&nbsp;<a href="mailto:13405@free.fr">Serge Fran&ccedil;ois, 13405@free.fr</a><br><img src="../../src/courriel.gif" width="15" height="10" border="0" alt="Adresse &eacute;lectronique">&nbsp;<a href="mailto:selfhtml@selfhtml.com.fr">selfhtml@selfhtml.com.fr</a></p>

</body>
</html>
